{"text": "Name: dorothy dorothy"}
{"text": "E-Mail: dorothy.dorothy@gmail.com"}
{"text": "Address: Xinyang, China"}
{"text": "Github: https://github.com/dorothy"}
{"text": "LinkedIn: https://linkedin.com/dorothy"}
{"text": "Phone No. 566696694121"}
{"text": ""}
{"text": ""}
{"text": "Summary: "}
{"text": ""}
{"text": "7 years of professional experience in Network engineering with Cisco Certified Network Engineer, performing Network analysis, design, Implementing, capacity planning with a focus on performance tuning and support of large Networks."}
{"text": "Strong knowledge in Cisco Routing, Switching and Security with Cisco hardware/software (heavy Cisco shop) experience."}
{"text": "Experience working on Cisco Catalyst Series3750, 4500, 4900, 6500; Nexus 2000, 5000, 6000 and 7000 series switches, Cisco WAAS."}
{"text": "Extensive work experience with Cisco Routers, Cisco Switches, Load Balancers and Firewalls."}
{"text": "Experience in layer-3 Routing and layer-2 Switching. Dealt with Nexus models like 7K, 5K, 2Kseries, Cisco router models like 7200, 3800, 3600, 2800, 2600, 2500, 1800 series and Cisco catalyst 6500, 4500, 3750, 3500, 2900 series switches"}
{"text": "Knowledge of implementing and troubleshooting complex layer 2 technologies such as VLAN Trunks, VTP, Ether channel, STP, RSTP and MST. Implementation of HSRP, VRRP for Default Gateway Redundancy"}
{"text": "Involved in troubleshooting of DNS, DHCP and other IP conflict problems."}
{"text": "Responsible forASR (9K, 901, and 903),Check Point and Cisco ASA firewall administration across global networks."}
{"text": "Having exposer on Blue Coat Proxy."}
{"text": "Experience in working with Cisco Nexus Switches and Virtual Port Channel configuration."}
{"text": "Worked on F5 LTM, GTM series like 6400, 6800, 8800 for the corporate applications and their availability."}
{"text": "Design and configuring of OSPF, BGP on Juniper Routers (MX960, MX480) and SRX Firewalls(SRX240, SRX550)"}
{"text": "In-depth knowledge and hands-on experience in Tier II ISP Routing Policies, Network Architecture, IP Subnetting, VLSM, TCP/IP, NAT, DHCP, DNS, FT1 / T1 / FT3 / T3  SONET POS OCX / GigE circuits, Firewalls."}
{"text": "Strong knowledge of TACACS+, RADIUS implementation in Access Control Network."}
{"text": "Experience in Designing and assisting in deploying enterprise wide Network Security and High Availability Solutions for ASA."}
{"text": "Experience working with Cisco Nexus 2148 Fabric Extender and Nexus 5000 series to provide a Flexible Access Solution for a datacenter access architecture Expertise in installing, configuring and troubleshooting Juniper EX Switches (EX2200, EX2500, EX3200, EX4200, EX4500, EX8200 series"}
{"text": "Enterprise Routing experience using protocols RIP v1 & 2, EIGRP ,OSPF and BGP"}
{"text": "Expertise in installing ,configuring and troubleshooting Juniper Routers ( E,J,M and T-series)"}
{"text": "Implementing security policies using Cryptography, ACL, SDM, PIX Firewall, IPsec, VPN, and AAA Security on different series of routers."}
{"text": "Knowledge of implementing and troubleshooting complex layer 2 technologies such as VLAN Trunks, VTP, Ether channel, STP, RSTP and MST. Implementation of HSRP, VRRP for Default Gateway Redundancy."}
{"text": "Experience with different Network Management Tools and Sniffers like Wireshark (ethereal), HP-Open view, RSA envision, and Cisco works to support 24 x 7 Network Operation Center."}
{"text": "Experience with F5 load balancers and Cisco load balancers (CSM, ACE and GSS)."}
{"text": "Basic and advance F5 load balancerconfigurations,LTM,GTM, including migrating configurations from Cisco ACE to F5 and general troubleshooting of the F5 load balancers"}
{"text": "Excellent customer management/resolution, problem solving, debugging skills and capable of quickly learning, effectively analyses results and implement and delivering solutions as an individual and as part of a team."}
{"text": "Efficient at use of Microsoft VISIO/Office as technical documentation and presentation tools."}
{"text": "Configure VRRP & GLBP and VLAN Trunking 802.1Q & ISL, STP, Port Security on Catalyst 6500 switches."}
{"text": "Knowledge of JUNOS platform and worked with IOS upgrade of Juniper devices."}
{"text": "Experience with different Network Management Tools and Sniffers like Wireshark (ethereal), HP-Open view, RSA envision, and Cisco works to support 24 x 7 Network Operation Center."}
{"text": ""}
{"text": ""}
{"text": "SKILLS:"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Professional Experience:"}
{"text": ""}
{"text": "Client:\tGeneral Electric,Plano, TX\t                                                                      Feb 2014 – Present"}
{"text": "Role: Sr. Network Engineer\t\t\t\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Responsible for configuration, maintenance, and troubleshooting of dynamic routing protocols: BGP, OSPF & EIGRP (route redistribution, distribute lists, route-maps, offset-lists, prefix lists, route summarization, route-feedback, BGP attributes) on Cisco Routers 7613, 7201, and 3945E."}
{"text": "Working knowledge of frame relay, MPLS services, OSPF, BGP and EIGRP routing protocols, NAT’ing, sub-netting, also including DNS, LDAP, DHCP, http, HTML, HTTPS, TCP/IP, UDP, SNMP, OSPF, RIP, IPSEC, PPTP, VLAN,WISM, STP (Spanning tree Protocol), RTSP & Multicasting protocols."}
{"text": "Experience with design and implementation of Virtual Switching System (VSS) for both User segment and server segment using 6509-V-E catalyst switches"}
{"text": "Experience with managing the completed end to end site solutions"}
{"text": "Experience with design and implementation of Data center migration"}
{"text": "Worked on Migration of Juniper SRX firewalls for isolation of network segments and VPN's , ASR(9k,901,903)."}
{"text": "Designing, Implementing and Troubleshooting Cisco 3750, 3550, 3560, 2924, 6509-V-E, 6513, 6504, 6503, 6506, 6500 series switches, GSR, ASR routers with Cisco IOS and IOS-XR"}
{"text": "Installed, configured and managed Cisco routers such as 7200 series, 3800 series, 3700 series, 2800 series and Cisco Catalyst switch series 6500, 4500, 3500, and 2900."}
{"text": "Upgraded the data center network environment with Cisco ASA 5520.  Configured ACL’s on Cisco Switches as well as configured routers as terminal servers."}
{"text": "Monitoring the traffic through Cisco catalyst switches for Detection of Intrusion using IDSM2 and its Prevention IPS."}
{"text": "Customized the inbound update policy for any member of a peer group."}
{"text": "Implementing 3750 Stackable switches using Cisco Stack Wise technology. Experience to review and evaluate current and future design issues as required maintaining network integrity, efficient data flow."}
{"text": "Experience with convert Checkpoint VPN rules over to the Cisco ASA solution and worked on RSA secure IDs to providing VPN Token to Company USERS. Migration with Cisco ASA VPN experience."}
{"text": "Worked on Layer 2 protocols such as STP, VTP, STP, RSTP, PVSTP+, MST and other VLAN troubleshooting issues and configuring switches from scratch and deployment"}
{"text": "Involved in designing and implementing QOS and policy map to 2800 series routers for all the branches"}
{"text": "Experience Branch Relocation: Connect workstation, servers, etc. Rack and stack Pre-configured new hardware and connect the circuits. Work with Carrier to test and turn-up circuits."}
{"text": "Performed IP address planning, designing, installation, configuration, testing, maintenance, and troubleshooting in complete LAN, WAN development."}
{"text": "Involved in operations and administration of WAN consisting Ethernet Handoffs, T1, DS3, and Optic Fiber Handoffs."}
{"text": "Supporting EIGRP and BGP based on the network by resolving level 2 & 3 problems of internal teams & external customers of all locations"}
{"text": "Racking, Stacking, configuring, Nexus 5K and 2K and 7K, Static pinning fabric interface connection,PortChannel fabric interface connection, Configuring a Fabric PortChannel"}
{"text": "Installed wireless access points (WAP) at various locations in the company."}
{"text": "Actively involved in switching technology Administration including creating and managing VLANS, Port security – 802.1x, Trunking 802.1Q, RPVST+, Inter-VLAN routing, and LAN security on Cisco Catalyst Switches 4507R+E, 6509-E and Cisco Nexus Switches 2232, 5596, 7009."}
{"text": "Created dedicated VLANs for Voice & Data with QOS for prioritizing VOICE over DATA."}
{"text": "Worked on DWDM,SONET."}
{"text": "Configured Voice ports and Dial peers on the call manager for the VOIP call to reach remote destination."}
{"text": "Configured WIFI APs connected in LAN to reduce cable costing by creating AP, worked on Cisco SP Wifi, troubleshoot in Cisco Aironet 3700,1700 and 600 series."}
{"text": "Worked on configuration and commissioning of the MPLS circuits for various branch offices."}
{"text": "Providing Daily network support for national wide area network consisting of MPLS, VPN and point-to-point site."}
{"text": "Performed Network Security Assessment and implemented security improvements such as network filtering, SSH, AAA,SMTP, SNMP access lists, VTY access lists, EIGRP MD5 authentication, and HSRP authentication.  "}
{"text": "Configured of ACL’s in Cisco 5520 ASA firewall for internet Access requests for servers, Protocol Handling, Object Grouping and NAT"}
{"text": "Managing and providing support to various project teams with regards to the addition of new equipment such as routers switches and firewalls to the DMZs."}
{"text": "Responsible for Data Center Migrations and its operations."}
{"text": "Implemented antivirus and web filtering on Juniper SRX 240 at the web server as well as configuration of E F5 load balancers and Cisco load balancers (CSM, ACE and GSS)."}
{"text": "Documenting workflow process, managing and implementing standard policy and procedures."}
{"text": ""}
{"text": "Environment: Cisco 2948/3560/4500/3560/3750/3550/3500/2960/6500 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers ,Cisco Nexus 7K/5K/2K, Cisco ASA5510, "}
{"text": "Checkpoint, windows server 2003/2008: F5 BIGIP, LTM, OSPF, EIGRP, RIP, BGP, VLAN, VPN, Checkpoint, Juniper SRX"}
{"text": ""}
{"text": ""}
{"text": "Client:\tFord Motor,Dearborn, MI\t\t\t                         Oct 2012 – Jan 2014 Role: Sr. Network Engineer"}
{"text": "\t\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Worked as part of a team to manage Enterprise Network Infrastructure as a Tier 3 Support Engineer. "}
{"text": "Helped to update ios of ASR901.  "}
{"text": "Involved in configuring and implementing of Composite Network models consists of Cisco 7600, 7200, 3800 series routers and Cisco 2950, 3500, 5000, 6500 Series switches."}
{"text": "Conversions to BGP WAN routing. Which will be to convert WAN routing from OSPF to BGP (OSPF is used for local routing only) which involves new wan links, work done on WAAS troubleshoot and maintenance, with the help of private peering handled inbound connections."}
{"text": "Replace branch hardware with new 3900 routers and 2960 switches."}
{"text": "Configuring firewall switch module on Cisco 6506 distribution layer switches, configuring VTPs, trunking, inter-vlan routing, port fast, uplink fast, backbone fast on access layer switches."}
{"text": "Enable STP attack mitigation (BPDU Guard, Root Guard), Using MD% authentication for VTP"}
{"text": "Planned and installed Frame Relay WAN links to the branch offices. "}
{"text": "Maintained and setup wireless access points at various locations in the company."}
{"text": "Great understanding of WLAN including 802.11 standards, Lightweight and Autonomous systems, WPA, PEAP."}
{"text": "Assisted in MPLS migrations, implemented a backup for the existing WAN connection using site-to-site IP sec VPN tunnels."}
{"text": "Knowledgeable in configuration of Voice VLAN’s (VOIP), prioritizing the voice traffic over the data traffic, Telecom, using Dark fiber created fast speed line between two campus, Wireless networks."}
{"text": "Worked on Amazon AWS with 3 other person as a team. Security frameworks were developed to protect and provide compliance for virtual systems, cloud computing and mobile applications solutions."}
{"text": "Worked on Network Traffic sizing of cloud to network through security firewalls. "}
{"text": "Load Balancing From The client side"}
{"text": "Implement the firewall rules using Netscreen manager (NSM),Tested and implemented various GTM & LTM attributes"}
{"text": "Monitoring the network traffic with the help of Qradar and Cisco IPS event viewer."}
{"text": "Remediation of firewall rules from checkpoint firewalls to Cisco ASA firewalls and their implementation."}
{"text": "Helped in troubleshooting in DDoS."}
{"text": "Configuring and troubleshooting OSPF routing protocol on the corporate network."}
{"text": "Tested and implemented various BGP attributes such as Local Preference, MED, AS-PATH, Community, Extended community using route-maps."}
{"text": "Worked on migration of Frame Relay based branches to MPLS based VPN for customer’s WAN infrastructure."}
{"text": "Worked on migration of existing PIX firewall to ASA firewall, PIX OS upgrade from 6.3 to 7.0, also configured on BIG IP (F5) Load balancers and also monitored the Packet Flow in the load balancers."}
{"text": "Have good experience working with the Trouble Tickets on F5 Load Balancers."}
{"text": "Switch experience includes Cisco Catalyst switches: Cisco 3750, 4500, 6500 series switches."}
{"text": "Managing enterprise BGP setup by configuring and troubleshooting BGP related issues. "}
{"text": "Scaling of BGP and IGP in the core, dealt with implementation of deployment related to Cisco devices and applying security policies on it."}
{"text": "Troubleshoot issues related to VLAN, VLAN Trunking, HSRP failovers, related issues. "}
{"text": "Configuration of NAT."}
{"text": "Maintain effective communications with vendors, peers and clients in resolution of trouble-tickets, equipment RMAs, and support requests."}
{"text": "Managed data back-ups, scheduled data back-up, and preparation for disaster recovery files."}
{"text": "Planning for upgrade of IOS on devices and performing the upgrade."}
{"text": "Assisted in the architecture, evaluation and recommendations related to purchasing and installing hardware, software related to IP Networking."}
{"text": ""}
{"text": "Environment: Cisco 3750/3550/3500/2960 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers, Cisco ASA5510, Checkpoint,GTM,F5 Load BalancerCisco Nexus7K/5K,Checkpoint,Cisco ASA"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Client: TD Bank, New York City, NY\t\t                                                  Nov 2011 – Sep 2012\t"}
{"text": "Role: Network Engineer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Experience in configuring Site-to-site and remote access VPN solutions."}
{"text": "Installed and configured Cisco 7200 series router and Cisco 2950, 4500, 6500 Series switches."}
{"text": "Configured network using routing protocols such as RIP, OSPF, and BGP and troubleshooting L2/L3 issues. "}
{"text": "Worked on multiple projects related to Branch networks, Campus networks, extranet clients and Data Center Environments involving in data center migrations from one data center to another."}
{"text": "Provided estimated bandwidth requirements for data replication, to best determine adequate timing for migration service levels"}
{"text": "Created data migration strategies to help with completion of migration of data center from one point to another. "}
{"text": "Configuration of Cisco 6500 (sup 720), 4500 (SUP 6) & 3750 Catalyst Switches for network access. "}
{"text": "Worked extensively on Cisco Firewalls, Cisco PIX (506E/515E/525/) & ASA 5500(5510/5540) Series, experience with convert PIX rules over to the Cisco ASA solution."}
{"text": "Configuring RIP, OSPF and Static routing on Juniper M and MX series Routers"}
{"text": "Configuring VLAN, Spanning tree, VSTP, SNMP on EX series switches"}
{"text": "Time to time upgrade network connectivity between branch office and regional office with multiple link paths and routers running HRSRP, EIGRP in unequal cost load balancing to build resilient network."}
{"text": "Design and implement Catalyst/ASA Firewall Service Module for various LAN’s."}
{"text": "Configured Blue Coat ProxySG Web Application Reverse Proxy for securing and accelerate public web applications."}
{"text": ""}
{"text": "Key contribution includes troubleshooting of complex LAN/WAN infrastructure that include routing protocols EIGRP, OSPF, & BGP."}
{"text": "Troubleshoots in Cisco Aironet  2700 and 600 series."}
{"text": "Configured Client VPN and RSA Token ID technologies including Cisco’s VPN client via IPSEC."}
{"text": "Configuring ACL to allow only authorized users to access the servers."}
{"text": "Participated in on call support in troubleshooting the configuration and installation issues."}
{"text": "Installation, maintenance, troubleshooting local and Wide Areas Network (ISDN, Frame relay, DDR, NAT, DHCP, TCP/IP)."}
{"text": "Provided technical support in terms of upgrading, improving and expanding the network."}
{"text": "Providing technical security proposals, detailed RFP responses, and security presentation, installing and configuring ASA firewalls, VPN networks and redesigning customer security architectures."}
{"text": ""}
{"text": ""}
{"text": "Environment:Cisco 3750/3550/3500/2960 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers, Cisco ASA5510, Checkpoint,F5 Load BalancerCisco Nexus7K/5K,Checkpoint,Cisco ASA."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Client: Spectra Techno-Vision India Pvt. Ltd, India\t                                                      Nov 2009 – Oct 2011"}
{"text": "Role: Network Engineer"}
{"text": "\t\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Responsible for the configuration of Cisco Routers (7000, 5300, 4000, 2500, 3000, 2600) using RIP, IGRP, OSPF, EIGRP, BGP"}
{"text": "Implement Cisco IOS Firewall IDS using 2600 series router"}
{"text": "Used DHCP to automatically assign reusable IP addresses to DHCP clients"}
{"text": "Configured and installed multi-protocol (IP, IPX) multi-interface Cisco routers"}
{"text": "Managed office network with Cisco devices with network devices including 2500 and 3600 series routers and 3500, 2900, 1900 series switches"}
{"text": "Analyzing and resolving a high percentage of initial customer contact in the areas of PC/LAN."}
{"text": "Escalating customer problems to management and support groups utilizing standard escalation model."}
{"text": "Extensive experience in configuring and implementing OSPF and BGP."}
{"text": "Supported core network consisting of Cisco 7200 series routers running multi area OSPF."}
{"text": "Configuration of EIGRP and OSPF as interior gateway protocol with route filtering and route redistribution, installed and maintained Cisco 3600, 2600 and 7200 backbone routes with HSRP"}
{"text": "Implemented stub/Totally stub areas. Implemented various OSPF features like route-summarization and SPF throttling."}
{"text": "Experience in WAN technologies like T1/T3,  DS3,STM1 and STM4 circuit types"}
{"text": "Configured Security policies including NAT, PAT, VPN, Route-maps and Access Control Lists."}
{"text": "Implement Cisco Secure Access Control Server (ACS 3.0) for TACACS+/RADIUS"}
{"text": "Redistribution of routing protocols and Frame-Relay configuration "}
{"text": "Network Migration from RIP to OSPF"}
{"text": "Implementation of TCP/IP and related Services-DHCP/ DNS/ WINS"}
{"text": "Pinpointing physical network conditions that are contributing to call quality issues"}
{"text": "Configuring, maintaining and troubleshooting routing protocols such as OSPF, EIGRP and BGP."}
{"text": "Engaged in office moves, helped in identifying network requirements of new building, installed new networking hardware, and coordinated with vendors for cabling/wiring"}
{"text": "Performed troubleshooting, while maintaining trouble ticket tracking, following internal/external"}
{"text": "Escalation procedures and customer notifications."}
{"text": "Configured Cisco Routers for OSPF, IGRP, RIPv2, EIGRP, Static and default route."}
{"text": "Upgrade Cisco Routers, Switches and Firewall (PIX) IOS using TFTP"}
{"text": "Acted as Tier 3 support for connectivity, failures, configuration, implementation, and troubleshooting. "}
{"text": "Provide project management for data center cabling, documented all network drawings using Visio"}
{"text": "Design, test, and implement global Next Generation MPLS network (150 sites) using Cisco 3800, 2800, 2600, and 1721 routers using BGP and EIGRP protocols."}
{"text": "Implementing traffic policy changes with Cisco PIX Firewall appliance switch WAP configuration and installations."}
{"text": ""}
{"text": ""}
{"text": "Client: BefreePvt .Ltd, India                                                                                     Nov 2007 - Oct 2009                                                                                                                      "}
{"text": "Network Support Engineer \t\t\t\t\t\t\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Configuring OSPF, RIP, EIGRP protocols and IP sub-netting, Routers and Switches."}
{"text": "Supported and maintained networking devices, cabling and standalone systems as part of job duties."}
{"text": "Installed and Configured Active Directory in Windows Server 2003 and helped System Admins to set up LAN network in the company."}
{"text": "Maintained systems up to date with the latest OS patches."}
{"text": "Installed different software on the systems. Install and managing network devices including Hubs, Switches."}
{"text": "Layer 2 switching technology architecture, implementation and operations including L2 and L3 switching and related functionality. This includes the use of VLANS, STP, VTP and their functions as they relate to networking infrastructure requirements including internal and external treatment, configuration and security."}
{"text": "Layer Three routing protocol configurations include, but are not limited to distance vector and link state protocols such as: Directly Connected Interfaces, Static Routing, RIP, RIP2, IGRP, EIGRP, OSPF and other proprietary protocols used by Cisco"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "EDUCATION: Bachelors of E&C Engineering. May 2010 (Part-Time) Gujarat Technological University,Gandhinagar.Gujarat.India."}
{"text": "\tDiploma in E&C Engineering.June 2007 Govt. Polytechnic Dahod. Gujarat, India. "}
{"text": ""}
{"text": "CERTIFICATION: Cisco Certified Network Associate"}
{"text": "     Cisco Certified Network Professional   "}
{"text": ""}
{"text": "REFERENCES: Available upon request"}
{"text": "\tWilling to relocate"}
{"text": "\t\t"}
{"text": ""}
{"text": ""}