{"text": "Name: florence florence"}
{"text": "E-Mail: florence.florence@gmail.com"}
{"text": "Address: Madrid, Spain"}
{"text": "Github: https://github.com/florence"}
{"text": "LinkedIn: https://linkedin.com/florence"}
{"text": "Phone No. 546493573667"}
{"text": "                         "}
{"text": ""}
{"text": "Qualification Profile:"}
{"text": "Decisive, action oriented and result focused Business Analyst with 8 plus years of diversified industry work experience in Banking, P&C Insurance, Healthcare and e-commerce. Outstanding areas of skills include: "}
{"text": ""}
{"text": "Requirement Elicitation\t\tOperations and Reporting\t\tRisk Management"}
{"text": "Change Management\t\tUser Acceptance Testing (UAT)\t\tData Analysis"}
{"text": "Employee Training\t\tVendor/Contract Management"}
{"text": "\t\t"}
{"text": "SUMMARY:"}
{"text": ""}
{"text": "8+ years of experience in various components of business analysis with considerable domain expertise in P&C Insurance, Healthcare, financial, e-commerce and banking industry. "}
{"text": "Proficient in working with users and stakeholders to elicit, analyze, communicate and validate requirements using JAD and Brainstorming sessions, identify Functional, Non-functional and Business Rules and then create process flow."}
{"text": "Used Confluence tool to share business knowledge and JIRA for project tracking, running sprints and product backlogs and bug tracking."}
{"text": "Experience in handling full SDLC from association with end-users for requirements, system analysis development, testing, implementation and maintenance."}
{"text": "Experience in Agile/Scrum and all ceremonies."}
{"text": "Experience in analyzing and preparing Project Deliverables such as Project Charter, BRD’s, FRD’s."}
{"text": "Experience in UAT for performance, reliability and fault tolerance issues. "}
{"text": "Analyzed test results, identified issues and reported it to the developers and project manager through JIRA."}
{"text": "Well versed with the traceability matrix and tools used to track back to the parent document."}
{"text": "Served as a mentor and delivered the product trainings to client project teams."}
{"text": "Excellent organizational, interpersonal, and communication skills with the flexibility and skill required to adjust to tight schedules, limited budgets and frequently changing work priorities"}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "E & J Gallo Winery, Modesto CA \t\t\t\t\t\tAugust 2018- Present"}
{"text": "Business System Analyst "}
{"text": "Project: Migration project from EDW Netezza to SAP HANA. Manage and coordinate deliverables using established methodologies for migrating reports to Micro Strategy. "}
{"text": "Responsibilities: "}
{"text": "Use Agile to define the development life cycle."}
{"text": "Use JIRA for creating/updating projects, user stories and tracking progress and all relevant work."}
{"text": "Conduct brainstorming sessions with the business team to capture business requirements and system behavior. "}
{"text": "Communicate requirements to internal technical teams and vendors through Business Requirement Documents and User Stories. "}
{"text": "Use MS PowerPoint, MS Word & MS Visio to document data flow of the AS IS process and TO BE process."}
{"text": "Use SQL queries on various databases to find the main source of data required and getting the output to build the solution."}
{"text": "Worked within Pre-sales group as primary line of support for Liferay Alfresco Portal / Enterprise Java Content Management practices."}
{"text": "Coordinate Daily Stand ups and Weekly Retrospective meetings."}
{"text": "Review, size and prioritize stories during weekly Iteration Planning Meetings. "}
{"text": "Perform UAT and provide approval for Production deployment."}
{"text": "Prepared narratives for Walk Me system for Micro Strategy, prepared Knowledge Articles for Service Now. "}
{"text": "Lead the product through its entire lifecycle from inception to launch."}
{"text": "Environment: Agile, Scrum, MS Office (MS Word, MS Access, SQL, MS Excel, MS PowerPoint, MS SharePoint, MS Visio), Tableau, Micro Strategy, TOAD, Notepad ++, JIRA, SAP HANA, WEB IDE"}
{"text": ""}
{"text": ""}
{"text": "California Casualty Insurance Company, San Mateo, CA \t\t\tApril 2017 – July 2018"}
{"text": "Business Analyst"}
{"text": "Project: Manage and coordinate deliverables using established methodologies for enhancement of personal lines policies in the Guide wire Core System Suite (Policy Center, Claim Center, and Billing Center)."}
{"text": "Responsibilities: "}
{"text": "Used Agile to define the development life cycle."}
{"text": "Created and managed epics, user stories, risks, issues and defects in JIRA."}
{"text": "Conducted brainstorming sessions with the business team to capture business requirements and system behavior. "}
{"text": "Communicated requirements to internal technical teams and vendors through Business Requirement Documents and User Stories. "}
{"text": "Create test cases, perform testing and provide approval for UAT."}
{"text": "Used SQL queries on various databases to find the main source of data required and getting the output to build the solution."}
{"text": "Responsible for identifying and documenting business rules. "}
{"text": "Prepared User Manuals and participate in demonstration and training of the end users. "}
{"text": "Involved in developing several reports like new business, lost business, high net worth clients, high claims frequency."}
{"text": "Environment: Agile, Scrum, Clear Case, XML, MS Office (MS Word, MS Access, SQL, MS Excel, MS PowerPoint, MS SharePoint, MS Visio), Notepad ++, JIRA, SQL"}
{"text": ""}
{"text": ""}
{"text": "Fremont Bank, San Francisco, CA \t\t\t\t\tFeb 2016 – April 2017"}
{"text": "Position: Business Analyst"}
{"text": "Project: Project involved working on the enhancement of a low cost, interim web-based solution to have quick access to a full view of the customer’s accounts, service information and contact history. This project reduced the need to go to mainframe screens for profile and service information. Also, worked on Make an Appointment- Online-to-Store project to enable users to schedule appointments via Fremont bank website to meet with a banker in person. Once scheduled, appointment details will be transmitted to the designated store/​banker for fulfillment (sale, cross-sell, or servicing)"}
{"text": "Responsibilities:"}
{"text": "Participated in requirements gathering meetings, both functional and non-functional, after conducting extensive user interviews with stakeholders and end users."}
{"text": "Prepared BRDs, GAP Analysis of current state (As-Is) and proposed state (To-Be) situations as represented on MS Visio."}
{"text": "Worked in an AGILE/SCRUM environment which posed initiating several JAD sessions and active interaction with business and technical teams."}
{"text": "Created detailed Product Backlog Documents, Work Flows and UML diagrams like Activity, State and Class."}
{"text": "Participated in the Bug Review meeting to discuss outstanding issues with QA team and developers. "}
{"text": "Tested Client/Server, Web Based, Mobile and Stand-Alone applications in different environments also on smart phones and tablets."}
{"text": "Environment: Quality Center, Clear Case, QTP, Agile, Scrum, Selenium, Load Runner, Oracle, XML Linux, Web server, XML, Oracle, iOS."}
{"text": ""}
{"text": ""}
{"text": "Macys Inc., San Francisco, CA     \t\t\t\t\t\tAug 2014 – Jan 2016                                     "}
{"text": "Position: Business Analyst"}
{"text": "Project Description: Macy’s is one of the leading retailers in the US. "}
{"text": "The project involved the enhancement of an already existing online feature called ‘The Wedding Shop’. The user interface was altered to be more visually appealing and new features were added to further convince Macy’s customers to utilize the online application. Worked e Commerce Business & Technology functionalities like Product/Catalog Management, Pricing, Promotions, Checkout, Order Management, , Omni-channel Solutions."}
{"text": "Responsibilities:"}
{"text": "Performing business requirements gathering, technical direction and domain expertise for marketing initiatives and web analytics tracking."}
{"text": "Communicated requirements to internal technical teams and vendors through Business Requirement Documents and User Stories. "}
{"text": "Worked in an AGILE/SCRUM environment which posed initiating several JAD sessions and active interaction with business and technical teams."}
{"text": "Participated in the Bug Review meeting to discuss outstanding issues with QA team and developers. "}
{"text": "Worked closely with both development and testing teams in performing User Acceptance Testing (UAT)."}
{"text": "Environment: "}
{"text": "MS PowerPoint, Requisite Pro, MS Visio, Adobe Flex, MXML, Adobe In Design, Adobe Photoshop, MS Excel, MS Access, J2EE, Oracle, UML and Prototyping."}
{"text": ""}
{"text": "Tufts Health Plan Inc., Watertown, MA                                                                   Jun 2013 – Aug 2014"}
{"text": "Position: Business Analyst"}
{"text": "Project Description: This project involved enhancements to Tufts Health Care mobile app which offers personalized health care including Email you doctor, Appointments scheduling, Video Visits, Express Check in and Health reminders. "}
{"text": "Responsibilities:"}
{"text": "Acted as a liaison between Business and Technical teams"}
{"text": "Translated the business needs into Business Requirement Document and User stories"}
{"text": "Performed functional testing on iOS and Android devices."}
{"text": "Participated in User Acceptance Testing, Smoke Testing and Regression Testing"}
{"text": "Managed Backlog and User stories using Rally tool."}
{"text": "Working knowledge of EPIC application."}
{"text": "Conducted release planning, product grooming and iteration planning meetings"}
{"text": "Environment: Agile/Scrum, JIRA, Rally, Tridion, Google Analytics, Java, Objective-C, iOS SDK, MS Visio, Jenkins, Test Flight, X code, Device Anywhere, EPIC, My SQL, Windows 7"}
{"text": ""}
{"text": "Quest Diagnostics, New Haven, CT\t\t\t\t\tJan 2011–May 2013"}
{"text": "Business Analyst"}
{"text": "Project: This project was for the development of in-house software Electronic Claims Processing Software (ECPS) for automated claims processing. The software was to enable process automation covering the major claim processing lifecycle like claim filing, underwriting, claim clearing house and payments."}
{"text": "Responsibilities:"}
{"text": "Defined the scope of the project, prepared BRD’s, FRD’s and Supplementary Specification Document (non-functional) from gathered requirements. "}
{"text": "Facilitated Joint Application Sessions (JAD) / Joint Requirement Planning (JRP) sessions to develop architectural solutions."}
{"text": "Conducted focus group sessions to determine whether the application meets the business requirements, to resolve open issues and change in requirements."}
{"text": "Maintained the Requirement Tractability Matrix (RTM) using Test Director."}
{"text": " Held sessions on HIPAA regulations and Consumer's Bill of Rights to ensure compliance."}
{"text": "Environment: RUP, ASP. Net, Windows NT/ 2000, Crystal reports, Rational Requisite Pro, Rational Clear Quest, Rational Clear Case, Enterprise Architect, MS Office, MS Visio"}
{"text": ""}
{"text": ""}