{"text": "Name: maggie maggie"}
{"text": "E-Mail: maggie.maggie@gmail.com"}
{"text": "Address: Allahābād, India"}
{"text": "Github: https://github.com/maggie"}
{"text": "LinkedIn: https://linkedin.com/maggie"}
{"text": "Phone No. 841480888599"}
{"text": ""}
{"text": ""}
{"text": "Experienced Information Security Engineer with over 5+ years of experience in information system security, engineering, and management of cyber security. This includes, but not limited to IP Networks, Network Intrusion Detection and Active Directory."}
{"text": "**************************************************************************************"}
{"text": "Professional Abridgement"}
{"text": "Expert Level Knowledge about TCP/IP and OSI models."}
{"text": "Logging and monitoring infrastructure with Splunk. "}
{"text": "Involved in troubleshooting of DNS, DHCP and other IP conflict problems"}
{"text": "Analysed Web traffic and inspected email contents for potential malware and infection.  "}
{"text": "Knowledge base and familiarity with the latest cutting-edge technologies, including firewalls, VPN, IDS,  IPS, DMZ, encryption, IPsec, proxy services, Site to Site VPN tunnels, MPLS/VPN, SSL/VPN."}
{"text": "Experience on vulnerability assessment and penetration testing using various tools like Burp Suite, OWASP ZAP Proxy, Nmap, Nessus, Rapid 7, Kali Linux and Metasploit. "}
{"text": "Worked on FTP, HTTP, SSL, DNS, DHCP servers in windows server-client environment with resource allocation to desired Virtual LANs of network."}
{"text": "Worked on the migration to new Checkpoint R77 Firewalls on GAIA from CISCO PIX Firewalls"}
{"text": "Supervising the administration of systems and servers related network to ensure availability of services to authorized users."}
{"text": "Experience with Firewall Administration, Rule Analysis, Rule Modification."}
{"text": "Define and implementing Unix operating system strategy with application installation and configuration. "}
{"text": "Experience in Checkpoint Firewall on SPLAT and VPN technologies, Stateful inspection, and Global rule base, address spoofing."}
{"text": "Utilized Security Information and Event Management (SIEM), Intrusion Detection & Prevention (IDS / IPS), Data Leakage Prevention (DLP)"}
{"text": "Experience in Splunk Development, Configuration and Administration. "}
{"text": "Engineered Splunk to build, configure and maintain heterogeneous environments and in-depth knowledge of log analysis generated by various systems including security products."}
{"text": "Troubleshooting and resolve the Splunk - Performance, Log Monitoring Issues; Role Mapping, Dashboard creation, Data models etc. "}
{"text": "Experience in applying PKI technology to business systems.  "}
{"text": "Architected new deployments of QRadar SEIM; including required hardware and EPS sizing with optimal licensing. "}
{"text": "Deployed custom configurations of the QRadar appliance via development of backend SQL queries for custom reporting and logging. "}
{"text": ""}
{"text": "Skills:"}
{"text": "Protocols : NAT, TCP/IP, UDP, RIP, EIGRP, OSPF, VTP, VLAN, SSL, VPN, HTTP, HTTPS, FTP, DNS, ICMP"}
{"text": "Switches : Cisco Catalyst VSS 1440 / 6500, 4500, 3750, 2950, 3500XL"}
{"text": "Routers :  Cisco Routers ASR 7600, 7200, 3800, 3600, 2800, 2600, 2500 , 1800"}
{"text": "Languages: Java, MySQL, python, JavaScript, Linux. "}
{"text": "NetworkManagement: Wire shark, TCP Dump, Net Flow, SNMP, Netcool."}
{"text": "OperatingSystems : Windows XP/7/8, Windows Server 2000/2003/2008, Solaris UNIX"}
{"text": "Security Tools: Splunk, IBM QRadar, HP ArcSight, Nessus, OpenVas, Kali Linux, Rapid 7, DVWA, Metasploitable2, BlueCoat, Volatility."}
{"text": "PenTest Tools: Metasploit, NMAP, Wireshark and Kali"}
{"text": "Security Software: Nessus, Ethereal, NMap, Metasploit, Snort, BASE"}
{"text": "Firewall: Cisco ASA, Fortinet, Juniper, Checkpoint."}
{"text": "IT Security/ Frameworks: IDS/IPS, Malware analysis, Logging and Monitoring, Vulnerability Management, Application and Infrastructure security, Reporting and Documentation, Digital forensics, Ethical Hacking, Penetration Testing, SDLC, ITILv3."}
{"text": "\t"}
{"text": "Certification and Education"}
{"text": "Master of Science in Cyber Security"}
{"text": "Diploma in Information Assurance and Security (Level 7)"}
{"text": ""}
{"text": "Apple Inc. Sunnyvale, CA (Dec 2016 - Present)"}
{"text": "Information Security Engineer"}
{"text": "Experience building firewalls, mainframes, and UNIX based platforms at the data center and implementing the initial policies, configuring NAT, Routing etc."}
{"text": "Developed python scripts to generate custom reports and FTP/Email."}
{"text": "Deployed and maintained IS-IS on Cisco and Juniper routers."}
{"text": "Application administration for Qradar, Splunk and Tanium."}
{"text": "Responsible design, deployment operation of a Security Incident and Event Management solution based on Splunk. "}
{"text": "Log analysis and advisories to different customers through RSA envision SIEM."}
{"text": "Experience in security for the following platforms: Windows physical and virtual desktops and laptops, UNIX / Linux Servers, Windows servers, Database as well as RSA (EMC), McAfee (Intel), FireEye, Symantec endpoint security tools and good knowledge of SAN technology."}
{"text": "Deploy Tanium to support security operations in classified and unclassified environments within Department of Defense (DoD) enterprise network."}
{"text": "Perform patch management to workstations and servers using the Tanium application to meet specific patching timelines."}
{"text": "Utilized the Blue Coat Proxy, SIEM, SOC, Tuffin, IPS/IDS."}
{"text": "Initiated global projects deploying zScaler, Symantec Endpoint Encryption, Qualys and SourceFire NIDs."}
{"text": "Create and maintain high-quality documentation of all relevant specifications, systems, and   procedures. "}
{"text": "Supporting the activities of UNIX vulnerability by identifying, prioritizing and eradicating risks in UNIX environments. "}
{"text": "Repaired and diagnosed UNIX hardware and application software.  "}
{"text": "Develop data cleansing, retrieval, migration tools (ETL) using python."}
{"text": "Maintained 15 Juniper 6611/4610/2600 Remote Access Pulse Secure MAG firewalls."}
{"text": "Worked in Data center environment with Cisco UCS 6200 interconnects Cisco UCS B-series Blades and Cisco UCS 5100 series blade server chassis and implemented RAC mounted servers."}
{"text": "Operational experience with Blue Coat technology (Proxy SG, Director/Management Center, Proxy AV/Content Analysis System (CAS), WebPulse, Data Leak Prevention (DLP), Authentication and Authorization Agent (BCAAA) or equivalent from another enterprise-class proxy vendor (e.g., Cisco, Forcepoint (formerly Raytheon Websense), or Intel Security (McAfee))"}
{"text": "Experience in managing Active Directory Domain Controllers, DNS and DHCP Servers. "}
{"text": "Utilizing ArcSight Smart Connectors, Logger appliances and HBSS server log analysis to verify proper SIEM security event flow."}
{"text": "Performed mobile security assessments. "}
{"text": "Created and managed use cases, analyze correlated traffic, created and monitor channels, create and send reports, collected detailed evidence to support cases with SIEM HP Arcsight Application Worked with SIEM tools such as IBM QRadar to get real-time analysis of security alerts generated by network hardware and applications."}
{"text": "Tested application and general IT control for SOX and FSA clients. Performed operational control testing for SSAE16 clients."}
{"text": "Extract the logs, perform real time log analysis using SIEM technologies and Forensics Analysis of logs as per the request."}
{"text": "Followed PCI standards for creating policies."}
{"text": ""}
{"text": "Pitney Bowes ,Shelton, CT(Oct 2015- Nov 2016)"}
{"text": "Security Analyst"}
{"text": "Managed several security technologies including McAfee Endpoint Security (HBSS), Nessus Vulnerability Scanner (ACAS), Tanium ESSM, AirTight, SCCM, Splunk, and other security tools managed by the enterprise security team."}
{"text": "Experienced in Implementing & managing Symantec Data Loss Prevention. "}
{"text": "Implemented long term security measures, patches and honeypots. "}
{"text": "Experienced in creating, testing and implementing DLP Policy/Rules to ensure client data confidentiality. "}
{"text": "Experience in security for the following platforms: Windows physical and virtual desktops and laptops, UNIX / Linux Servers, Windows servers, Database as well as RSA (EMC), McAfee (Intel), FireEye, Symantec endpoint security tools and good knowledge of SAN technology."}
{"text": "Responsible for Data Loss Incident investigation and Remediation. "}
{"text": "Proficient in writing arcsight queries, dashboards and reports for DLP Incident metrics."}
{"text": "Installation, configuration and set up of arcsight and relevant components."}
{"text": "Customizing correlation searches, alerts, reports and dashboards using Arcsight loggers and Connectors."}
{"text": "Working with Arcsight support team for various arcsight issues and licenses."}
{"text": "Familiar with IDM solutions such as Provisioning, Review, SoD (Segregation of Duties) and PDM (Profile Data Mapping)."}
{"text": "Issue, revoke, renew and recover certificates for the PKI office in compliance. "}
{"text": "Experience in packet analysis and packet capture using Wireshark. "}
{"text": "Daily responsibilities included design, implementation, support and administration of multiple security products running CheckPoint Provider-1, SourceFire."}
{"text": "Monitor and investigate security incidents and alerts with arcsight, FireEye, Palo Alto, SourceFire and McAfee EPO. "}
{"text": "Built custom Tanium sensors to fill the gaps that where left by our other data collection tools."}
{"text": "Analyze prevention from the invasions through the malware detection and removal."}
{"text": "Threat Hunting with Splunk, Qradar, Tanium and RSA Security Analytics. "}
{"text": "Application administration for Qradar, Splunk and Tanium. "}
{"text": "Experience working with Network monitoring using tools like Netflow Analyzer and Netcool for troubleshooting issues. "}
{"text": "Implementing monitoring solution to gather data on ISP utilization and Netflow management. "}
{"text": "Extensive experience in business process engineering and software development life cycle, including analysis, design, development, testing and implementation of software applications."}
{"text": "Experience in configuring the security policies using Juniper NetScreen. "}
{"text": "Extensive knowledge in Business Analysis, PKI, SSO, Kerberos, TCP/IP, DNS, VPNs and Symantec DLP"}
{"text": "One (1) Arcsight ESM Installation Upgrade and Migration from ESM 6.0 to 6.9p1"}
{"text": "Four (4) Arcsight Express Installations and Migrations"}
{"text": "Arcsight ESM software / Arcsight Express appliance installation and configuration"}
{"text": "Develop systems that assist the organization to secure the CIA categorizing and selection ofcontrols using NIST."}
{"text": "Followed AAA security principles for securing the information."}
{"text": "Performed DDOS mitigation to avoid data theft and downtime. "}
{"text": "Hexagon Solutions , India                                                (Jan 2012- July 2015)"}
{"text": "Security Analyst"}
{"text": "Performed Computer Security Incident Response activities for a large organization, coordinates with other government agencies to record and report incidents"}
{"text": "Monitored and analysed Intrusion Detection Systems (IDS) to identify security issues for remediation"}
{"text": "Recognized potential, successful, and unsuccessful intrusion attempts and compromises thorough reviews and analyses of relevant event detail and summary information"}
{"text": "Evaluated firewall change requests and assess organizational risk. "}
{"text": "Provide guidelines for implementing secure systems to customers or installation teams. "}
{"text": "Assisted with implementation of counter-measures or mitigating controls. "}
{"text": "Ensured the integrity and protection of networks, systems, and applications by technical enforcement of organizational security policies, through monitoring of vulnerability scanning devices. "}
{"text": "Performed periodic and on-demand system audits and vulnerability assessments, including user accounts, application access, file system and external Web integrity scans to determine compliance."}
{"text": "Design the Web listeners and firewall policy rules on reverse proxy to allow the Internet users to access the Internal servers/ resources through Internet."}