{"text": "Name: sophie sophie"}
{"text": "E-Mail: sophie.sophie@gmail.com"}
{"text": "Address: Changde, China"}
{"text": "Github: https://github.com/sophie"}
{"text": "LinkedIn: https://linkedin.com/sophie"}
{"text": "Phone No. 863306747831"}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": ""}
{"text": "Over 8+ years of professional experience as a Front End UI Developer developing web applications. Worked in designing User Interface applications and professional web applications uing HTML,XHTML,CSS2/CSS3,JAVASCRIPT,JQUERY,AJAX,JSON,NODEJS,ANGULARJS,"}
{"text": "Experienced in working with Integrated Development Environment like Eclipse, GitHub, Rational Application Developer and Rational Software Architect."}
{"text": "Designed websites with W3C standards using HTML4/5, CSS2/3 to get best cross-browser user experience for long-term user retention and engagement."}
{"text": "Designed UIpatterns and UI applications with the help of Adobe products like Adobe Dreamweaver CS3, Adobe Photoshop CS3/CS4, Adobe Fireworks CS3 and Adobe Illustrator CS3."}
{"text": "Built cross browser compatibility applications using Angular.js and Node.js."}
{"text": "Experience working in MVC Architecture based frameworks like AngularJS."}
{"text": "Proficient in building Web User Interface (UI) using HTML5, CSS3, DHTML, table less XHTML, JavaScript, Bootstrap and J Query that follows W3C Web Standards and are browser compatible."}
{"text": "Experience with various MVC Java frameworks like Angular.JS, EXT.JS, Backbone.JS, Node.JS, React.JS,ExpressJS."}
{"text": "Highly proficient in developing and deploying Java/J2EE applications on Application Servers - Weblogic, IBM WebSphere, JBOSS, and Apache Tomcat."}
{"text": "Combined HTML, CSS and JavaScript using Ruby language to the web server. "}
{"text": "Wide experience in using various IDEs', Notepad++, Eclipse, Sublime Text, Web Storm and Visual Studio. "}
{"text": "Created an internal browser based text editor using HTML, CSS, JQuery."}
{"text": "Experience in Installing, Configuring and setting up Development Environment using CVS, Clear Case and Clear Quest."}
{"text": "Expertise in Backend script using Python."}
{"text": "Proficient in designing applications using JAVA and J2EE Design patterns."}
{"text": "Implemented MVC frameworks using STRUTS and SPRINGS."}
{"text": "Used latest Object/Relational persistence and query service (ORM) Hibernate in combination with Struts, Spring in a J2EE framework."}
{"text": "Working knowledge of JDBC, Oracle, SQL and PL/SQL. Solid understanding of Relation Database Theory."}
{"text": "Experience in designing and developing applications using UML tools like My Eclipse, Rational Rose and Microsoft Visio."}
{"text": "Good exposure on Java Web Services using SOAP, WSDL."}
{"text": "Expertise in creating Software Requirements Document (SRD), preparing Functional Design Document (FDD), Detailed Technical Design Document (TDD), UML Diagrams, Effort estimation, coding standards, design / code review and test cases documents."}
{"text": "Worked underAgile and Scrum Methodology."}
{"text": ""}
{"text": "Technical Skills:"}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "TOYOTA,Torrance,CAFeb’16-TILLDATE"}
{"text": "Sr. UI Developer"}
{"text": "Project Description:"}
{"text": "Toyota is one of the largest company among manufacturing cars. In the Toyota headquarters we handled internal portal where we store the data of all products we sell."}
{"text": "Responsibilities:"}
{"text": "Involved in all the phases of SDLC including Requirements Collection, Design &Analysis of the Customer Specifications, Object Oriented Programming Analysis and Design (OOAD),Development&Customization of the Application."}
{"text": "Developed web interface for Users Modules using JSP, HTML, XML, CSS, Java Script, AJAX, and Action Servlets with Struts Framework, spring frame work"}
{"text": "Implemented User Friendly UI design with HTML, CSS and JavaScript for client side validation and form submission functions."}
{"text": "Involved in designing the user experience interface UI/UX strategy, UI requirements, converting findings into UI designs."}
{"text": "Created Angular JS controllers and services."}
{"text": "Called Rest web services through Angular js services to get JSON Object and modified the response object to display in UI."}
{"text": "Developed Date Time Picker using Object Oriented JavaScript extensively. Responsible for setting up Angular JS framework for UI development. Developed HTML views with HTML5, CSS3, JSON, and AngularJS. "}
{"text": "Move company applications and databases from one Unix server to another for hardware upgrades. "}
{"text": "Involved in intense User Interface (UI/UX) operations and client side validations using AJAX toolkit."}
{"text": "Extensive knowledge on XML including XML Schema, XSLT, XPath, and XQuery."}
{"text": "Created Type Script reusable components and services to consume REST API's using Component based architecture provided by angular 2."}
{"text": "Executed admin configurations and deployed applications on WebSphere Application Server (WAS 8.0)."}
{"text": " Responsible for backups and recovery for servers at all sites, both Unix and windows servers. "}
{"text": " Using Angular JS created custom directives for data manipulations and to display data in company standard format in UI. "}
{"text": " Involved in Web design and development for the UI interface design, graphic design for printed materials and presentations, illustration, logo design. Used HTML, CSS, and JavaScript. "}
{"text": "Worked in developing dynamic robust UI screens using CSS, HTML, XHTML, XSLT, JavaScript, Bootstrap, Backbone, Sancho Exit's, ember.js and JQuery. "}
{"text": "Experienced in developing Hybrid Mobile Applications using XML, CSS, HTML, DHTML, XHTML, JavaScript, jQuery, AngularJS, ReactJS and AJAX Technology. "}
{"text": "Consolidated to a single-page application for a streamlined user experience via AngularJS and AJAX."}
{"text": " Used Angular JS for data-binding, and Node JS for back-end support with APIs. "}
{"text": "Skillful in using CSS/CSS3 for embedding media materials into the websites."}
{"text": "Managing a production infrastructure on Amazon Web Services VPC utilizing AWS Code Deploy, S3, EC2, container Service, Cloud Formation including Auto Scaling. "}
{"text": " Experience in creating VM for Linux, Windows and Solaris. LVM, ZFS and zone management."}
{"text": " Virtualize the servers on AWS using the Docker, create Docker files and version control."}
{"text": "Designed and developed the agent portal using framework AngularJS 2.0 along with HTML5, CSS3, and TypeScript."}
{"text": " Worked on XML related technologies like XSL, XSD, XQuery, XSLT, SAX, DOM, XPath, WSDL, DTD, XSD, Apache Axis, JAXP (SAX, DOM), JAXB, XML Beans parsers for parsing XML in to Java object. "}
{"text": "Hands on experience with Windows Azure, Cloud Services, Storage/Storage Accounts, Azure Traffic Manager."}
{"text": " Conducting analysis on ANT build projects for conversion and converting to MAVEN build projects. "}
{"text": " Exposure to new features and issues addressed in Angular 2.0. "}
{"text": "Used React Js for rendering views and also to update the Document object model dynamically."}
{"text": "Used AJAX extensively to implement front end /user interface features in the application."}
{"text": "Used spring framework for transfer the data from GUI to DB with Ajax frame work."}
{"text": "Designed user friendly navigation for displaying various sections of data using JQuery."}
{"text": "Used multithreading extensively in the math engine was rather ahead of its time. Its immediate purpose was to enhance the user experience of the program by deferring lengthy calculations to background threads."}
{"text": "Hands-on experience in python programming fundamentals, SQL scripts, OOPS concepts, data structure, DBMS, ASP.NET, ADO.NET, and MVC modules."}
{"text": " Involved in deploying applications into MuleSoft CloudHub and Mule Management Console. Created custom components and configured them in mule-cofig.xml and verified with the XSLT standards. "}
{"text": " Highly involved in requirement analysis and application design meetings with business analysts and team members to finalize the requirements and Created Initial page layouts using wireframes. "}
{"text": "Built the responsive UI with AngularJS, Bootstrap3, Node.js and SCSS. Developed the dash board for displaying charts, graphs and other analytics-related widgets."}
{"text": " Experience in popular JavaScript frameworks such as Angular.js, Node.js, jQuery, Require.js, Express.js, D3.js, Jasmine, Karma with automation tools like Grunt, Gulp with NPM and Bower. "}
{"text": "Implemented code coverage using Karma and Jasmine for Angular JS on the client side. "}
{"text": " Tech stack used was HTML5, CSS3, JavaScript, AngularJS, ASP.NET Web API2, C#, Entity Framework and SQL Server."}
{"text": " Worked in the area of continuous delivery, DevOps, cloud integration using Docker, Chef, Puppet and Jenkins, Bamboo, Atlassian confluence tools, Grafana, ELK, Google Analytics, Terraform, kubernetes, Mesos and Marathon. "}
{"text": "Skilled in leading frameworks as Node, Angular, to build high-quality, scalable and reusablecomponents and Front-end solution. Worked in accord with the Visual Standards team to make certain the app complies with system UI/UX standards."}
{"text": "Designed and developed a custom interactive graph utilizing the javascript D3 library."}
{"text": " Designed UI for the application's structure, navigation, appearance, interaction conventions, and business features. Created diagrams, wireframes, and HTML/CSS prototypes. Wrote use cases, UI specifications and a UI Style Guide. "}
{"text": " Business logic is implemented using Spring Core and Hibernate.Experienced in writing and validating UI data with SQL developer and SOAP UI response file data with couchbase. "}
{"text": " Administered Linux servers for several functions including managing WebSphere, Apace/Tomcat server, mail server, MySQL database, SVN, build and firewalls in both development and production. "}
{"text": " Configured 12 node Cassandra clusters with 4 datacenters across different regions. "}
{"text": "Handled various performance issues on Mongodb/ Cassandra. "}
{"text": " Deployed the built docker image on Mesos using Marathon. Using a multi-container setup deployed on Mesos."}
{"text": " Developed the integration workflows using Mulesoft ESB 3.7.3 framework. "}
{"text": "Stronger grasp on HTML5, CSS preprocessors, JavaScript and JQuery, good coding standards."}
{"text": " Experienced in transforming the wireframes and mockups to develop web pages."}
{"text": "Design and implement a Context RESTful API using Java Springboot ."}
{"text": " Developed UI/UX with Twitter Bootstrap and Angular JS front-end frameworks to add responsiveness, CSS3 and jQuery libraries used to customize front-end. "}
{"text": " Designed React template components that automate D3 layout functions to allow developers with no D3.js experience to use library. Consumed SOAP and REST Web Services using Mulesoft connector for gathering remote information."}
{"text": "Developed Functional Requirement Document based on users’ requirement."}
{"text": "Worked with Production deployment to support the scheduled releases part of development team."}
{"text": "Used Jenkins for the automatic build process."}
{"text": "Environment: JDK 1.6/1.7, Eclipse, Type Script, Microsoft Visio, JQuery Websphere, Framework, AWS, HTML5,CSS3, LESS/SASS, Java Script,Node.JS,Angular.JS,Express.JS, Angular JS."}
{"text": ""}
{"text": "ACCENTURE, Seattle, WANov’14 –Jan’16"}
{"text": "Sr. UI Developer"}
{"text": "Project description:"}
{"text": "Accenture is one of the professional company which provides online customer support,consulting and operational services, IT services and cloud services.And we have handled online technical support in the portal."}
{"text": "\t\t\t\t"}
{"text": "Responsibilities:"}
{"text": "Created interactive web pages and applications by usage of HTML, CSS, Angular JS, NodeJS and JQuery (Concentrations in MEANStack)."}
{"text": "Created Angular JS controllers and services."}
{"text": "Called Rest web services through Angular js services to get JSON Object and modified the response object to display in UI."}
{"text": "Worked on D3 library to implement charts and line graphs, "}
{"text": " Experience in working with SASS/LESS (CSS compiler) framework using variables, mixins, nested statements and so on. "}
{"text": " Created RESTFUL services using Web API, built HTTP services and formatted responses using web API media type formatter to JSON. "}
{"text": "Strong expertise using frameworks such as Apache Cordova, Ionic, OnSenUI, Sencha. "}
{"text": " Worked on the modernization of a legacy and outsourced UI. Technologies used were Backbone.js, Angular.js, ember.js."}
{"text": " Expertise in using builds tools like MAVEN and ANT for the building of deployable artifacts such as jar, war and ear from source code. Application Deployments & Environment configuration using Puppet and Chef. "}
{"text": "Extensive experience in development and design of software applications using C#,VB.Net, ASP.NET,MVC, ADO .NET, AJAX, LINQ, WCF,WPF, CSS, JQUERY, SQL SERVER(Azure), Web Services and Microsoft Windows Azure Cloud Services."}
{"text": " Excellent working experience in backend using different spring modules like Spring Core Container Module, Spring Application Context Module, Spring MVC Framework module, Spring AOP Module, Spring ORM Module in Web applications. "}
{"text": "Redesigned website elements; maintains existing site content; enhances and adds new features and functionality with widgets, internal pages, wire frames, and promotional materials, full HTML/ Active Server Pages (ASP) pages, banners and demos. "}
{"text": "Solid Understanding of Object Orient Programming concepts (OOPS). "}
{"text": "Familiar with popular browsers development and debugging tools/plugins for IE tester, Chrome Inspector, Firebug , Jasmine and Karma testing framework. "}
{"text": "Experience in working with version control (GIT)."}
{"text": "Experienced with Mule administration, configuration, tuning, Mulesoft MMC and Enterprise release capabilities."}
{"text": "Integrated various modules and deployed them in WebSphere Application Server."}
{"text": " Worked with SOAP based and Restful Web Services to fetch dynamic content from backend databases. "}
{"text": " Installing RedHat Linux using kick start and applying security polices for hardening the server based on thecompany policies."}
{"text": "Wrote Unix script to check nightly backup tapes and figure out if it is the correct tape and format if necessary, automated process. Converted Unix scripts to windows command line scripts for same. "}
{"text": " Setup monitoring standards as per application SLA using Nagios for Cassandra and MMS for Mongo. "}
{"text": " Improved CD by using all modules of Elastic beanstalk, Mesos, ELK on AWS cloud. Ensuring end-to-end support for API and WEB team - application servers of all micro-services. "}
{"text": "Knowledge on Jasmine and karma helps to do unit testing as well as end to end testing."}
{"text": "Used angular js filters for filter functionality in search box and Iterator functionalities."}
{"text": "Built great user interfaces with Modern JavaScript Frameworks like React JS."}
{"text": "Used JQuery Selectors to show and hide the particular content."}
{"text": "Responsible in developing integration workflows using Mule ESB framework and implemented Data weave and content based routing using Mule ESB. "}
{"text": "Designed and reviewed the test scenarios and scripts for given functional requirements and automated test cases in Selenium.Work closely with Java Developers, QA, creative directors, content producers, and UI designers to create and maintain the front-end code for Hybrid Mobile Apps.  "}
{"text": " Introduced CSS style guide OOCSS, preprocessor Sass and best practices to manage large filesystems. "}
{"text": "Worked as UI/UX developer for the MCIO Engineering team which is responsible for designing, building and operating global datacenters; managing the demand planning and capacity utilization with emphasis on automation, data driven engineering, cost effectiveness and environmental sustainability. "}
{"text": " Developed Unit Test cases using Jasmine and Karma. "}
{"text": "Standardized backup and restore practices for Mongo / Cassandra. "}
{"text": "Experience building React applications from scratch using React JS, React Fundamentals, ES6/ES7 for React, React Native and Redux+ImmutableJS. "}
{"text": "angular Administered Cassandra Cluster with OpCenter 5.0, Adding and removing Nodes, Node Repair, and Backups."}
{"text": " Implemented the Design Patterns like Session Facade, Data Transfer Object (DTO), Service Locator, and Data Access Object (DAO). Developed the web pages using JSP and Servlets. "}
{"text": " Design and implement a SMART on FHIR application using Java Spring boot, HTML5, JQuery, JavaScript and SMART on FHIR library. Wrote Unix script to allow authorized none root users to perform specific root only tasks - add users, delete users, lock/unlock accounts, reset passwords. "}
{"text": "Worked with UX designers to implement details of the design using Typescript, CSS, and HTML5 and AngularJS 1.5.0.  Installation and configuration of various flavors of Linux like RedHat Linux, Suse, Ubuntu and fedora servers. "}
{"text": " Used MAVEN as a dependency management tool to manage all the dependencies that are required. Deployed the built docker image on Mesos using Marathon. Using a multi-container setup deployed on Mesos."}
{"text": " Expertise in developing applications using Microsoft technologies such as .NET Framework […] Web applications using ASP.NET MVC , ASP.NET WEB API, Win Forms using Microsoft Visual C#.NETand VB.NET, Database access using ADO.NET, Entity Framework, and LINQ and distributed applications using WCF ."}
{"text": " Various Charting/UI tools like JQplot, High Charts, Google API, jQuery UI and Bootstrap."}
{"text": "Experience in writing Power shell script to do Patching, Imaging and Deployments in Azure. "}
{"text": "Experience in Private Cloud and Hybrid cloud configurations, patterns, and practices in Windows Azure and SQL Azure and in Azure web and database deployments. "}
{"text": "Excellent working Knowledge of ASP.NET controls and Layouts/Master Pages for consistent layout of pages in the application. "}
{"text": " Created Dashboards using generated reports from TFS in SharePoint Site."}
{"text": "Implement a message bus system using Java Springboot, Rabbit MQ, and MongoDB."}
{"text": " Testing, evaluation and troubleshooting of different NoSQL database systems and cluster configurations to ensure high-availability in various crash scenarios. "}
{"text": " Experience with various MVC Java frameworks like Angular.JS, EXT.JS, Backbone.JS, Node.JS, Ember.JS,bootstrap."}
{"text": " Experienced with Microsoft Application building blocks for .Net projects (Data Access, Exception Handling, Caching and Configuration Management). "}
{"text": "Responsible for maintaining Multiple DevOps tools & configuring across all projects Subversion (SVN), GIT, Maven, Jenkins, ANT, Artifactory, Chef. "}
{"text": "Developed views and controllers using Spring MVC and Spring Core. "}
{"text": " Maintained Iron Mountain management of weekly tapes sent off-site for UNIX and Windows backups. "}
{"text": "Responsible for the overall layout design, color scheme of the web site using HTML5, XHTML and CSS3. Used CSS LESS/SASS preprocessors. And Responsible for creating detailed wire frames and process flows."}
{"text": "Design, code, test, and support .NET web applications using ASP.NET MVC, C#, Visual Studio 2010, HTML, CSS, MVC design patterns, GUI, AJAX, JavaScript, ADO.Net.  "}
{"text": " Knowledge on HTML 5 & CSS3, and MVC Frameworks like EmberJS, EXTJS, NodeJS, D3JS, Handlebars JS, Meteor JS and Backbone JS, Jasmine."}
{"text": "Worked in an agile environment delivering output in sprints and participating in scrums."}
{"text": " Experience with multiple frameworks like ExtJS, NodeJS, Dojo Toolkit, Striper, etc."}
{"text": ""}
{"text": "Environment: JQuery, Angular JS Eclipse, Hibernate, XML, Selenium, Websphere, XSLT, CSS, DOM, Grunt, GWT, DHTML, Junit 4.4 and Agile Scrum."}
{"text": ""}
{"text": "HUMANA HEALTH CARE, Louisville, KY"}
{"text": "Sr. UI DeveloperApr’13-Oct’14"}
{"text": "Responsibilities:"}
{"text": "Analyzed, Designed and developed the system to meet the requirements of business users."}
{"text": "Implemented presentation layer using Knockout JS and Back bone JS."}
{"text": "Used Angular JS Framework for building web apps and have Hands on Spring Framework."}
{"text": "Participated in the design review of the application to come up with UI and provide best possible"}
{"text": "Procedure for the application from UI standpoint."}
{"text": "Experience of working on CSS Preprocessors like LESS and SASS along with JavaScript task runners like Gulp JS."}
{"text": "Implemented transaction management, high level authentication and authorization, logging and Exception Handling using Spring Security and AOP. "}
{"text": "Plan and install upgrades of database management systems (DBMS) software as necessary to enhance database performance."}
{"text": "Worked in Agile environment with active participation in sprint planning, estimation, code reviews, etc. "}
{"text": "Performed Java development for the development of Java Proof of Concept."}
{"text": "Provided dependency analysis for third party jar for migration purpose."}
{"text": "Implemented various complex PL/SQL queries when needed."}
{"text": "Implemented presentation tier using HTML, CSS by utilizing the mockups that were created by design team."}
{"text": "Expertise in SQL Server Integration Services (SSIS) and SQL Server Reporting Services (SSRS) with good knowledge on SQL Server Analysis Services (SSAS). "}
{"text": " Expertise in Angular Js and Node.js. Worked on JavaScript testing tools like Jasmine, Grunt and Chrome developer tools. Used Bower to manage various components in a website so that right versions of the packages are always installed. "}
{"text": " Installed Jenkins/Plugins for GIT Repository, Setup SCM Polling for Immediate Build with Maven and Maven Repository (Nexus Artifactory) and Deployed Apps using custom ruby modules through Puppet as a CI/CD Process. "}
{"text": "Worked with NVD3 OpenCharts in Sencha Touch and AngularJS. "}
{"text": "Written Junit test cases for testing UI Framework classes and wrote many Java Scripts, D3, JSON, Three JS to do client side validations."}
{"text": "Build Stand Alone applications using Spring Boot. "}
{"text": " Created unique web pages using bootstrap and material design templates Designed GUI for Geographic information systems used in fiber cable networks. "}
{"text": "Created an internal browser based text editor using HTML, CSS, JavaScript, Require.js, Backbone, Ember.Js, Jasmine"}
{"text": "Knowledge in solving cross-browser compatibility issues using Firebug, Firebug Lite, IE and Chrome Developer Toolbar. "}
{"text": "Various Charting/UI tools like High Charts, Google API, Jquery UI and BOOTSTRAP. "}
{"text": "• Did extensive JavaScript and JQuery programming to give AJAX functionality for the website. "}
{"text": "Created Income Driven Repayment Application Popup Review Screen using ASP.net modal popup and JQuery.Worked on integrating JQuery APIs with MVC pattern. "}
{"text": "Used AJAX frameworks like JQuery, JSON to develop rich GUIs and also involved in performance tuning the website."}
{"text": "Designed dynamic and browser compatible pages using HTML5/HTML, DHTML, CSS and JavaScript. "}
{"text": "Experience in installing Operating Systems using DVD and Network. Experience in Jumpstart/Kickstartinstallations forRed Hat Linux and AIX Servers. "}
{"text": "Wrote test plans and performed unit testing and performance testing."}
{"text": "Developed screen functionality using HTML, CSS, JavaScript."}
{"text": "Used AJAX for implementing part of the functionality for Customer Registration, View Customer informationmodules."}
{"text": "Enhance the user interface using HTML5, CSS3 and JavaScript Libraries like JQuery, AngularJS."}
{"text": "Developed UI using JavaScript, HTML, CSS, JavaScript validations and XML."}
{"text": "Implemented interaction between frontend and backend using the JSON object."}
{"text": "Wrote Cross Browser code of CSS and JavaScript for Internet Explorer and Firefox."}
{"text": "Written CSS to provide table free layout to user interface screen."}
{"text": ""}
{"text": "Environment: HTML, CSS, JavaScript, jQuery, AJAX, JSON, JAVA, J2EE."}
{"text": ""}
{"text": "US BANK, Minneapolis,MN\t\t\t\t\tFeb’12-Apr‘13"}
{"text": "Sr. UI Developer"}
{"text": "Responsibilities:"}
{"text": "Developed screens based on JQUERY to dynamically generate HTML and display the data to the client side. Extensively used JSP tag libraries."}
{"text": "Created single page applications using Required.JS and developed with web services using SOAP and REST using data formatting like XML,SAML,OAUTH"}
{"text": "Designed and developed UI screens using JSF, Facelets, Prime Faces, JavaScript, and XHTML."}
{"text": "Familiar with concepts of Directives, Data-Binding and Dependency Injection in Angular JS."}
{"text": "Developed single page web application using JavaScript framework Angular JS."}
{"text": "Implemented a security module in AngularJS which integrated with the spring security in the backend with Authentication and Authorization."}
{"text": " Supported application development by tweaking the existing codes and/or write new codes from scratch using JavaScript / jQuery."}
{"text": " Used Continuous Integration tools like Team city, Octopus, TFS, tortoise SVN, GIT HUB for maintaining the versions of the code. "}
{"text": "Strong Business Software design and development experience in Retail, Manufacturing and Finance industry using PowerBuilder, Oracle, MS SQL Server, and .NET. "}
{"text": " Experienced in SOA and Web Services technologies, including Restful, JAX-WS, JAX-RPC, Axis, SOAP, XML, WSDL, SAX and SAAS based design. "}
{"text": " Experience in database related work primarily creating tables, stored procedure, Views, Triggers, Functions and Indexes using PL/SQL. "}
{"text": "Designed dynamic and browser compatible pages using HTML5/HTML, DHTML, CSS and JavaScript.  "}
{"text": "Designed, defined the process for developers to develop with XSLT. Developed an XSLT unit testframework."}
{"text": " Experience in designing and implementing various web applications in both LAMP (Linux, Apache, MySQL, PHP) and WAMP (Windows, Apache, MySQL, PHP) Environments. Working with a team to move existing web apps to react with ES6 Features.  Automated build scripts using Cruise Control with ANT, Maven and Shell Scripts. Designed and developed XML/XSLT proof of concept applications. Utilized"}
{"text": "Used Spring Security for Authentication and authorization extensively."}
{"text": "Designed and developed a RESTful style Web Services layer to interface with DB2 system, and an AJAX front end. Used Java, HTML, CSS, and the JavaScript libraries Prototype and Rico."}
{"text": "Used XML to transfer the application data between client and server."}
{"text": "XSLT style sheets for the XML data transformations."}
{"text": "Performed unit and functional testing using Junit and Mockito mocking framework. "}
{"text": "Experience in managing and configuring tools for back-ends to implement Load balancing, Caching, Content Delivery such as Varnish, Memcache, CDNs, NGINX. "}
{"text": "Used JUnit to write repeatable tests mainly for unit testing."}
{"text": "Developed UML use-case, class, object, sequence, collaboration and activity diagrams using UMLet"}
{"text": "Participated in designing Web service framework in support of the product."}
{"text": "Developed web services in Java and Experienced with SOAP, WSDL. Have also designed and developed REST interfaces in Java."}
{"text": "Developed and implemented various Ajax Frameworks such as jQuery, JSON."}
{"text": "Created Application Property Files and implemented internationalization."}
{"text": "Involved in complete development of ‘Agile Development Methodology’ and tested the application in each iteration."}
{"text": "Used Selenium Webdriver for automating functional testing and to identify various critical applications."}
{"text": "Involved E2E Development by integrating Front End and Backend by Debugging."}
{"text": ""}
{"text": "Environment:JDK 1.5, Servlets, EJB 3.0, XML, JQuery, Web Service(JAX-WS),HTML, JSF 2.0 PrimeFaces version 3.5, AJAX, DOJO, JavaScript, Adobe Dreamweaver CS5."}
{"text": ""}
{"text": "AMERICAN EAGLE, Pittsburg, PA\t\t\t\t\t\tDec’10-Jan’12"}
{"text": "Java/UI Developer"}
{"text": "Responsibilities:"}
{"text": "Developed user Interfaces using JSP's to provide unique personalized look-and-feel for administrators and other users of the system using HTML, CSS and JavaScript."}
{"text": "Implemented Ajax to create highly optimized, browser-compliant JavaScript and HTML."}
{"text": "Wrote reusable components for presentation end to use across all the other modules in the applications such as pagination, dynamic rending of table data with customized view etc."}
{"text": "Designed new models with an Object Oriented approach using JS and jQuery components for CRM application for customer service."}
{"text": " Expertise in developing Client/Server Applications using .Net Framework […] with Three Tier Architecture, N-Tier Architecture. "}
{"text": "Worked on the Plan Focus / Plan Sponsor website from start to finish to give it a new look using HTML5/CSS/JavaScript. "}
{"text": "Developed web presentation layer using HTML and CSS according to internal standards and guidelines.Experience in usingjQuery for the WebPages.Used JS for custom client-side validation and DOM manipulations."}
{"text": "Involved in OOA/Design, UML Modeling and in developing Use Case Diagrams, Class diagrams, Behavioral Diagrams (Activity Diagrams, and Sequence Diagrams)."}
{"text": "Involved inJAVA, J2EE, struts, web services and Hibernate in a fast paced development environment.Helped to create functionalities for Payment Request Forms for Contractors using JavaScript / jQuery. "}
{"text": " Strong understanding of Object Oriented Programming (OOP'S) and MVC Concepts in Programming. Worked with the Back-End team and Quality assurance team in the process."}
{"text": "Used Struts framework for the flow of the pages a created Action classes and action forms."}
{"text": "Struts Validation Framework is used for server side validation.Developed design Patterns like Factory and Singleton and used extensively.Developed configuration classes for accessing configuration and database information."}
{"text": "Primitive client side validations are handled using JavaScript.Used JDBC to connect to back end database Oracle.Used MySQL extensively by developing different tables and run SQL queries on them."}
{"text": "Conducted unit and integration testing using JUnit. Involved in project enhancements and maintenance."}
{"text": "Environment: Java, HTML, CSS, JavaScript,JDBC,UML, JSON, XML, JQuery,JUnit, Agile, Apache."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "WIPRO, BANGLORE,India\t\t\t\t\tJun’08– Nov’10"}
{"text": "Java Developer"}
{"text": "Responsibilities:"}
{"text": "Involved in several phases of the project including application analysis, technical design, development, debugging, testing & documentation and incorporation of user feedback to plan enhancements in the application system."}
{"text": "Programmed and made sides to reach their optimum potential using C SHARP."}
{"text": "Developed the code for the tabulated listings, reports and charts for the performance of the employees using MVC design pattern and on Struts Framework (Struts MVC) and data access."}
{"text": "Developed front-end user interface modules by using JSP, HTML and CSS. Front-end validations of user requests carried out using Java Script.Developed the interacting JSPs and Servlets for modules like User Authentication and Performance Display."}
{"text": "Developed the Actions classes, logic classes for executing business logic, DAO classes to access the Database using JDBC. Used Clear Case as a source code controller, Used Clear Quest for issues and defects (bug tracking).Involved to develop Multithreading for improving CPU time."}
{"text": "Responsible for code reviews, writing unit test cases and unit test using JUnit. Monitored error logs using Log4j framework."}
{"text": ""}
{"text": "Environment: JAVA, JSP, Struts, JDBC, HTML, CSS, JavaScript, Web Services, DB2, ANT, Log 4j, Linux and JUnit."}
{"text": "EDUCATION:"}
{"text": "Bachelor’s in Engineering, JNTU Kakinada, INDIA."}
{"text": ""}