{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Guangzhou, China"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 653394470768"}
{"text": ""}
{"text": "Summary:"}
{"text": "Highly self-motivated software professional with around 8 years of experience in Design, Development, Testing and Implementation of various web based applications."}
{"text": "Experienced in developing applications(enterprise) using Web 2.0 technologies like HTML/ HTML5, CSS/CSS3, LESS, JSON, ANGULAR JS 1.x, 2.0 & 4.0, JavaScript, Typescript (ES6), AJAX, JSON, XML."}
{"text": "Expertise in Client Side validations using HTML/HTML5, CSS/ CSS3 and Java Script. "}
{"text": "Agile software developer working with distributed agile teams, involved in daily meetings (SCRUM), Sprint planning/Sprint Retrospective/Sprint Demo meetings."}
{"text": "Involved in Architecture, Design and Development of Object Oriented Software Systems and building complex, high performance, scalable and easily maintainable solutions for N-tier, Web, and Distributed applications."}
{"text": "Experience in developing applications in Service oriented architecture (SOA) by publishing and consuming Web Services which has been developed using SOAP, Restful protocols, XML, JAXB, XSD and Apache Axis2 framework"}
{"text": "Collaborated with team on implementing new features and UX in an agile environment."}
{"text": "Ability to rapidly prototype interface designs in hand-coded validating, standards-compliant, and semantically rich code and be aware of cross-browser compatibility and bugs. "}
{"text": "Excellent working knowledge and thorough exposure on compatibility issues with different versions of browsers like Internet Explorer, Mozilla Firefox, Safari and Google Chrome. "}
{"text": "Good knowledge in Twitter Bootstrap and Responsive Design. "}
{"text": "Good working knowledge on fixing 508 issues."}
{"text": "Experience in database programming using Oracle, SQL Server, DB2, MySQL databases."}
{"text": "Experience in using Application servers like Apache Tomcat 6.x/7.x."}
{"text": "Performed unit testing using JUnit aiding test driven development in some scenarios."}
{"text": "Strong debugging skills using Firebug, IE Tester and Chrome Developer Tools "}
{"text": "Experience in using version control tools such as SVN, CSV and GIT. "}
{"text": "Hands on experience in using the tools such as Webstorm, Sublime Text, SVN, GIT, Source tree, Notepad ++, Eclipse, etc."}
{"text": "Effective team player with excellent communication skills, problem solving skills, analytical skills and computing abilities. "}
{"text": ""}
{"text": "Technical Skills:"}
{"text": " "}
{"text": ""}
{"text": "Professional Experience:"}
{"text": "USPTO, Alexandria, VA                                                                                     March 2018 – till date"}
{"text": "Patent Trial and Appeal Board End to End (PTABE2E)"}
{"text": "Sr. Angular Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Used NPM for installing required node modules and other published Angular NPM modules."}
{"text": "Worked Extensively with Angular CLI for creating components, Services, pipes, Directives."}
{"text": "Worked on some of the new features of Angular 4 like new if else syntax, ng-templates, and form validators."}
{"text": "Designed and developed the application using  Angular  framework along with HTML5, CSS3, Type Script, Java Script, Bootstrap, Node.js, NPM"}
{"text": "Moved existing AngularJS controllers and services to Angular components for more responsive and less dependency."}
{"text": "Enhanced legacy application by building new components in Angular 4 and typescript."}
{"text": "Developed single page applications using Angular 4, Typescript, web pack and grunt."}
{"text": "Hands on Experience on Angular technology for one complete project in rebasing the UI of the application using the techniques in Angular 4."}
{"text": "Experienced with deployments, maintenance and troubleshooting applications on Azure Cloud."}
{"text": "Extensively Worked on CSS Background, CSS Positioning, CSS Text, CSS Border, CSS Margin, CSS Sprites, CSS Padding, CSS Table, Pseudo Elements & Classes, and CSS Behaviors in CSS."}
{"text": "Involved in agile software methodologies using TEST DRIVEN DEVELOPMENT(TDD)."}
{"text": "Used Axure RP 8 for creating ux screens for the business requirements from product owners."}
{"text": "Used agile central to keep track of bugs to reduce downtime, increase productivity, and Communication between the team and product owners."}
{"text": ""}
{"text": "Environment: Angular (4), Angular CLI, TypeScript, JavaScript, Node.js, NPM, Express.js, JQuery, Bootstrap, Ajax, HTML5, CSS3, GIT, WebStorm, TDD, Jasmine, Karma, LESS, Axure."}
{"text": ""}
{"text": ""}
{"text": "FDA/ IBM, Silver Spring, MD                                                                      June 2017 – \tFeb 2018"}
{"text": "JANUS non clinical"}
{"text": "Mobile/ Web Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for setting up AngularJS framework for UI development. Developed html views with HTML5, CSS3, bootstrap, Angular 4.0 and Ionic."}
{"text": "Implemented code according to coding standards of FDA."}
{"text": "Created custom components and services in angular 4.0 to reuse in multiple modules."}
{"text": "Tested cross browser functionality and fixed major layout bugs for supported browsers."}
{"text": "Using SVN as source repository and controlling versions of the code."}
{"text": "Identifying and fixing the browser performance related issues in the application along with production deployment and validation support."}
{"text": "Developed the tables using ag-grid and charts with plotly"}
{"text": "Participated in the daily agile scrum meetings and design review meetings."}
{"text": "Converted the business requirements to UI technical requirements and worked on design documents. "}
{"text": "Leveraged angular resources for all data access, encapsulating URLs and standardizing data access interfaces. Created custom services for re-usable components."}
{"text": "Using Eclipse neon, Adobe Bracket, Angular debugger and ng-inspector tools."}
{"text": "Performed layout of web pages using HTML5, CSS3, and SASS/SCSS Compass."}
{"text": ""}
{"text": "Tech Stack: Angular 4.0, Typescript, HTML5, CSS3, NPM, Bower, Node.js, ag-grid, Web pack, JSON, SVN, Bootstrap3, Tomcat, REST, Oracle, Jenkins, Spring, visual studio, Eclipse, Ionic 3, Mobile design"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "USPTO, Alexandria, VA                                                                                     Aug 2016 – May 2017"}
{"text": "PAIR Bulk Download (PBD)"}
{"text": "Sr. Angular Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed web application using web technologies like Angular and Node.js with cutting edge HTML5, CSS3 and Bootstrap frameworks. Developed the code using the USPTO and best coding standards."}
{"text": "Extensive experience in Angular  for application implementation, proficient in creating  SPA, customizable pipes  and directives to realize functionalities like REST service with Ajax call, input validations, searchable and sortable contents."}
{"text": "Participated in Agile Development Team, and having daily SCRUM meeting for progress reporting as well as task distributing."}
{"text": "Involved in providing technical expertise to project team covering application design, database design and performance tuning activities"}
{"text": "Tested the application flow and controllers extensively with jasmine/ karma/ protractor and angular’s built-in testing facilities."}
{"text": "Investigated the code compliance with Standards and Style manually and with the help of tools"}
{"text": "Involving in promoting code deployments to local Tomcat server for testing in Windows environment, and continuous integration using Jenkins onto Tomcat server."}
{"text": "Pushing and pulling the code to/from the central SVN and Git Repositories for code integration and version control."}
{"text": "Worked closely with various interfacing teams for smooth and bug free delivery of application under mission critical time lines."}
{"text": "Created S3 buckets in the AWS environment to store files, sometimes which are required to serve static content for a web application."}
{"text": "Tech Stack: Angular 1.6, HTML5, CSS3, NPM, Bower, Node.js, JQuery, Grunt, Wireframes, Webpack, Source Tree, XML, JSON, SVN, GIT, Bootstrap3, Tomcat, Jboss, AWS, Jenkins, Maven, Webstorm, Eclipse, and Angular-performance."}
{"text": ""}
{"text": "ISBAN (Santander), Dorchester, MA                                                                       Jan 2014 – July 2016"}
{"text": "CRM (ONE/ RISK) "}
{"text": "Sr. UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Web application development using AngularJS, HTML5, CSS3 and Bootstrap frameworks."}
{"text": "Worked on generating PDF documents using XSL Formatting objects and stylesheets."}
{"text": "Contributed to making application responsive by the standardization of CSS layout rules to promote style reusability, and achieve cross-browser consistency."}
{"text": "Developed CDG (a mobile app) using Ionic framework."}
{"text": "Used Subversion SVN for version control initially and migrated to GIT later and JIRA for tracking issues."}
{"text": "Used tools such as sublime and Eclipse IDE, Source Tree, Webpack."}
{"text": "Extensively used Bootstrap for customization of web application."}
{"text": "Expertise in developing dashboards and mapping the data for multiple users, sort, search and working on web-based interaction models."}
{"text": "Involved in code reviews and testing the application for browser compatibility and responsiveness using media queries and bootstrap."}
{"text": ""}
{"text": "Tech Stack: Javascript, NPM, Bower, Node.js, AngularJs 1.x, JQuery, Grunt, Wireframe, Webpack, Karma, Jasmine, Protractor, Source Tree, WebSphere, Jboss, REST, DB2, XML, XSL, SVN, Bootstrap3, CSS3, HTML5, Jenkins, Java, Spring, J2ee, Maven."}
{"text": ""}
{"text": "Vecna Technologies, Cambridge, MA                                                                     June 2013 – Dec 2013"}
{"text": "Patient Portal | Angular JS Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Followed Agile – Scrum methodology for development of the product. Using Atlassian Jira Agile for Agile scrum project management/update"}
{"text": "Implemented the application with XP methodology as agile process, refactoring the existing code and writing new code"}
{"text": "Developed the web pages Java, JavaScript, JQuery, AngularJs, HTML5, CSS3, bootstrap and J2EE technology framework using Spring, Hibernate, and Web Services with J2EE design patterns"}
{"text": "Developed and consumed restful web services using Apache CXF Framework"}
{"text": "Worked on Hibernate object/relational mapping according to database schema"}
{"text": "Involved in creation of Test Cases for JUnit Testing"}
{"text": "Worked on Git Repository for code integration and version control"}
{"text": "Used Maven for Build Automation; ensuring proper settings, avoiding/solving any errors"}
{"text": "Worked on AJAX implementation for retrieving the content and display it without reloading the existing page. Worked on JSON to populate required modules in jQuery."}
{"text": "Worked on designing and executing the automation scripts using Selenium."}
{"text": "Involved in improving the site tuning and performance of webpages by HTTP profiling in chrome and Firefox."}
{"text": ""}
{"text": "Tech Stack: J2EE, Eclipse 3.x, Java Script, JQuery, Angularjs, Bootstrap, node.js, Apache CXF, Tomcat, CSS, AJAX, XML, JUNIT, WSDL, PostgreSQL , Jenkins, Git, JSON, Ubuntu"}
{"text": ""}
{"text": "SunTrust, Orlando, FL  \t\t\t\t\t                              Jan 2012- May 2013   "}
{"text": "Credit Approval Processing System | Software Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in extensively developing and implementing requirements provided by business"}
{"text": "Developed the web pages using HTML, JavaScript, CSS, JQuery, Servlets and Java/J2EE technology framework using Spring (MVC, JDBC), and Web Services with J2EE design patterns using IntelliJ IDEA"}
{"text": "Involved in creation of Test Cases for JUnit Testing by following TDD."}
{"text": "Confirmation Registration Email processing is done using JMS with MQ Series provider"}
{"text": "Used Maven and Ant for Build Automation; ensuring proper settings, avoiding/solving any errors"}
{"text": "Involved in writing sql queries and complex stored procedures using Microsoft sql server management studio"}
{"text": "Designed and developed Reports using Crystal Reports XI, responsible for Crystal Reports application code development and testing"}
{"text": "Created Crystal Reports using Crystal Reports formulae, Grouping, Parameters, Selection criteria"}
{"text": ""}
{"text": "Tech Stack: Java/J2EE, IntelliJ, JDK 6, Spring, JMS, MQ, JSP, Java Script, JQuery, Jboss, CSS, AJAX, JUNIT, WSDL, SQL Server, Jenkins, Git, Visual Studio 200x."}
{"text": ""}
{"text": ""}
{"text": "IGATE, Hyderabad, India                                                                                               March 2010 – June 2011"}
{"text": "AMS-AE, ACCESS (WEB-APP) | Web Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in Converting the Functional Design Document to Technical Design Document"}
{"text": "Developed WebObjects project which utilizes a GUI written in Java with Interface Builder"}
{"text": "Involved in the development of both the back end and the front end of the application"}
{"text": "Developing Front end pages using JSF, ADF, XML, CSS to generate dynamic content based on the service requester and their requirements."}
{"text": "Converted the HTML Pages to JSF Tag Specific Pages."}
{"text": "Developed Service layer using JDBC and injected the same into JSF managed bean."}
{"text": "Implemented the JSF framework by writing Faces-config.xml and Form-Beans in the process of development"}
{"text": "Developed faces-config.xmls and injected the Service beans into faces-config.xml"}
{"text": "Developed JSF Validators and Converters for calendar events monthly/weekly/daily date range validation, not null, length validations"}
{"text": "Developed JSF navigation rules for Event create/edit/update/delete/view actions"}
{"text": "Configured JDBC Connection Pools in WebLogic application server for Oracle database, configured web.xml for various filter classes, listener classes and context parameters"}
{"text": ""}
{"text": "Tech Stack: Java 1.5, JSF 2.0, Eclipse, Tomcat 5.5, Web Services, SOAP, Maven, WebLogic, Oracle, Agile, HTML, CSS, XML, Windows"}
{"text": ""}