{"text": "Name: marie marie"}
{"text": "E-Mail: marie.marie@gmail.com"}
{"text": "Address: Nangandao, China"}
{"text": "Github: https://github.com/marie"}
{"text": "LinkedIn: https://linkedin.com/marie"}
{"text": "Phone No. 26794767083"}
{"text": "\t\t\t\t\t\t\t\t\t\t\t\t    "}
{"text": ""}
{"text": ""}
{"text": "Professional Summary:"}
{"text": ""}
{"text": "A Certified Tableau Developer having 8+ years of experience in Software Design, Development, Integration, Implementation and Maintenance of Business Intelligence and Database Platforms."}
{"text": "Extensive Tableau Experience in Enterprise Environment and Tableau Administrator Experience including technical support, troubleshooting, report design and monitoring of system usage."}
{"text": "Successfully upgraded Tableau platforms in clustered environment and performed content upgrades."}
{"text": "Extensive experience working as a Business Intelligence Consultant with specialization in SSRS."}
{"text": "Extensive experience working in Windows, UNIX, LINUX environments. "}
{"text": "Experience in dealing with OLTP/OLAP Systems."}
{"text": "Excellent understanding of Data modeling (Dimensional & Relational) on concepts like Star-schema, Snowflake schema using fact and dimension tables and relational databases (Oracle), Mainframes, MS Access and client/server applications."}
{"text": "   Extensive experience in PL/SQL and SQL and in performance tuning SQL queries in TOAD. "}
{"text": "   Worked with ETL process to Extract, Transform and Load the data into stage area and data warehouse."}
{"text": "Worked extensively with the major functionality of SSRSad-hoc reports, Drill down reports, multi-parameterizedreports and drill through reports."}
{"text": "Professional in writing complex Formulas, Sub Reports, Summary Reports."}
{"text": "Involved in Trouble Shooting, Performance tuning of reports and resolving issues with in SSRS."}
{"text": "Installation, configuration and administration of SSRS."}
{"text": "Deployed the reports and Scheduled Reports for the use of end users and customers."}
{"text": "In-depth knowledge on Tableau Desktop, Tableau Reader and Tableau Server."}
{"text": "Mastered the ability to design and deploy rich Graphic visualizations with Drill Down menu option and Parameterized using Tableau."}
{"text": "End to end experience in designing and deploying data visualizations using Tableau"}
{"text": "Worked extensively with creating reports as per user requirements using MS Reporting Services 2005/2008R2"}
{"text": "Extensive working experience in Packages, Procedures, Cursors and Triggers."}
{"text": "Experienced in tuning long running SQL queries for better performance."}
{"text": "Expertise in using Version controllers like Clear Quest, Clear Case, SVN and PVCS."}
{"text": "Strong interpersonal skills with demonstrable verbal and written communications to maintain effective work relationships with all levels of personnel."}
{"text": "Integrating Jasyptwith tableau for hiding of the sensitive data."}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "Languages\t\t\t\t:\t HTML, PL/SQL, SQL, XML, Java/J2EE"}
{"text": "Applications\t\t\t\t:\tOracle SQL Developer                   "}
{"text": "Reporting tool\t:\tSQL server 2005/2008 R2 SSAS/SSRS/SSIS, Tableau Desktop, Tableau Server"}
{"text": "Databases\t\t\t\t:\tOracle 8i/9i/10g/11g, MS Access, MS SQL Server 2000/2005/2008R2"}
{"text": "RDBMS\t\t\t\t\t:\tMS Access, Teradata"}
{"text": "Operating Systems\t\t\t:\tWindows XP/7/8, MS-DOS, Sun Solaris, Linux "}
{"text": "Web/App Servers\t\t\t:\t Apache Tomcat, Web logic Server 8.1/9.2/10, MS IIS 5/6.0, JBoss"}
{"text": "Packages / Tools\t\t\t:\tMS Office, Toad, Putty, FrontPage 2000. "}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "Intel, Hillsboro, OR                                                                                                                                                                                                             Jun’15- Present"}
{"text": "Tableau Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Developed Tableau reports using SSAS Cubes "}
{"text": "Worked on creating advanced Tableau dashboard, using Intermediate MSBI Tabular models."}
{"text": "Created calculated members for dashboard development."}
{"text": "Written MDX queries to create new measure with rebuilding cubes."}
{"text": "Used MDX queries to create the filters and parameters according to the requirement."}
{"text": "Actively participated in moving tableau dashboard under tabular model in to impala."}
{"text": "Focused on creating dashboards in such away end user can understand by just looking at it in 10 sec."}
{"text": "Closed with Business Analyst for gathering requirements and educating in using tableau."}
{"text": "Closed worked with PM, others developers, architects, QAs for software design, estimation, development and testing."}
{"text": "Actively participated with Architect in decision and moving to Cloudera from Tabular models."}
{"text": "Worked on merging multiple tableau workbooks to create a single workbook."}
{"text": "Trained teammates With Tableau "}
{"text": "Environments: Tableau Desktop v8, v9, Tableau Server v9, SQLserver, MDX, Hadoop (Cloudera, Impala)."}
{"text": ""}
{"text": "ZYNX Health, Los Angeles, CA                                                                                                                                                                                                  Nov’14- May’15"}
{"text": "SQL/Tableau Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Involved in creating Tableau reports using complex custom SQL queries."}
{"text": "Involved in designing new projects and execute them with minimal human resources."}
{"text": "Created dashboards using multiple data sources."}
{"text": "Administered Tableau server and helped in tuning of server."}
{"text": "Involved in gathering information from clients."}
{"text": "Worked with MySQL and optimization of SQL Queries."}
{"text": "Created semantic/metadata layer in Tableau"}
{"text": "Created executive dashboard with KPI visualization (1-2 dashboards, 4-8 KPIs)"}
{"text": "Created underlying drill through detailed reports"}
{"text": "Created Wide variety of dashboards."}
{"text": "Involved in creation of aggregated tables using OLAP data source (DW)"}
{"text": "Worked with customers, internal and external, to define and document the scope and functional requirements for data and reporting needs."}
{"text": "Involved in backup of tableau server and optimization of server performance."}
{"text": "Closely worked with manager for designing the requirements."}
{"text": "Integrated Jasypt encrypted data into tableau and integrated special passwords for viewer to look the sensitive data."}
{"text": "Worked in integrating the tableau into mobile applications."}
{"text": ""}
{"text": "Environments: Tableau Desktop v8, Tableau Server v8, MySQL, Jasypt, Sql server, Careinsync, Java, Excel, CSV files."}
{"text": ""}
{"text": "Pfizer, San Diego, CA\t\t\t\t\t\t\t\t\t\t\t\t\tSep’14- Nov’14"}
{"text": "SQL/Tableau Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Involved in requirements gathering and technical discussion of the reporting data model. "}
{"text": "Worked on different Adhoc scenarios to come up with various functional specs / Demo’s for User acceptance."}
{"text": "Created dashboard using parameters, sets, groups and calculations."}
{"text": "Involved in creating interactive dashboard and applied actions (filter, highlight and URL) to dashboard."}
{"text": "Working on generating various dashboards in Tableau Server using different data sources such as Teradata, Oracle and Redshift& Google big query."}
{"text": "Ability to authoring on Tableau server by changing mark types and adding filters directly in a web browser."}
{"text": "Involved in importing data from Aster ODBC connections for applications. "}
{"text": "Involved in Analyzing Aster SQL MR Functions in Aster data."}
{"text": "Involved in using Amazon Redshift & Google Analytics for creating data extracts for workbooks & Dashboards."}
{"text": "Created custom API’s to interact with java framework in order to display the dashboards."}
{"text": "Created dynamic parameters on the dashboard, which user has an option to display various views and selection of different columns & rows as per the need."}
{"text": "Involved in UAT & Stress test of the workbooks and also data integrity."}
{"text": ""}
{"text": ""}
{"text": "Environments: Tableau Desktop v8, Server, Reader, Oracle, Teradata, Redshift, GoogleAnalytics, Excel, JAVA, J2EE."}
{"text": ""}
{"text": "Bityota, Mountain View, CA\t\t\t\t\t\t\t\t\t\t\t\tJuly’14- Aug’14"}
{"text": "SQL/Tableau Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Involved in creating dashboards by extracting data from different sources."}
{"text": "Created dashboard using parameters, sets, groups and calculations."}
{"text": "Involved in creating interactive dashboard and applied actions (filter, highlight and URL) to dashboard."}
{"text": "Involved in creating calculated fields, mapping and hierarchies."}
{"text": "Created drill through reports in dashboard."}
{"text": "Involved in creating data blending in case of merging different sources."}
{"text": "Involved in creating a dual-axis bar chart with multiple measures."}
{"text": "Involved in extraction, transformation and loading of data directly from different source systems like flat files, Excel, Oracle and SQL Server."}
{"text": "Extensively used data blending in Tableau."}
{"text": "Performed Tableau type conversion functions when connected to relational data sources."}
{"text": "Created incremental refreshes for data sources on Tableau server. "}
{"text": "Ability to authoring on Tableau online by changing mark types and adding filters directly in a web browser."}
{"text": "Administered user, user groups, and scheduled instances for reports in Tableau. "}
{"text": "Hands-on development assisting users in creating and modifying worksheets and data visualization dashboards."}
{"text": "Created report schedules, data connections, projects, groups in Tableau online."}
{"text": "Extensively used Tabadmin and Tabcmd commands in creating backups and restoring backups of Tableau repository."}
{"text": "Involved in creating reports as per user requirements using MS Reporting Services 2005/2008R2."}
{"text": "Involved in creating complex Stored Procedures, triggers, cursors, tables, and views and other SQL joins and statements for applications. "}
{"text": "Involved in creation and updates of several SQL Index, Views, Complex Stored Procedures, triggers and appropriate User defined functions."}
{"text": "Used ETL process to Extract, Transform and Load the data into stage area and data warehouse. "}
{"text": "Documented complete server architecture and solutions to troubleshoot performance, scheduling, and online related issues."}
{"text": ""}
{"text": "Environments: Tableau online, Tableau Desktop v7/v8, Windows Server Standard  R2, Clear quest, Clear case, Excel, JAVA, J2EE, SQL Server management studio, MS SQL Server 2008R2,  UNIX , Linux RHEL 5.4."}
{"text": ""}
{"text": "Merck, Boston, MA\t\t\t\t\t\t\t\t\t\t\t\t\t\tJun’12- Jun’14"}
{"text": "SQL/Tableau Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Involved in creating dashboards by extracting data from different sources."}
{"text": "Created dashboard using parameters, sets, groups andcalculations."}
{"text": "Involved in creating interactive dashboard and applied actions (filter, highlight and URL) to dashboard."}
{"text": "Involved in creating calculated fields, mapping and hierarchies."}
{"text": "Created drill through reports in dashboard."}
{"text": "Involved in creating data blending in case of merging different sources."}
{"text": "Involved in creating a dual-axis bar chart with multiple measures."}
{"text": "Involved in extraction, transformation and loading of data directly from different source systems like flat files, Excel, Oracle and SQL Server."}
{"text": "Working on generating various dashboards in Tableau Server using different data sources such asTeradata, Oracle, Microsoft SQL Server and Microsoft Analysis Services."}
{"text": "Extensively used data blending in Tableau."}
{"text": "Performed Tableau type conversion functions when connected to relational data sources."}
{"text": "Maintained and Installed Tableau Server in all the environments. "}
{"text": "Created incremental refreshes for data sources on Tableau server. "}
{"text": "MonitoredVizQL server, Application Server and data server activity to track performance and system stability. "}
{"text": "Ability to authoring on Tableau server by changing mark types and adding filters directly in a web browser."}
{"text": "Administered user, user groups, and scheduled instances for reports in Tableau. "}
{"text": "Hands-on development assisting users in creating and modifying worksheets and data visualization dashboards."}
{"text": "Created report schedules, data connections, projects, groups in Tableau server."}
{"text": "Extensively used Tabadmin and Tabcmdcommands in creating backups and restoring backups of Tableau repository."}
{"text": "Involved in creating reports as per user requirements using MS Reporting Services 2005/2008R2."}
{"text": "Involved in creating complex Stored Procedures, triggers, cursors, tables, and views and other SQL joins and statements for applications. "}
{"text": "Involved in creation and updates of several SQL Index, Views, Complex Stored Procedures, triggers and appropriate User defined functions."}
{"text": "Used ETL process to Extract, Transform and Load the data into stage area and data warehouse. "}
{"text": "Documented complete server architecture and solutions to troubleshoot performance, scheduling, and server related issues."}
{"text": ""}
{"text": "Environments: Tableau Server v7/v8, Tableau Desktop v7/v8, Windows Server Standard  R2, Clear quest, Clear case,Excel, JAVA, J2EE, SQL Server management studio,MS SQL Server 2008R2,  UNIX , Linux RHEL 5.4."}
{"text": ""}
{"text": "Cerner, Kansas City, MO\t\t\t\t\t\t\t\t\t\t\t\t\t\tNov 11- Jun’12"}
{"text": "SQL/Tableau Developer/ Analyst"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in creating dashboards and reports in Tableau 6.1. "}
{"text": "Created interactive dashboard and applied actions (filter, highlight and URL) to dashboard."}
{"text": "Created dashboard using parameters, sets, groups and calculations."}
{"text": "Created drill down and drill upin worksheets."}
{"text": "Involved in creating a dual-axis bar chart with multiple measures."}
{"text": "Created report schedules on Tableau server."}
{"text": "Created incremental refreshes for data sources on Tableau server. "}
{"text": "Administered user, user groups, and scheduled instances for reports in Tableau server and documented upgrade plan from Tableau 6.0 to Tableau 6.1 "}
{"text": "Created and assisted users in Tableau dashboard development."}
{"text": "Documented complete server architecture and solutions to troubleshoot performance, scheduling, and server related issues. "}
{"text": "Defined and created procedures to install Tableau desktop in silent mode."}
{"text": "Defined best practices for Tableau report development. "}
{"text": "Extensively used Tabadmin and Tabcmd commands in creating backups and restoring backups of Tableau repository."}
{"text": "Involved in creating reports as per user requirements using MS Reporting Services 2005/2008R2."}
{"text": "Involved in writing complex SQL queries using table joins (inner and outer)."}
{"text": ""}
{"text": "Environments: Tableau Server 6.1, Tableau Desktop 6.1, MYSQL Server, MS SQL Server 2005, MS SQL Server 2008, Oracle 11i, Netezza, Sybase,  Crystal XI, Info view, CMS, CMC, Excel, JAVA, J2EE, Tomcat., TSQL, UNIX , Linux RHEL 5.4."}
{"text": ""}
{"text": "AmeriGroup, Virginia Beach, VA                                                                                                            \t\t\t\t\t                                        July 10 - Oct 11   "}
{"text": "Oracle Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Collaborated with the Business analysts and the DBA for requirements gathering, business analysis, testing and project coordination"}
{"text": "Created process force and deployed into run time depository using ware house builder"}
{"text": "Involved in logical modeling and physical modeling of application."}
{"text": "Used multiple operators (union, router) for loading data using owb."}
{"text": "Having strong knowledge in creating and maintaining the owb"}
{"text": "Developed Stored Procedures, Functions, Packages and SQL Scripts using PL/SQL."}
{"text": "Involved in developing CRONTAB to schedule the information of cronentries."}
{"text": "Involved in creation of Conceptual Modeling covering all the business requirements."}
{"text": "Loaded the data into database tables using SQL*loader from text and excel files."}
{"text": "Developed data model, SQL Queries, SQL Query tuning process and Schemas."}
{"text": "Worked with bulk collect to Implement the performance of multi row queries"}
{"text": "Developed SQL scripts for Referential Integrity check, which checks validity of incoming data with master tables in database."}
{"text": "Developed SQL scripts, packages and procedures for Business rules check to implement business rules."}
{"text": "Developed SQL and PL/SQL scripts to transfer tables across the schemas and databases."}
{"text": "Data loaded from legacy systems using PL/SQL and SQL*Loader."}
{"text": "Remediate Oracle application Custom object components like Forms, report and Concurrent Program (PLSQL code)."}
{"text": "Involved in development of Oracle Forms/Reports, New Screen designs, Modifications."}
{"text": "Upgraded to Forms 10g, Reports 10g maintained and troubleshoot Oracle Forms and Reports."}
{"text": "Developed custom Forms and Reports as per client requirements and making them web enabled using Oracle Reports builder 10g and Oracle Forms builder 10g respectively."}
{"text": "Worked on admin and user editions of discoverer 10g and used AIM (application implementation methodology) in documenting the development tasks."}
{"text": "Developed Master Detail, Detail reports using tabular and Group above reports."}
{"text": "Developed Procedures for efficient error handling process by capturing errors into user managed tables."}
{"text": "Developed Shell scripts to automate execution of SQL scripts to check incoming data with master tables, insert the valid data into Customer Management System and invalid data into error tables, which will be sent back to sender notifying the errors."}
{"text": "Generated various analytical reports using Microsoft Access. "}
{"text": "Worked with java developers to repair and enhance current base of PL/SQL packages to fix production issues and build new functionality and improve processing time through code optimizations and indexes."}
{"text": "Performed SQL and PL/SQL tuning and Application tuning using various tools like TKPROF, AUTOTRACE and DBMS_SQLTUNE."}
{"text": "Developed UNIX Shell scripts to automate table creation, execute procedures."}
{"text": "Used Toad for creating PL/SQL (trigger, sequence, stored procedure)."}
{"text": "Used UTI_FILE PACKAGES for writing DBMS_OUTPUT messages to file."}
{"text": ""}
{"text": "Environments: Oracle 10g/9i, SQL, PL/SQL, SQL*Loader, MS Access, UNIX Shell script, TOAD, Oracle Forms 10g,Reports10g, UNIX, Windows XP/2000.owb 10g."}
{"text": "\t\t\t\t\t\t\t\t\t\t"}
{"text": "GATI Transport - Hyderabad, India                                                               \t\t\t\t\t\t\t\t\t\t Feb 07 - July 10"}
{"text": "Oracle Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Created SQL scripts and written Procedures using PL/SQL to load data from flat files into new tables (using both UTL and SQL Loader – for different cases)"}
{"text": "Explain Plan, TKPROF was used for checking the performance of queries"}
{"text": "Modified and updated existing custom forms to adapt to new database schema"}
{"text": "Created SQL scripts for conversion of legacy data (including validations) and then load it into the tables"}
{"text": "Developed SQL*Loader programs &PL/SQL scripts to load legacy data into Oracle Apps."}
{"text": "Developed reports using Reports 6i."}
{"text": "Developed PL/SQL programs for various modules to validate data while importing into oracle system."}
{"text": "Participated in database development like creating PL/SQL triggers, packages, procedures function."}
{"text": "Performed exception handling for data that did not conform to the required format."}
{"text": "Responsible for making the merged data in turn available to other clients."}
{"text": "Wrote UNIX scripts to automate loading files into database using error handling and notification."}
{"text": "Involved in implementing the data integrity validation checks through constraints and triggers."}
{"text": "Involved in developing packages for implementing business logic through procedures and functions."}
{"text": ""}
{"text": "Environment: ORACLE 7.x, Reports 6i, PL/SQL, SQL Loader, SQL."}
{"text": "\t"}