{"text": "Name: ruth ruth"}
{"text": "E-Mail: ruth.ruth@gmail.com"}
{"text": "Address: Cairo, Egypt"}
{"text": "Github: https://github.com/ruth"}
{"text": "LinkedIn: https://linkedin.com/ruth"}
{"text": "Phone No. 99673873016"}
{"text": ""}
{"text": ""}
{"text": "SUMMARY"}
{"text": ""}
{"text": "An organized, creative Tableau developerand Tableau Admin with a wide spectrum of experience in variousdomains for nearly6 years."}
{"text": "Experienced in tableau development lifecycle like requirement gathering, design development and delivery."}
{"text": "Proficient in creating data visualizations, complex dashboards using multiple worksheets and reports."}
{"text": "Excellent knowledge of all the phases of Software Development Life Cycle (SDLC)."}
{"text": "Insightful in devising customized interactive dashboards in Tableau using Actions, Calculated fields, Hierarchies, Sets, Groups, Filters, Parameters in Tableau."}
{"text": "Experienced in joins, data blending and dual axis in tableau."}
{"text": "Skilled in developing and designing reports applying Drill Down, Drill Thru, drop down Menu option, Parameterized and Linked reports using Tableau. "}
{"text": "Good Knowledge on Tableau server and Publisher."}
{"text": "Good Knowledge of Power BI."}
{"text": "Worked on Scheduling reports on tableau server."}
{"text": "Experienced in using AtScale."}
{"text": "Experience in developing Folders, Groups, Users, Subscriptions, Scheduling and skilled in visualization in Tableau."}
{"text": "Worked on Business objects."}
{"text": "Competent in design, development, and implementation of various business intelligent applications including business analysis, dimensional modelling, repository management."}
{"text": "Experienced in designing dashboards in line with the analytical uniformity using the Advanced Analysis of Tableau Desktop, and organizing Dashboard objects and views."}
{"text": "Experience in data usage and providing access to users using Row level security and User filters."}
{"text": "Good exposure in Tableau Desktop for data visualization, Reporting and Analysis; Cross tab, Scatter Plots, Geographic Map, Pie Charts and Bar Charts, Page Trails and Density Chart."}
{"text": "Extensive knowledge in using Tableau functionalities for creating different Requests, Filters, Charts, Interactive dashboards with prompt pages and dashboards."}
{"text": "Published Dashboards onto Tableau Server based on consumers viewing medium (laptop, pc, IPad)"}
{"text": "Worked on clear dashboards to communicate the information stored in storyboards."}
{"text": "Efficient use of Table Functions, Indexes, Table Partitioning, Collections, Analytical functions, Materialized Views, Query Re-Write and Transportable table spaces."}
{"text": "Experienced inData Interoperability, Analytics and BI and Production Support issue resolution."}
{"text": "Possess good knowledge in gathering Business Requirements, Mapping Documentation, Analysis, Design, Development, Testing, Implementations and Documentation of various functionalities of Data Warehouse / Data Marts and Business Intelligence."}
{"text": "Experienced in creation and deployment of multi-dimensional reports using the Cognos Business Intelligence solution. "}
{"text": "Extensive Knowledge in RDBMS concepts experienced in creating Tables, User Defined Data Types, Indexes, Indexed Views, Functions, and Stored Procedures."}
{"text": "Having strong Experience in writing SQL queries, TSQL and Exception Handling, understanding requirements and developing plans.  "}
{"text": "Good understanding of Data modeling concepts like ER Diagrams, UML, Use Cases, Normalization and De-normalization techniques for both OLTP and OLAP systems in creating Database Objects like tables, Constraints and Indexes."}
{"text": "Extensively worked on Partitioning and indexing concepts(Local and Global) indexes on partition tables."}
{"text": "Prepared test plans and test strategies, executed and reviewed the test cases. Strong knowledge of OLAP, data warehouse design. "}
{"text": "Strong in T-SQL writing stored procedures, user defined functions, views, joins, indexing, query writing, triggers and functions. "}
{"text": "Proficient in documentation skills, created documents like design document, data flow diagram, implementation/release notes and operations support document/run books."}
{"text": "Expertise in designing techniques like Snowflake schemas, Star schema, fact and dimension"}
{"text": "Excellent communication, teamwork, inter-personnel and presentation skills, fast and self-organized learner."}
{"text": ""}
{"text": "TECHNICAL EXPERTISE"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE"}
{"text": ""}
{"text": "MicroFocus, Salt Lake City, UTAH  \t\t\t\t\t\t              March 17- Till Date"}
{"text": "Tableau Consultant with Admin Responsiblity"}
{"text": ""}
{"text": "Description: Micro Focus and HPE Software have joined to become one of the largest pure-play software companies in the world. Bringing together two leaders in the software industry, Micro Focus is uniquely positioned to help customers maximize existing software investments and embrace innovation in a world of hybrid IT—from mainframe to mobile to cloud."}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Experience with creation of users, groups, projects, workbooks and the appropriate permission sets for Tableau server logons and security checks. "}
{"text": "Developed actions, parameters, Filter (Local, Global) and calculated sets for preparing dashboards and worksheets using Tableau. "}
{"text": "Upgraded the Tableau environment from 9.3 -> 10.3"}
{"text": "Involved in installation of Tableau desktop 10.0, Tableau server Application software. "}
{"text": "Installed Tableau in Clustered Environment"}
{"text": "Extensively used Tabadmin and Tabcmd commands in creating backups and restoring backups of Tableau repository. "}
{"text": "Prepared proof of concept for best practices in Tableau deployment. "}
{"text": "Extensive experience in Tableau Administration Tool for Configuration, adding users, managing licenses and data connections, scheduling tasks, embedding views. "}
{"text": "Analyzed requirements for various reports, dashboards, scorecards and created proof of concept / prototype the same using Tableau desktop. "}
{"text": "Used Data Blending, groups, combine fields, calculated fields, and aggregated fields and spotlighting to compare and analyze data in different perspectives. "}
{"text": "Drew upon full range of Tableau platform technologies to design and implement proof of concept solutions and create advanced BI visualizations "}
{"text": "Involved in publishing of various kinds of live, interactive data visualizations, dashboards, reports and workbooks from Tableau Desktop to Tableau servers. "}
{"text": "Used Power BI to create data visualization."}
{"text": "Using Tableau Desktop created Interactive-reporting dashboards by combining multiple views. "}
{"text": "Review Vendors Status Reports with Project Team and created visualization for budget forecasting. "}
{"text": "Worked on Performance tuning of report with huge queries using concurrent query execution for better performance of report. "}
{"text": "Developing predictive statistical models using statistical analysis and other predictive modeling techniques."}
{"text": "Extensively used advance chart visualizations in Tableau like Dual Axis, Box Plots, Bullet Graphs, Tree maps, Bubble Charts, Water Fall charts, funnel charts etc., to assist business users in solving complex problems. "}
{"text": "Analyzing the data of patterns, trends and fashions of various KPIs, Measures using various graphs, charts, and pivot tables."}
{"text": "Worked across departments to identify and understand key business questions, and standardize key metrics and measure."}
{"text": "Created multiple visualizations like Heat Maps, Bar Graphs and Bullet Graphs. "}
{"text": "Preparing Dashboards using calculations, parameters in Tableau."}
{"text": "Worked on Scrum/Agile methodologies"}
{"text": "Created database Triggers to validate complex integrity. "}
{"text": "PL/SQL Procedures, Functions, Cursors, Triggers and Packages were created using TOAD"}
{"text": "Written multiple complex queries using SQL. "}
{"text": ""}
{"text": "Environment: Tableau 10.3/9.3 Server and Desktop, JAVA API, MS SQL 2016/2012, Oracle, OBIEE, Teradata, Windows Server. "}
{"text": ""}
{"text": "ETS | Princeton NJFeb 2016 – Feb 2017"}
{"text": "Role: Tableau BI Developer"}
{"text": "Description: ETS is a team of education experts, researchers and assessment developers who believe that, through learning, people can improve their situations in life and make incredible contributions to the world. We also believe that by designing our assessments with industry-leading insight, rigorous research and an uncompromising commitment to quality, we can advance equity and help education and workplace communities make informed decisions about people and programs."}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Utilized Tableau BI Dashboard reporting solution for different groups in the organization. "}
{"text": "Collaborated with business analysts, interpreted business requirements that users looked to dashboards to answer, and created server based Tableau dashboards with automatic updates."}
{"text": "Defined best practices for Tableau report development."}
{"text": "Designedextensive joins for data blending from several different data sources"}
{"text": "Extensively worked with Advance AnalysisActions, Calculations, Parameters, Background images, Maps"}
{"text": "Published Dashboards onto Tableau Server and from there consumers would choose viewing medium (laptop, pc, iPad)."}
{"text": "Hands-on experience in creating interactive dashboard and applied actions (filter, highlight and URL) to dashboard."}
{"text": "Designed, organized, customized analysis and visualized projects and dashboards to present to Senior Level Executives."}
{"text": "Introduced several Levels of Dashboard Drill Down and Links to interrelated performance metrics"}
{"text": "Used data blending on databases and developed interactive dashboards."}
{"text": "Administeredand provided production support for Enterprise wide Tableau application consisting of multiple key functional business domains."}
{"text": "Created Report templates, bar graphs and pie charts based on the financial data using Tableau. "}
{"text": "Tested Dashboard for data accuracy and Functionality."}
{"text": "Utilized Tableau visualizations into Interactive Dashboards using filter actions, highlight actions etc., and published them to the web. "}
{"text": "Recorded complete server architecture and solutions to troubleshoot performance, scheduling, and server related issues."}
{"text": "Designed complex formulas and calculations within Tableau to meet the needs of complex business logic."}
{"text": "Implemented advanced features of tableau such as calculated fields, parameters, and sets to support data analysis and data mining."}
{"text": "Migrated Reports & Universes from Development to Testing and to Production Environment using Import Wizard."}
{"text": ""}
{"text": "Environment: Tableau Desktop 8 & 9, Tableau server 9.2 / Administration, SQL Server, Oracle, Microsoft Excel 2007, MS Access, Windows 2007 server."}
{"text": ""}
{"text": "LeggMason |Stamford, CTJan 2015 – Jan 2016"}
{"text": "Role: Tableau Developer"}
{"text": ""}
{"text": "Description: Legg Mason, Inc. (NYSE: LM) is an American investment management firm with a focus on asset management and serves customers worldwide. Legg Mason offers products in equities and fixed income, as well as domestic and international liquidity management and alternative investments (via a funds-of-hedge-funds manager)."}
{"text": ""}
{"text": "Responsibilities-"}
{"text": "Installation, maintenance and administration of Tableau Servers."}
{"text": "Hands on experience in tableau created Rapid Analytics and Reporting."}
{"text": "Expertise in Tableau Analysis"}
{"text": "Designed Workbooks by creating user filters so that only appropriate teams can have access to the workbooks"}
{"text": "Experience with Tableau for Data Acquisition and data visualizations for client and customers."}
{"text": "Skilledat creating Worksheets, Dashboarding and infographics"}
{"text": "Expertise in BI interactive Dashboards and Tableau Publisher."}
{"text": "Utilizing Multiple Measures like Individual Axes, Blended Axes, and Dual Axes."}
{"text": "Good knowledge in developing Dashboard using OLAP cubes."}
{"text": "Designed, customized and share interactive web dashboards in minutes with simple drag & drop method and accessed dashboards from any tablet or browser."}
{"text": "Created multiple reports for management with help of Cognos Report Studio."}
{"text": "Deployed, Tested and Scheduled SSIS Packages."}
{"text": "Generated symbol maps to understand the geo-spatial distribution with custom symbols made to represent the application category in the project."}
{"text": "Developed code for various Cognos reporting objects and ensure compliance to all best business practices."}
{"text": "Designed histograms, pie charts, box plots, scatter plots for inventory management, background maps illustrating the potential revenue change all along."}
{"text": "Developed various kinds of reports (pivots, charts, tabular) using global and local Filters."}
{"text": "Involved inTest Evaluation, Summary Reports."}
{"text": "Live, optimized connections to Teradata to leverage the investments."}
{"text": "Experience of Client-Interaction on onsite/Offshore."}
{"text": "Expertise in connecting to Oracle and SQL databases and troubleshooting."}
{"text": ""}
{"text": "Environment: Tableau Desktop 8.2/8.1, Tableau server / Administrator, UNIX, COGNOS reporting."}
{"text": ""}
{"text": "Techx| Pune, INDIA                             Jan 2014 – Dec  2014"}
{"text": "Role: Tableau  BI Developer"}
{"text": "Description: Tech-X’s mission is to provide customers with the best computational software and engineering services to enable their breakthroughs."}
{"text": ""}
{"text": "Responsibilities-"}
{"text": "Involved with Business Analyst, data Modelers in understanding the Analytics report requirements"}
{"text": "Designing dashboards using calculated fields, parameters, calculations, groups, sets and hierarchies in Tableau."}
{"text": " Assembled reports requirement; collaborated with the business users using wireframe mockups for the same."}
{"text": "Worked extensivelywith infographics and Dashboarding for data visualization."}
{"text": "Create, Organize, manage and maintain graphs, tables and document templates for the efficient creation of reports."}
{"text": "Installed, modified and maintained COGNOS Application systems and provided overall technical guidance for the usage of COGNOS tools."}
{"text": "Involved professionally with diverse group of professionals in the organization including managers and executives."}
{"text": "Extensively used data blending, embed functionalities in Tableau."}
{"text": "Deployed Tableau Server in clustered environment by mapping server nodes to primary machine. "}
{"text": "Expert in standardizing Tableau for shared service deployment."}
{"text": "Involved in license management SLA’s with Tableau support. "}
{"text": "Administered user, user groups, and scheduled instances for reports in Tableau. "}
{"text": "Experienced in development assisting users in creating and modifying worksheets and data visualization dashboards."}
{"text": "Performed troubleshoot on all Cognos helpdesk tickets and resolved all queries and prepared standard reports for all the content."}
{"text": "Illustrated best practices for Tableau report development. "}
{"text": "Provided 24/7 production support for Tableau users. "}
{"text": "Effectively used Tabadmin and Tabcmd commands in creating backups and restoring backups of Tableau repository."}
{"text": "Extensively worked on Customizing Physical Data Layer, Business model and mapping layer and Presentation Layer in Administration Tool."}
{"text": "Recorded complete server architecture and solutions to troubleshoot performance, scheduling, and server related issues."}
{"text": "Configured the scheduler which runs the Ibots and delivers the content"}
{"text": "Skilled in providing Tableau server and tableau desktop training."}
{"text": "Developed Business Facts & Dimensions and defined Logical relation between them in BMM layer."}
{"text": "Designed Reports using different Analytics Views (Pivot Table, Chart, Column Selector, Table) like Drill Down, Pivot Reports using Column Filters and Prompts to filter the request in Answers."}
{"text": "Configured the Intelligent Dashboards for different user groups to view data across regions with the facility of drill downs and Charts.  "}
{"text": ""}
{"text": ""}
{"text": "Environment:Tableau Server v6/v7, Tableau Desktop v6/v7, Oracle Business Intelligence 11.1.1.7, SQL"}
{"text": "Developer, Quality Center, Windows XP Professional."}
{"text": ""}
{"text": "SoftSol| Hyderabad, India   Jan 2013 – Oct 2013"}
{"text": "Role:SQL/ BI Developer"}
{"text": "Description:SoftSol is a world class IT services provider that empowers its customers towards greater efficiency, innovation, compliance, and cost savings.  Headquartered in California’s Silicon Valley, SoftSol has been a driver in the evolution of IT through web and SOA to collaboration, cloud, and mobility. Combining fundamental business strategies with bold moves in technology innovation, SoftSol has been assisting organizations such as the Department of Defense, Genentech, CalPERs, Cisco, the Superior Court of California, and HBO towards leadership in their respective industries."}
{"text": ""}
{"text": ""}
{"text": "Responsibilities-"}
{"text": "Involved in requirement gathering and design documents for developing the project. "}
{"text": "Created Stored Procedures, and other SQL queries for application using T-SQL "}
{"text": "Performed tuning and optimization of queries for reports that take longer execution time using SQL Profiler, index tuning wizard and SQL Query Analyzer. "}
{"text": "Created User Defined functions and used it for creation of stored procedures. "}
{"text": "Wrote T-SQL stored procedures to transfer data from OLTP databases to staging area and finally transfer into data warehouse."}
{"text": "Imported and Exported data from one table space to another and loaded data from flat files to the staging area using SQL Loader in UNIX environment."}
{"text": "Build and monitored the indexes at regular intervals for better performance."}
{"text": "Developed reports using BI and tuned them for optimal performance when using multiple Parameters. "}
{"text": "Created OLAP cubes on top of data warehouse based on facts and dimension tables for analysis purposes using SSAS."}
{"text": "Responsible for all reports creation, deployment and bug fixing. "}
{"text": "Fixed defects and failures using methods such as modifying code, fixing incorrect joins and replacing sub selects with joins."}
{"text": "Wrote parameterized queries for generating tabular reports using expressions, functions, defining data sources. "}
{"text": "Generated reports using SSAS that were used to send information to different vendors, Clients and mangers."}
{"text": "Deployed reports to report server, added subscription and snapshot for end users. "}
{"text": "Scheduled reports using SSRS to generate daily, weekly, monthly and quarterly reports."}
{"text": "Involved in using Team Foundation Server (TFS) to check in and check out SSRS reports and SSIS packages."}
{"text": "Performed effective Unit Testing and offered support during the production releases."}
{"text": ""}
{"text": "Environment:SQL Server, SQL Server Reporting Services (SSRS), SQL Server Analysis Services (SSAS), SQL Server Data Tools, SQL Profiler, Windows 7, Team Foundation Server"}
{"text": ""}
{"text": "RMSI | Hyderabad, India Jan 2012 – Dec 2012"}
{"text": "Role: SQL Developer"}
{"text": "Description: RMSI focuses  solely on accurate, impactful retail execution. Our combination of a unique strategic approach, advanced technology, and an uncompromising commitment to service ensures your brands are in the right place, at the right time."}
{"text": ""}
{"text": "Responsibilities="}
{"text": "Created and managed database objects like tables, views, indexes, trigger and stored procedures. "}
{"text": "Tracked queries taking more time using SQL profiler and fixed them accordingly."}
{"text": "Created various forms of reports such as tabular, matrix, charts, drill down and parameterized reports and deployed them to report server. "}
{"text": "Involved in creating SSIS packages, building, deploying and executing the packages in both the environments (Development and Production). "}
{"text": "Used SSIS package to load data from different platforms such as CSV, XML, Flat file and excel."}
{"text": "Created deployment utility to deploy SSIS packages over Production, Prod support and QA environments. "}
{"text": "Used Event Handlers for Custom Logging using Store Procedures for various events (On Warning, On Pre-and Post-Execution, On Task Failed etc.) "}
{"text": "Schedule and maintain SSIS packages daily, weekly and monthly using SQL server Agent. "}
{"text": "Generated Reports using Global Variables, Expressions and Functions for the reports. "}
{"text": "Generating SSRS reports using drill down, drill through and using other functionalities "}
{"text": "Designed and implemented parametrized and cascading parametrized reports using SSRS."}
{"text": ""}
{"text": "Environment:SQL Server 2008, SQL Server Integration Services (SSIS), Windows Server 2008 R2, SQL Server Agent."}
{"text": ""}
{"text": "  Education"}
{"text": "Bachelors of Engineeringfrom Nagpur University – India, 2012."}