{"text": "Name: annie annie"}
{"text": "E-Mail: annie.annie@gmail.com"}
{"text": "Address: Beijing, China"}
{"text": "Github: https://github.com/annie"}
{"text": "LinkedIn: https://linkedin.com/annie"}
{"text": "Phone No. 48294195431"}
{"text": "____________________________________________________________________________"}
{"text": "PROFESSIONAL SUMMARY"}
{"text": "6 years of software development experience with creating and implementing n-tier applications using object oriented methodology."}
{"text": "Extensive experience in development, maintenance, enhancement and testing of Web based Applications using Microsoft.NET Technologies (3.5/4.0/4.5), SQL Server Database 2005/2008/2010, ASP.NET, C#, ADO.NET, AJAX, WCF, Web Services, HTML, Xml, JavaScript, JQuery, CSS,MVC, LINQ."}
{"text": "Strong working Knowledge of Object Oriented Designing and Programming."}
{"text": "Expertise in working with Web Server Controls, HTML Controls, User & Custom Controls using C#."}
{"text": "Worked extensively with Data Adapter, Dataset, and Data Reader as a part of ADO.NET to perform data operations to implement the data layer to communicate with different databases."}
{"text": "Experienced in creating and running unit test cases against managed code using Nunit and VSTS."}
{"text": "Expertise in all phases of Software Development Life Cycle (SDLC) including requirements, analysis, design, implementation, integration and testing, deployment and maintenance"}
{"text": "Experience in web development using HTML, XHTML, DHTML, XML, XSD, X-Path and XSLT."}
{"text": "Extensive knowledge about Team foundation server (TFS). Expertise in Database Programming and Development using MS SQL Server 2005/2008/2012 and good experience in SQL, T-SQL, Triggers, Views, User Defined Functions and Stored Procedures."}
{"text": "Mobile device development through integrating devices to embedded processors."}
{"text": "Performs well under a wide variety of environments and circumstances."}
{"text": "Excellent communications skills, creative problem solver, proactive listener."}
{"text": "Ability to work in-groups as well as independently with minimal supervision."}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ".NET Developer"}
{"text": "Client: ECI, Plano, TX\t\t\t\t\t\t\t\tFeb 2016 – Till Date"}
{"text": ""}
{"text": "Compliance Re-Write Reports: ECI is a SAAS company that dedicates to simplifying and helping clients to leverage the HR functions as a key business driver. Its software facilitates the process of people management from Pre-Hire to retire.\n\nResponsibilities:"}
{"text": "Translated functional requirements and developed designs of applications, components, and modules in partnership with team members."}
{"text": "Designed and developed UI, business-layer, and back-end components in coordination with team members."}
{"text": "Refactored, developed and evaluated programs."}
{"text": "Used Visual Studio 2013 and TFS to develop and create new projects."}
{"text": "Used MVVM pattern along with Razor to build project.\n"}
{"text": "Environment:\nMVC 4, SQL, HTML5, CSS3, JSON, JAVASCRIPT, BOOTSTRAP, C#, WebForm, TFS, VISUAL STUDIO 2013, MVVM, JQUERY, ASP.NET"}
{"text": ""}
{"text": ".NET Developer"}
{"text": "Client: Level3 Communication, Broomfield, CO\t\t\t\tNov 2013 – Jan 2016"}
{"text": ""}
{"text": "Compliance Re-Write Reports: Level3 Communication is a company that provides local, national and global communications services to enterprise, government and carrier customers. It is a premier global provider of telecommunication services, delivering data, voice, video, and managed solutions leveraging a reliable, secure network."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Designed, developed, modified, debugged and evaluated programs for functional areas. "}
{"text": "Analyzed existing programs or implemented business logic for new systems, devises logic procedures, performed coding and tested/debugged programs as well as assisted in production deployments."}
{"text": "Have created and used WebForm."}
{"text": "Documented solution design and implementation: "}
{"text": "Documented the program development process, logic, coding of new and/or modification of current program building and executing automated tests within continuous integration framework. "}
{"text": "Analyzed and fixed data inconsistencies, business logic misinterpretations or code bugs in production environments."}
{"text": "Used C# to write most of the code."}
{"text": "Used Visual Studio 2010 and TFS(Team Foundation Server 2010) to develop new and modify existion program."}
{"text": "Developed Front-End and User-Interface Screen using( Telerik,  HTML5, CSS3, Json, JavaScript)"}
{"text": "Used Splunk to generate logs."}
{"text": "Worked on .Net Framework 4, SQL Server 2010 and MVC 4"}
{"text": "Source system that was used is Rally. "}
{"text": "Digital DashBoard was often used to show Users glance of overall status and performance."}
{"text": ""}
{"text": "Environment:"}
{"text": "MVC 4, SQL, HTML5, CSS3, JSON, JAVASCRIPT, SPLUNK, C#, WebForm, TFS, VISUAL STUDIO 2010"}
{"text": ""}
{"text": ".NET Developer"}
{"text": "Client: Diebold, Incorporated, North Canton, OH\t\t\t\tJan 2013 – Sept 2013"}
{"text": ""}
{"text": "Compliance Re-Write Reports: Diebold, Incorporated is a world class manufacturer of Automated Teller Machines (ATMs), self-service Transaction interface system, Security Systems, and software for financial, government, and other institutions. It uses Agile Methodologies along with windows servers, R2, Apache web server, MFC, ATL, COM. This system is based on various components such as (Web Application, Windows Service, and Web services); my contribution was in preparing the customizations of currently running program to the client’s desires."}
{"text": ""}
{"text": "Responsibilities:  "}
{"text": "Implemented the project in Agile methodology."}
{"text": "Participated in and provided input into the design, re-design and development of applications."}
{"text": "Developed solutions for diverse programming scenarios in C#, employing object oriented Programming (OOP) concepts."}
{"text": "Developed User Interface Screens using ASM, Data List and Grid view, Grid view customizations based on requirements."}
{"text": "Involved in the development of the Web Forms and web pages according to the specifications. "}
{"text": "BI tool Digital DashBoard was used for Clients progress viewing."}
{"text": "Worked with Model View Controller MVC pattern to design layer."}
{"text": "Implemented application logic in .Net MVC 4 with C#."}
{"text": "Developed front-end code (HTML5/CSS3/JavaScript) and created User Interface Screens."}
{"text": "Worked on creating view state, Cookies, and Sessions to manage user state."}
{"text": "Strong experience with onsite/offshore coordination, requirement gathering and maintaining deadlines for delivery."}
{"text": "Developed the SOAP based web-services so as to interact with third party software."}
{"text": "Front End Coding using but not limited to HTML/XHTML/DHTML, JavaScript, JQuery and XML."}
{"text": "Experience in using SQL server Reports (SSRS), Crystal Reports, SSIS."}
{"text": "Wrote Stored Procedures in T-SQL for implementing business rules "}
{"text": "Used ADO.Net extensively to interact with Oracle database"}
{"text": "Use agile methodology to develop the application and used CVS as version control tool."}
{"text": "Worked extensively in creating stored procedures, Functions , Entity framework data handling from oracle and SQL"}
{"text": "Performed Unit testing and UAT testing."}
{"text": "Classic ASP code was converted to ASP.NET code."}
{"text": "Involved creating the Tasks in TFS based on the user requirements."}
{"text": "Used IBM Rational ClearCase (CC) and ClearQuest (CQ) for source control Management."}
{"text": "Gave work inputs on creating a Demo of tools and interface to the client."}
{"text": "Used Visual Studios Coded UI technology to automate the Manual Execution."}
{"text": ""}
{"text": "Environment:"}
{"text": "ADO. NET, ASP .NET, HTML, XHTML, DHTML, JAVASCRIPT, JQUERY L, XML, SSIS, SSRS, SQL, T-SQL, Web Form, Win Form, GRID VIEW, MVC, SOAP."}
{"text": ""}
{"text": "Software Developer"}
{"text": "Client: eBay, San Jose, CA \t\t\t\t\t\t\tJune 2011 – Nov 2012"}
{"text": ""}
{"text": "Compliance Re-Write Reports: This module is a part of CTS (Compliance Tracking System) which is used to track the status and detail of any compliance for branch office and home office. The purpose of this initiative is to provide for extension to settle the compliance request and set a particular due date. My contribution was in preparing the Reports Involving SSRS and DB2 Queries. It also had process of security transfers to other financial institutions at the client’s request using Web for international offices, utilizing web based technology and web services to incorporate new processing."}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Worked on SSRS and DB2 Queries"}
{"text": "Used MVC as framework and designed business objects which are consumed across the application."}
{"text": "Built a heavy front end using HTML5/CSS3/JavaScript on top of .NET MVC 3"}
{"text": "The context data was accessed from PF which internally stored context values in SQL server."}
{"text": "Consumed SOLA Mainframe transactions. MLIF could seamlessly connect to multiple sources to get data and provide it to the Business objects."}
{"text": "Created WCF Webservices."}
{"text": "Worked extensively in creating stored proceed Involved in Development of a Customizable Record Auditing System for Entity Framework to allow tracking of changes to database records by user and timestamp using C#, Entity Framework and SQL Server 2008. user, Functions , Entity framework data handling from oracle and SQL"}
{"text": "Created pages using CSS, JavaScript, JQuery, and XML."}
{"text": "Developed various static and dynamic modules which are displayed in different web pages according to the specifications."}
{"text": "Performed Unit Testing of the developed component and web forms using NUnit."}
{"text": "Creation of custom controls as per the project requirement"}
{"text": "Implemented Client side validations with JavaScript for fast computation and Server side validations with ASP.NET server controls. "}
{"text": "Created an automation script using Classical ASP and SQL Server 2008 to generate an EXCEL sheet using the database details."}
{"text": "Created Ajax calls to exchange (request / responses) information with database."}
{"text": "Used SOAP, UDDI, and WSDL for service oriented architecture."}
{"text": "Used Sub Version (SVN), extensively for version control of the source code along with the maintenance of the builds and the relevant documents of the same."}
{"text": "Used Team Foundation Server (TFS) for source code version controlling"}
{"text": "Worked on Web Controls, User Controls, Custom controls and AJAX controls. "}
{"text": "Used Language Integration Query (LINQ) and LINQ to Ado in the application."}
{"text": "Used Ajax Toolkit for dynamic Web Pages, GridView, DataSet, Validators."}
{"text": ""}
{"text": "Environment: "}
{"text": "ASP.NET, C#, SQL Server 2008, SSRS and DB2 Queries, Microsoft Visual Studio 2010, WCF, HTML, CSS, PL/SQL, JavaScript, XML, Windows2003. "}
{"text": ""}
{"text": ".Net Developer"}
{"text": "Client: CISCO, Minneapolis, MN \t\t\t\t\tMarch 2010 – March 2011"}
{"text": "\t"}
{"text": "The New E-Rate system provides support to all cisco organizations in all regions responsible for the administration of E-Rate program. This program offers significant sales opportunities for schools and libraries. The Applicant downloads the application from Federal Schools and Library Division website and the applications are routed to the appropriate manager. The applicants account is profiled with eligible products and discount is computed."}
{"text": ""}
{"text": "Responsibilities: "}
{"text": ""}