{"text": "Name: elizabeth elizabeth"}
{"text": "E-Mail: elizabeth.elizabeth@gmail.com"}
{"text": "Address: New York, United States"}
{"text": "Github: https://github.com/elizabeth"}
{"text": "LinkedIn: https://linkedin.com/elizabeth"}
{"text": "Phone No. 126072077159"}
{"text": ""}
{"text": "Summary:"}
{"text": "Having7+ yrs. Experience in creating the clustered environment, configuring the mail server, setting the ColdFusion development environment using ColdFusion Administrator and Expertise in configuring in web Servers (IIS and Apache) and App servers."}
{"text": "Solid working Knowledge of advanced ColdFusion with Allaire Spectra and ColdFusion Fuse Box Methodology"}
{"text": "Knowledge in Design and Development of Interfaces, User Controls and Custom Controls using ASP.NET and C#"}
{"text": "Experienced in all steps of System Development Life Cycle (SDLC) of web projects, focusing on requirement specification to product release in E-Commerce, Web Applications and Application development in ColdFusion in coordination with Oracle and MS SQL."}
{"text": "Expertise in designing the user interactive web applications using with web authoring tools like Adobe Dreamweaver CS3, Adobe Contribute CS3, Adobe Illustrator, Adobe Acrobat Pro and Microsoft FrontPage and Eclipse."}
{"text": "Good knowledge and hands on experience with various \"Open Source\" technologies and programming languages. Specific languages include: ColdFusion MX 6, 7, Adobe Flex 4, Adobe Flash, AJAX, Macromedia Dreamweaver, HTML, DHTML, JavaScript, CSS and MySQL."}
{"text": "Experience in using editors like Dream weaver CS3, Homesiteand Eclipse."}
{"text": "Good understanding of OOAD, WDDX and Web Services."}
{"text": "Expertise in developing applications using CFML on both Windows and UNIX Operating Systems."}
{"text": "Experience in Web Services, WDDX, and Fuse box Web Application Standards, CFCs and CFobjects."}
{"text": "Works effectively in independent and in cross-functional team environments."}
{"text": "Flexible and ability to balance multiple projects at one time in a fast-paced environment."}
{"text": "Experience in SQL Server 7.0/ 2000, SQL Server 2005 database and SQL Server 2008 administration."}
{"text": "Good experience in Relational Database Management System (RDBMS) Design, Normalization, and Database Management oriented concepts and back end programming using PL/SQL."}
{"text": "Experience in Data Analysis, Database Design (Physical and Logical databases) utilizing SQL, and Oracle."}
{"text": "Experience in customized commercial web content development for corporate environments."}
{"text": "Expertise in creating the clustered environment, configuring the mail server, setting the Cold Fusion"}
{"text": "Development environment using ColdFusion Administrator and Expertise in configuring in web Servers"}
{"text": "Thoroughly developed custom UI Components using of Adobe Flex. "}
{"text": "Excelled with Action Script 3/2 including design patterns and Cairngorm framework for Flex applications."}
{"text": "Possesses strong analytical and technical acumen backed by vast programming and research experience in the areas of application and web development"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Technical Skills:"}
{"text": ""}
{"text": ""}
{"text": "Professional Experience:"}
{"text": "Travelclick, Schaumburg,IL\t\t\t\tJuly 2016 – May 2017"}
{"text": "ColdFusion Developer"}
{"text": "Insite is Travel Click's integrated solutions to increase revenues, reduce costs, and improve performance of Hotels.It allows Media team to create Media Campaigns, Media Insertions as well as tracks revenues on advertisement spending of its customers .The purpose of this project is to facilitate automatic transfer of data from InSite in such a manner as to fulfill AdTrafficking for Sabre media products via the Sabre XaxisAdServer without manual intervention."}
{"text": "Responsibilities:"}
{"text": "Involved in the requirement analysis, design, and development of Customer portal graphs and Sabre GDS automation."}
{"text": "Involved in user interfaces creation using ColdFusion, HTML, CSS, JavaScript,Ajax, CF templates."}
{"text": "Analysis, design and system development with MS SQL, jQuery, JS, CF10."}
{"text": "Involved in user interfaces creation using ColdFusion, ASP.NET."}
{"text": "Created ColdFusion Components, Custom tags, sessions."}
{"text": "Writing Application.cfc for global variables and code reusability."}
{"text": "Developed the Web Services to call third party components."}
{"text": "Conversion of CSS Files to SASS files in bootstrap."}
{"text": "Involved in implementing MVC architecture to separate business logic from view part using OOP in PHP5. "}
{"text": "Built Web Services with SOAP, XML and WSDL for data connectivity to SABRE and back."}
{"text": "Generated the Reports module using CFML consisting of statistical in Excel formats."}
{"text": "Worked on structure, array and xml functions in ColdFusion."}
{"text": "Modified ASP.NET pages with in-built user validation where required."}
{"text": "Enhanced user experience by designing new web features using Bootstrap, Java script uses these advanced and fast technologies."}
{"text": "Writing various queries to pull the data from various databases and involved in writing queries, store procedures and tables."}
{"text": "Worked on Sabre Gds automation and customer portal reports."}
{"text": "Worked on Sabre API guide to read and understand on how to pass necessary AdXML."}
{"text": "Developed various types of graphs to represent the various hotels’sRevenue, Bookings, Net Revenue, etc."}
{"text": "Developed a new page SABRE GDS ERROR LOG TAB to store the insertions with errors returned by XAXIS API."}
{"text": "Environment: COLDFUSION 10, JAVA SCRIPT, AJAX, ASP.NET, HTML, CSS, XML, BOOTSTRAPS, SUBLIME, PL/SQL DEVELOPER, ORACLE 11G"}
{"text": ""}
{"text": "State of Colorado, CO\t\t\t\tJune 2014 – July 2016"}
{"text": "Sr.ColdFusion Developer"}
{"text": "Public Authority Informationis a part of Open Book Initiative of Colorado Comptroller’s Office to make Public Authority Information available on the Colorado Comptroller’s web site. Public authorities self-report financial information in the Public Authorities Reporting Information System (PARIS), an online data entry and collection system. This information is made available in Open Book through Public Authority Information to provide users with the Trend and Comparison financial reports of authorities. "}
{"text": "Responsibilities:"}
{"text": "Involved in the requirement analysis, design, and development and testing."}
{"text": "Involved in user interfaces creation using ColdFusion, HTML, CSS, JavaScript,Ajax, CF templates. "}
{"text": "Debugging, bug fixing and Project Documentation."}
{"text": "Involved in migration data from ColdFusion version 8 to 9."}
{"text": "Developed and managed a wide array of intranet projects from Fraud management systems to content management system. "}
{"text": "Involved in user interfaces creation using ColdFusion, ASP.NET, and JavaScript, CF templates."}
{"text": "Developed policies and procedures for teams for effective and better development and coding methodologies."}
{"text": "Used MVC Framework for development of web based application."}
{"text": "Developed internet applications utilizing RAS internet security software."}
{"text": "Implemented Ajax to the capability of intranet PHP WebPages."}
{"text": "Implemented tools which acts as an intermediary for linking simple XML-based applications to web services using WS-Security."}
{"text": "Developed a Chat Module Forms Using Flex."}
{"text": "Designed and developed a wide array of reports from ad-hoc reports to custom reports."}
{"text": "Form field validations using Java script."}
{"text": "Involved in Responsive Web Design using Bootstrap framework."}
{"text": "Programming encoding and encrypting using 2D barcode and entrust RSA for Sunlife."}
{"text": "Analysis, design and system development with CF 9.0, MS SQL, jQuery, JS, Cold Spring."}
{"text": "Implemented Fuse Box methodology."}
{"text": "Responsible for ColdFusion Application Server Installation and Configuration."}
{"text": "Designed and developed the backend for the tool in Oracle 9i"}
{"text": "Designed and developed a wide array of reports from ad-hoc reports to custom reports."}
{"text": "Building Drill-Down Interfaces using Dynamic URL Parameters in ColdFusion."}
{"text": "Created ColdFusion Components, UDFs, Custom tags, sessions and Cookies."}
{"text": "Writing Application.cfc for global variables and code reusability. "}
{"text": "Involved in building Search Engine and Report using ColdFusion Report Builder."}
{"text": "Creating and reading XML documents through ColdFusion Applications."}
{"text": "Responsible of setting up of Client environments and creating connections in ColdFusion Admin Server."}
{"text": "Unit testing and used Log and CFlog for logging errors."}
{"text": "Environment: COLDFUSION10.0/ 9.0/8.0, ADOBE DREAMWEAVER CS3, ADOBE FLEX, ADOBE FLASH WITH ACTION SCRIPT, XML, MVC, CRYSTAL REPORTS, HTML,ASP.NET, COLDFUSION REPORTS, BOOTSTRAPS, ADOBE FIREWORKS CS3, ADOBE PHOTOSHOP CS3, JAVA SCRIPT,  ORACLE 9I"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "State of NE, Lincoln,NE\t\t\t\t\tJune 2013 – June 2014"}
{"text": "Sr.ColdFusion Developer"}
{"text": "The primary functions of the Department of Transportation are the construction, improvement, and maintenance of the state highway system Responsibilities include the development and implementation of comprehensive transportation plans for the entire state, including aeronautics and bus and rail transit, providing professional and technical assistance, and the administration of state and federal funds allocated for these programs. The director of the department is appointed by the governor, with the advice and consent of the senate."}
{"text": "Responsibilities:"}
{"text": "Designed and developed user interfaces in Dreamweaver "}
{"text": "Responsible for gathering business requirements, developing and reviewing of design documents"}
{"text": "Developed the application using the ColdFusion MX7/ 8 server side scripting along with HTML, JavaScript."}
{"text": "Incorporating Web Standards for CFML, HTML, XHTML, CSS, XML, XSL, JavaScript, Web Services, FUSEBOX, RSSaccording to World Wide Web consortium"}
{"text": "Worked on converting html data into PDF & Word documents."}
{"text": "Developed re-usable components using CFComponents and Custom Tags."}
{"text": "Worked on CFDocument, CFSavecontent, CFContent,CFCollection, CFSearch,CFMAIL andCFFile."}
{"text": "Developed robust authentication and validation process."}
{"text": "Used XML, Json to transfer data and messages to and from Web Services."}
{"text": "Developed the new Custom Tags and ColdFusion Components (CFCs),"}
{"text": "Developed the User Defined Functions (UDF’s)."}
{"text": "Database Maintenance and support for backup Databases."}
{"text": "Data modeling, TuningSQL queries and researching to improve the new ColdFusion based system performance."}
{"text": "Involved in the PHP Code Writing and API's Integration ."}
{"text": "Working with DTS Packages, writing stored procedures, triggers, views."}
{"text": "Responsible in updating the tables in SQL server database"}
{"text": "Providing 24X7 support during Go-Live Involved in Requirement, collection and study of existing system and preparing work packets for the new enhancement requests."}
{"text": "Worked on CF administrator to create DSN"}
{"text": "Worked on CF deployment and verity Server."}
{"text": "Responsible for MS SQL Server 2012, configuration, tuning and provide 24 X 7 dedicated support to all Production, development and clustered servers."}
{"text": "Maintained and developed CFQUERY, CFREPORT."}
{"text": "Very much involved in CFADMIN settings in the ColdFusion application server."}
{"text": "Worked with ActivePDF"}
{"text": "Used CFSTOREDPROC and Modified Stored procedures based on requirements"}
{"text": "Used CFTRANSACTION for multiple queries and rollback features"}
{"text": "Created User’s Guide (On-line help)"}
{"text": "Involved in testing and documenting the application."}
{"text": "User Documentation and Involved in user training."}
{"text": "Environment: ADOBE COLDFUSION 8.0 MX 7.0, HTML, XML, JAVA SCRIPT,  ORACLE 9I, SQL SERVER 2005/2008, MS SQL, CSS, SQL, FUSEBOX, DREAMWEAVER, ASP.NET, ACTIVEPDF, CRYSTAL REPORTS, ADOBE PHOTOSHOP"}
{"text": ""}
{"text": "Bank of America,Lansing,MIOct 2012 – June 2013"}
{"text": "Sr. ColdFusion Developer"}
{"text": "ACAPS Direct Pricing Engine is the intranet-delivered application accessible to associates granted with necessary privilege. It is created to set up pricing by product for Direct Origination Loans captured in the ACAPS Direct System and also automates the interest rates. The system is developed using ColdFusion 6.0/7 with DB2 database server as the backend."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Analyzed the project environment and sub systems of the project, and prepared a high level documentation for application designing. "}
{"text": "ColdFusion Administrator: set up the environment, data sources and server mappings. "}
{"text": "Responsible for conceptualization, design, layouts and logic flow of the project."}
{"text": "Involved in user interfaces creation using ColdFusion, ASP.NET, and JavaScript, CF templates. "}
{"text": "Involved in developing intranet web applications using HTML, ColdFusion 8, JavaScript, CSS and Ajax."}
{"text": "Involved in the creating of database objects like tables views, stored procedures, functions, packages, DB triggers and indexes using the latest Oracle 8i."}
{"text": "Implemented the web services to integrate with back end office systems."}
{"text": "Extensive experience of developing Clients for REST and SOAP based Web Services."}
{"text": "Developed ColdFusion Components and custom tags. "}
{"text": "Upgrade current application from CF 6.0 to CF8.0 version."}
{"text": "Installing ColdFusion on different systems (including clustering) and configuring those with appropriate database."}
{"text": "Creating users for accessing ColdFusion admin server with appropriate rights."}
{"text": "Enhanced existing user interfaces."}
{"text": "Created and altered technical illustrations using Adobe Illustrator and Quicksilver"}
{"text": "Set up Client environments and created connections in ColdFusion Admin Server."}
{"text": "Involved in Data migration from Portal Servers to Excellence Award Applications."}
{"text": "Developed the User Defined Functions (UDF)."}
{"text": "Database Maintenance and support for backup Databases."}
{"text": "Involved in Unit testing and Integration testing. "}
{"text": "Used ColdFusion reports for integrating with websites, also for analyzing data."}
{"text": "Creating Flex AIR desktop applications, with the use of XML, Photoshop, flash etc."}
{"text": "Integrating FLEX applications with COLDFUSION."}
{"text": "Environment:ColdFusion MX 6.0/7, Adobe Dreamweaver CS3, Adobe Flex 3, Adobe Flash CS3 with Action Script 3.0,XML, Crystal Reports, HTML, ColdFusion Reports, Adobe Fireworks CS3, Adobe Photoshop cs3, Java Script, SQL Server 2008 and 2005/Oracle 8i"}
{"text": ""}
{"text": "37th crescent, Bengaluru, IndiaJun 2010 –Sep 2012"}
{"text": "ColdFusion Developer"}
{"text": "Client: Abudabi Municipal portal credentials, Abudabi"}
{"text": "Developed appilication on workers portal initiate with flash and Fusebox"}
{"text": "Responsibilities:"}
{"text": "Involved in design and develop the ColdFusion application."}
{"text": "Implemented application using FuseBox Methodology."}
{"text": "Created programs in ColdFusion, AJAX and JavaScript to run various tasks such as user validation"}
{"text": "Upgrade current application from CF 6 to CF 7 version."}
{"text": "Designed and implemented various web pages using CFML."}
{"text": "Developed Components and many reusable Custom tags depend on requirement."}
{"text": "Developed the User Defined Functions (UDF’s) and enhanced existing user interfaces."}
{"text": "Involved in the creating of database objects like tables views, stored procedures, functions, packages, DB triggers and indexes using SQL Server 2005."}
{"text": "Modified ASP.NET pages with in-built user validation where required."}
{"text": "Involved in Data mapping and migration process from SQL Server to Oracle Database."}
{"text": "Used ColdFusion reports for integrating with websites, also for analyzing data."}
{"text": "Involved in creating Tables, Views, and Indexes, writing Stored Procedures, Triggers using T-SQL (DML and DDL) as well as analyzing and debugging existing complex stored procedures in Oracle 10g and SQL server 2005"}
{"text": "Involved inFlex Layout and Navigation, Advanced Event Handling, Popup Dialogs, Menus and Skinning."}
{"text": "Creating animations on AdobeFLASH, with appropriate Action script and incorporating with FLEX for exceptional WebPages."}
{"text": "Creating FlexAIR desktop applications, with the use of XML, Photoshop, flash etc."}
{"text": ".Environment: COLDFUSION MX 6.0/7, JAVA SCRIPT, AJAX, HTML, ACTION SCRIPT, DHTML, CSS, FLEX 3.0, ACTION SCRIPT, DHTML, CSS, FUSEBOX FRAMEWORK,ASP.NET, WEB SERVICES, XML, IIS 7, CFECLIPSE, WEBLOGIC, SQL SERVER 2005, ORACLE 10G"}
{"text": ""}
{"text": ""}