{"text": "Name: helen helen"}
{"text": "E-Mail: helen.helen@gmail.com"}
{"text": "Address: Ōsaka, Japan"}
{"text": "Github: https://github.com/helen"}
{"text": "LinkedIn: https://linkedin.com/helen"}
{"text": "Phone No. 273191524528"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:-"}
{"text": "Overall 6+ years of experience as core application developer with focus on core , databases, analytical and systems programming using Python, Django, SQL, Java, C++, JavaScript, HTML & CSS. "}
{"text": "Experience object oriented programming (OOP) concepts using Python, SQL & C++. "}
{"text": "Experienced in developing web-based applications using Python, DJANGO, GTK, QT, C++ "}
{"text": "Experience of working on MapReduce and live streaming big data processing using Apache Cassandra and Apache Spark "}
{"text": "Familiar with JSON based REST API using Python, Django, and Flask. "}
{"text": "Experienced in installing, configuring, modifying, testing and deploying applications with both relational and NoSQL Databases. "}
{"text": "Experienced in WAMP (Windows, Apache, MYSQL and Python) and LAMP (Linux, Apache, MySQL, and Python) Architecture. "}
{"text": "Experience in writing Sub Queries, Stored Procedures, Triggers, Cursors, and Functions on SQL with MS SQL Server and PostgreSQL database. "}
{"text": "Very strong full life cycle application development experience. "}
{"text": "Experience with continuous integration and automation using Selenium on Jenkins "}
{"text": "Experience with Unit testing/ Integration Testing & End to End Testing "}
{"text": "Involved in Unit testing and Integration testing and iterative end to end testing "}
{"text": "Strong grip on machine learning techniques and problem solving using supervised and unsupervised learning using Regression (Linear Regression, PLR, SVM, Decision Tree) & Classification. "}
{"text": "Data preprocessing using Sampling techniques and Principle Component Analysis (PCA) and search trees. "}
{"text": "Experienced with full software development life-cycle, architecting scalable platforms, object oriented programming, database design, etc. "}
{"text": "Vast experience coding in various IDEs - IDLE, iPython Notebook, Anaconda, Spyder, Pycharm, Jupyter, R Studio, R Server. "}
{"text": "Strong knowledge in Distributed Systems and Client/ Server Architecture. "}
{"text": "Hands on Experience in working with the Cassandra Query Language (CQL) for querying the data present in the Cassandra. "}
{"text": "Familiar with JSON based REST Web services and Amazon Web services (AWS) "}
{"text": "Good idea using debugging tools like Bugzilla, and JIRA. "}
{"text": "Good experience with cloud platforms like Amazon AWS and Google AppEngine. "}
{"text": "Extensively followed development methodologies such as Agile (SCRUM), Water Fall. "}
{"text": "Excellent Experience of Databases such as MySQL, Oracle 8g/9g/10g, Microsoft SQL Server, PostgreSQL, SQL/PLSQL concepts & PowerShell. "}
{"text": "Good Knowledge of using IDE Tools like Eclipse, NetBeans, Android Studio, Visual Studio, IDLE. "}
{"text": "Experience on Ruby Reg-Ex for pattern and Text matching. "}
{"text": "Good hands on Should have strong UI building capabilities based off JavaScript and related libraries. "}
{"text": "Highly dedicated, quick starter, solution driven pattern programmer with excellent at solving complex problems under strict deadlines. "}
{"text": "Experience with manual testing (unit testing, integration testing and end to end testing) "}
{"text": "Experience of using automation testing using Selenium on Tomcat and Jenkins "}
{"text": "Good understanding of cloud based DAG and Apache Air Flow "}
{"text": "Experience of creating RESTful API using Python/Django and WSGI based Falcon APIs."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS:-"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:-"}
{"text": ""}
{"text": "Prime Therapeutics, Eagan, MN  \t\t\t\t                            Aug 2016 – Till Date"}
{"text": "Sr. Python Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for gathering requirements, system analysis, design, development, testing and deployment. "}
{"text": "Developed tools using Python Shell scripting, XML to automate some of the menial tasks. Interfacing with supervisors, artists, systems administrators and production to ensure production deadlines are met."}
{"text": "Wrote Python script for validating external data after downloading "}
{"text": "Extensive usage of SQL Profiler and Analytics for query optimization and maintenance "}
{"text": "Raw Data Extraction, Cleaning, Transformation from 1000+ nodes in XML format "}
{"text": "Wrote Stored Procedures in SQL and Scripts in Python for data loading "}
{"text": "Developed Business Logic using Python on Django Web Framework and views and templates with Python and Django's view controller and templating language to create a user-friendly website interface "}
{"text": "Designed and developed data management system using MySQL. Built application logic using Python 3.4 and used Django APIs for database access. "}
{"text": "Provided GUI utilizing PyQt for the end user to create, modify and view reports based on client data and used Angular.js to build efficient backend for client web application and Python to extract information from XML files. "}
{"text": "Worked on Service Oriented Architecture (SOA) and its related technologies like Web Services, BPEL, WSDLs, SOAP1.1, XML, XSD, XSLT etc. "}
{"text": "Participated in requirement gathering and worked closely with the architect in designing and modeling. "}
{"text": "Used Django Database API's to access database objects and JQuery and Ajax calls for transmitting JSON data objects between frontend and controllers "}
{"text": "Involved in building database Model, APIs and Views utilizing Python in order to build an interactive web based solution. "}
{"text": "Used Python based GUI components for the front end functionality such as selection criteria, Amazon Web Services (AWS) for improved efficiency of storage and fast access. "}
{"text": "Created Python scripts for data access and analysis (Scripts, DataFeeds, XLS, FIXML) to aid in process and system monitoring, and reporting. "}
{"text": "Wrote Python scripts to parse XML documents and load the data in database and generated property list for every application dynamically using Python also used Bootstrap and Angular.js as a mechanism to manage and organize the HTML page layout. "}
{"text": "Created test harness to enable comprehensive testing utilizing Pythonand added support for Amazon AWS S3 and RDS to host static/media files and the database into Amazon Cloud. "}
{"text": "Involved in front end and utilized Bootstrap and Angular.js for page design and created Data tables utilizing PyQt to display customer and policy information and add, delete, update customer records. "}
{"text": "Created UI Screens for initiation and validation and worked on UI using HTML5, CSS3 and Java Scripts. "}
{"text": ""}
{"text": "Environment: Python 3.4, Django, Shell Scripting, AWS, Pandas, PyQt, PyQuery, Wireshark, Flash, DOM, JSON, PHP, HTML5, CSS3, AJAX, JavaScript, Angular.js, Bootstrap, Apache Web Server, MYSQL, GitHub, LINUX."}
{"text": ""}
{"text": ""}
{"text": "PayPal, Austin, TX\t\t\t\t\t\t\t               Dec 2015 – Jul 2016"}
{"text": "Python Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Used Django framework for application development. "}
{"text": "Running Robot Framework on Python using the ipybot runner script "}
{"text": "Assisted in reduction of cost and optimization of supplier selection for the CRM Applications. "}
{"text": "Provides a command line interface and XML based outputs for integration into existing build infrastructure by using Robot Framework "}
{"text": "Used Graphical User Interface Testing and API driven Testing "}
{"text": "Used several Python libraries like wxPython, numPY and matPlotLib. "}
{"text": "Using features that support complex data structures, first class functions by using PERL "}
{"text": "Implementing Robot Framework using Python "}
{"text": "Designed and developed the UI of the website using HTML, XHTML, AJAX, CSS and JavaScript. "}
{"text": "Developed entire frontend and backend modules using Python on Django Web Framework. "}
{"text": "Generated property list for every application dynamically using Python."}
{"text": "Involved in back end development using Python with framework Flask. "}
{"text": "Involved in analysis and design of the application features. "}
{"text": "Designed and developed communication between client and server using Secured Web services. "}
{"text": "Created UI using JavaScript and HTML5/CSS. "}
{"text": "Developed & tested many features for dashboard using Python, Bootstrap, CSS, JavaScript and JQuery. "}
{"text": " Developed Restful API's using Python and Flask framework. "}
{"text": " Wrote unit test cases for testing tools. "}
{"text": "Used design patterns efficiently to improve the code reusability and also used JIRA for bug tracking and issue tracking. "}
{"text": "Developed API modularizing existing python module with the help of pyYAML libraries. "}
{"text": " Used Graphical User Interface Testing and API driven Testing "}
{"text": " Responsible for debugging and troubleshooting the web application. "}
{"text": " Work with multiple teams to guide and influence the architecture and design of the various \nproducts "}
{"text": " Created unit test/regression test framework for working/new code "}
{"text": " Used design patterns efficiently to improve the code reusability and also used JIRA for bug tracking and issue tracking. "}
{"text": "Responsible for debugging and troubleshooting the web application. "}
{"text": "Administered and monitored multi Data center Cassandra cluster based on the understanding of the Cassandra Architecture. "}
{"text": "Designed, automated the process of installation and configuration of secure DataStax Enterprise Cassandra using chef. "}
{"text": "Wrote python scripts to parse XML documents and load the data in database. "}
{"text": "Worked in stages such as analysis and design, development, testing and debugging. "}
{"text": "Organized data exchange and integration with customers and third-party systems using CSV, XLS, XML, DBF, JSON, REST, SOAP. "}
{"text": "Environment:Python 2.7, Windows, MySQL, flask and python libraries such as Numpy ,pychemy,  IDEA, Linux, Eclipse, Shell Scripting, HTML5/CSS, Apache."}
{"text": ""}
{"text": "Honeywell Technology Solutions, Chennai, India                  Nov 2012 - Jun 2015"}
{"text": "Python Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for gathering requirements, system analysis, design, development, testing and deployment. "}
{"text": "Participated in the complete SDLC process. "}
{"text": "Wrote Python modules to extract/load asset data from the MySQL source database. "}
{"text": "Designed and implemented a dedicated MYSQL database server to drive the web apps and report on daily progress. "}
{"text": "Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface. "}
{"text": "Experience in doing automatic data-typing and automatic memory management by using PERL "}
{"text": "Implemented the presentation layer with HTML, DHTML, Ajax, CSS and JavaScript. "}
{"text": "Performed coding in C++ on Linux Platform. "}
{"text": "Developed a portal to manage and entities in a content management system using Flask"}
{"text": "Involved in writing stored procedures using MySQL. "}
{"text": "Optimized the database queries to improve the performance. "}
{"text": "Manage the collection process for obsolete Technology equipment for recycling (gather equipment "}
{"text": "Coordinate the breakdown of Technology equipment prior to summer break "}
{"text": "Setup the Technology at both buildings after summer cleaning is complete "}
{"text": "Research and Recommend Technology purchases for school based initiatives "}
{"text": "Work with the Director of Technology on the district Technology plan and help plan for relevant professional development"}
{"text": "Designed and developed the UI of the website using HTML, XHTML, AJAX, CSS and JavaScript. "}
{"text": "Developed entire frontend and backend modules using Python on Django Web Framework. "}
{"text": "Worked on data exchange from website using XML, JAVA and Web Services. "}
{"text": "Created entire application using Python, Django, MySQL and Linux."}
{"text": "Environment:C++, XML, Java, MYSQL, Apache, CSS, ORACLE, DHTML, HTML,IBM Bluemix, JavaScript, Shell Scripts, Linux and Windows, flask, Python"}
{"text": ""}
{"text": "Radiant Solutions, Hyderabad, India\t\t\t\tJul 2011 – Oct 2012"}
{"text": "Software Programmer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed robust Android applications for clients using Android and software best practices."}
{"text": "Developed an HR application for a client using kotlin . Main feature of the app was offline data \nsynchronization. "}
{"text": "Developed interactive applications consuming Android support library and material design."}
{"text": "Integrated UI with the Bluetooth communication layer."}
{"text": "Ensured communication between devices and mobile application using Arrayent SDK."}
{"text": " Developed custom views for animations and transitions."}
{"text": "Launched an unbound background service to track user's MNC and MCC changes"}
{"text": "Created UI and Implemented the presentation layer with HTML, DHTML, Ajax, CSS and JavaScript. "}
{"text": "Involved in writing stored procedures using MySQL. "}
{"text": "Used JavaScript and UI for parsing XML and XSLT. "}
{"text": "Worked with the design team for project structure. "}
{"text": "Created database access layer using JDBC and PL/SQL stored procedures. "}
{"text": "Optimized the database queries to improve the performance."}
{"text": ""}
{"text": " Environment:MySQL, Linux, HTML, XHTML, CSS, AJAX, JavaScript, and Apache Web Server, NO SQL."}
{"text": ""}