{"text": "Name: jean jean"}
{"text": "E-Mail: jean.jean@gmail.com"}
{"text": "Address: Istanbul, Turkey"}
{"text": "Github: https://github.com/jean"}
{"text": "LinkedIn: https://linkedin.com/jean"}
{"text": "Phone No. 185575760100"}
{"text": "PROFESSIONAL SUMMARY"}
{"text": ""}
{"text": "Over 7+ years of experience in developing distributed applications leveraging C#, VB.NET, ASP.NET, ADO.NET, WPF, Silverlight, WCF, Web Services, Windows Services, SQL Server, Oracle, AJAX, Angular JS, jQuery, XML and Java Script."}
{"text": "Experience in .Net Framework 2.0/3.0/4.0/4.5, MVC Framework (4.0/5.0) in developing Web Applications."}
{"text": "5 years of extensive experience in web applications using Visual Studio 2003/2005, 2008, 2010/2012/2013, languages C#.NET and VB.NET."}
{"text": "Knowledge in XML related technologies: XML, XSL, XSLT and XPATH."}
{"text": "Created procedures, functions, triggers, cursors, packages and advance level queries and implemented business logic in PL/SQL."}
{"text": "Extensive experience with Entity framework, ADO.Net in building backend Data Access Layers."}
{"text": "Implemented different web applications by using ASP.NET, MVC framework and Angular JS."}
{"text": "Experience with developing web applications by using MVC, MVP architecture and Application Books."}
{"text": "Experienced with OOP, agile environment, MVC, MVVM, RWD, Web & Win Forms UI design understanding and experience."}
{"text": "Experience with HTML5, CSS 3 and Bootstrap components."}
{"text": "Well versed with all phases of the Software Development Life Cycle."}
{"text": "Proficient with Object Oriented Analysis and Design (OOAD)."}
{"text": "Experience with Service Oriented Architecture (SOA) implementing Web Services: SOAP & SOAP Extensions, and WCF: Hosting, Debugging, Tracing, Transactions, and Security."}
{"text": "Experience in developing ASP.NET Web customs controls, user controls, Data Controls like Data Grid, Rich UI with extensive use of ASP.NET AJAX, Knockout.JS, Ember.JS, Backbone JS, Angular JS, Bootstrap and jQuery and building RIA web applications."}
{"text": "Experience developing rich GUI using Windows Presentation Foundation (WPF) and good working knowledge of Silverlight."}
{"text": "Employed object oriented concepts like Data Abstraction, Inheritance, Data Encapsulation, Polymorphism using C#.Net."}
{"text": "Experience with the Object Relational Mapping (ORM) using LINQ."}
{"text": "Working knowledge of ASP.NET MVC pattern: Controller Actions, View Engine, HTML Helper methods, Entity Framework Model and the Windows Workflow Foundation."}
{"text": "Solid experience in Database design and programming: writing Stored Procedures, Functions, Triggers, Views, Joins, performing Query Optimization and Performance Tuning."}
{"text": "Expertise with reporting using Crystal Reports & SQL Server Reporting Services (SSRS)."}
{"text": "Strong knowledge of Design Patterns, and the UML methodology."}
{"text": "Performed Test Driven Development (TDD): Unit Testing and Load Testing."}
{"text": "Strong knowledge of Custom Controls, State Management, Caching, Enterprise Application Blocks, and Security."}
{"text": "Team player, maintained client/customer relationships by providing timely, superior quality products and services, understanding of client/customer needs, opportunities and satisfaction criteria."}
{"text": "Proficient in interpersonal relations, leadership skills, Project Management, Communication, Outsourcing Partner Teamwork, and Organization."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS"}
{"text": ""}
{"text": "Professional Experience "}
{"text": ""}
{"text": "Mallinckrodt Pharmaceuticals, St. Louis, MO  \t\t\t\t\t          Jul 2014– Till date\t                                     "}
{"text": "Role: Sr .NET Developer"}
{"text": "Mallinckrodt Pharmaceuticals is a multibillion dollar specialty biopharmaceutical company. They provide medicines to address unmet patient needs, stemming from nearly 150 years of using our unique strengths, experience and expertise to help improve people’s lives."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Work in Agile mode, plan and deliver for two week sprint and participate in all scrum ceremonies."}
{"text": "Worked on C# (4.0), .NET, MVC (4.0), AngularJS, and HTML5 for developing various tabs."}
{"text": "Worked extensively on MVC, MVP and MVVM software design patterns."}
{"text": "Used Entity framework CODE FIRST to improve the overall performance of the application."}
{"text": "Created WCF SOAP, WCF REST Services and also used different bindings to make it available to different types of clients"}
{"text": "Developed Web Forms for the modules using ASP.Net server controls, Validation Controls, and HTML, CSS."}
{"text": "Designed and implemented Data access layers (model) using LINQ for XML Data and multi-user interface"}
{"text": "Created Business and Data Access layers using C# as the code behind."}
{"text": "Involved in creating applications using VB.Net and enhancing projects for .Net applications."}
{"text": "Take complete ownership and lead the team in effectively implementing the design and overall development of the product. Developed the common components based on the business requirements for the re-usability purpose."}
{"text": "Worked on a 3-tier architecture which received the risk analysis data from centralized database using WCF services and stores them in their internal database as static data."}
{"text": "Created Ajax calls through Java script."}
{"text": "Implemented WPF to create, attractive and effective user interface using XAML document."}
{"text": "Created Look Book project admin Web Application developed using ASP.NET."}
{"text": "Used XML, XSLT and defined XML Schema."}
{"text": "Applied Master Page, Skins and Themes to give a website consistent look throughout."}
{"text": "Designed various web forms using Master Pages for judges and courts, CSS, skins and themes."}
{"text": "Different Validation controls provided in web forms that are used for input validations, also developed server side code for input validations in C#.Net"}
{"text": "Experience in designing and invoking reports for Web Applications using Crystal Reports and SSRS (SQL Server Reporting Services)."}
{"text": "Implemented User Controls to wrap up the reusable code, provided facility to upload various types of documents in attachments page."}
{"text": "Worked closely to clients for gathering and analyzing requirements and providing solution that meets client’s need."}
{"text": "Interface with database and stored procedure using ADO.NET Dataset, Data Reader, Data Adapter and Data Grid."}
{"text": "Implemented Presentation layer using CSS Framework, Wire-framing, and HTML5."}
{"text": "Developed fast loading images using Adobe Photoshop CS3."}
{"text": "Created XHTML5 Pages with CSS3 and the Box Model."}
{"text": "Wrote Queries and Stored Procedures for integrating database for CRUD operations with databases."}
{"text": "Worked on creating tables, views, triggers, sequences, constraints, Stored Procedures, Functions, and Packages using SQL, and PL/SQL based on the documented user requirements."}
{"text": "Troubleshoot and provided resolution for different kind of issues during the various stages of project."}
{"text": "Developed Web Services using ASP.NET, VB.NET and SQL Server 2008."}
{"text": "Used Java Script to validate the user input."}
{"text": "Developed Use Cases, Sequence and Class Diagram understanding the client requirements using MS-Visio."}
{"text": "Its web based N-Tier application developed using WCF Services and Data Services (Data Access Layer) as Business Service Tier and ASP.NET as Presentation Tier."}
{"text": "Fixing various bugs as well as enhancing quality with performance for both applications."}
{"text": ""}
{"text": "Environment: Visual Studio.NET 2010, .Net Framework 4.0, MVC4, C#, ADO.NET, CSS3, ASP.NET, C#, Angular JS, jQuery, DHTML, XSLT, Razor, Ajax, LINQ, SQL Server 2008, SSIS, HTML, JavaScript, Web Services, XML, JSON, CSS, Web API, SQL 2008, IIS 7.5."}
{"text": ""}
{"text": "Louisiana State University, Baton Rouge, LA \t\t\t\t\t     Oct 2012 - June 2014"}
{"text": "Role: .Net Programmer"}
{"text": "The LSU - Public Policy Research Lab is dedicated to quality public policy research through state-of-the-art survey technologies. It helps advance scholarly and practical research while playing a leadership role in state and national public policy development. The lab serves other units on campus, government agencies, non-profits, business and industry. National surveys have resulted in publication in both practical and scholarly journals. The lab’s projects benefit from the multiple disciplines and intellectual assets at LSU. "}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for designing, developing and testing the multi-tier architecture involving the presentation layer, Business component layer and database layer "}
{"text": "Worked with MVC architecture application using Razor view engine and Web API"}
{"text": "Designed & developed web user interface using ASP.net, C#, HTML, CSS, JavaScript, server controls and AJAX Control Toolkit, and developed customized Web User Controls "}
{"text": "Experienced in developing and consuming Web Services and n-tier web applications using ASP.net, C# and ADO.net "}
{"text": "Deployment of WCF web services for online transactions using C# and exposed them through SOAP and HTTP."}
{"text": "Used controls like Update Panel, Accordion control, Calendar Control, Collapsible panel in AJAX control Toolkit to provide a rich and interactive web experience "}
{"text": "Developed Data layer with Entity Framework & LINQ and maintained most of the business rules in the database."}
{"text": "Developed the Meetings layouts using XAML and bounded the objects to the data base using Windows Presentation Foundation (WPF)"}
{"text": "Used Angular js for building the UI as components. "}
{"text": "Developed multi-tiered ASP.NET web applications using C#, HTML5, CSS3."}
{"text": "Worked with Multi-Threading environment Extensively used ADO.net and data objects such as Data Adapter, Data Reader, Data Set, Data Table, Data view to access data from SQL Data sources to Business Objects and updating the changes accordingly to SQL data sources "}
{"text": "Maintained state of the Webpages in using View State and Session Memory objects "}
{"text": "Wrote Stored Procedures, Triggers, Functions and T-SQL Statements to access and manipulate data from SQL Server Database 2008"}
{"text": "Used TFS to collaborate all the team members efforts and for the source code control."}
{"text": "Exported a package with a DLL in it from server 1 and installed it on server 2"}
{"text": "Prototyping and review of the design using Object Oriented Methodology -UML "}
{"text": "Implemented Service Oriented Architecture (SOA) and used WCF to expose business logic as services and consumed those services from client applications. Defined service contracts, implemented service contracts and hosted in IIS 7.0.All service (contracts) configured with secured bindings "}
{"text": "Worked with TFS  for version control "}
{"text": "Worked in Agile development environment and participated in meetings and discussions with department heads, project managers, architects and users "}
{"text": ""}
{"text": "Tax Geeks, Dallas, TX                   \t\t\t\t\t\t\t      Sep 2010 - Sep 2012"}
{"text": "Role: .Net Programmer"}
{"text": "Tax Geeks is a professional Tax services firm, focuses on delivering outstanding customer service and helping clients in reaching their financial goals. In addition to providing clients with a profile of the firm and the services they provide, the website has been designed to become a helpful resource to their valued clients and visitors. Tax Geeks dedication to superior client service has brought them the Internet as they endeavor to provide the highest quality professional service and guidance."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Studied and analyzed the business requirements and transformed them into system inputs."}
{"text": "Designed and developed excellent, user friendly Win Forms using ASP.NET for Investor data collection."}
{"text": "Developed the data layer module using C# which is reusable for data transactions of entire project. In this module extensively used ADO.NET objects like Dataset, Data Adapter, Data Reader, Command, Data Table and Data Relation objects."}
{"text": "Developed business logic using C#, used the developed data layer module extensively for database related transactions."}
{"text": "Designed and developed various complex reports using Crystal Reports and gave option to export to excel and .PDF files."}
{"text": "Developed the necessary stored procedures and created complex views using joins for robust and fast retrieval of data."}
{"text": "Designing & developing web pages with ASP.net, C#, CSS, JavaScript, JQuery, Ajax, Dev express controls."}
{"text": "Extensive utilization of XML, XSLT and CSS for front end development."}
{"text": "Implemented Presentation layer using CSS Framework, Wire-framing, and HTML5."}
{"text": "Developed fast loading images using Adobe Photoshop CS3."}
{"text": "Created XHTML5 Pages with CSS3 and the Box Model."}
{"text": "Wrote Queries and Stored Procedures for integrating database for CRUD operations with databases."}
{"text": "Worked on creating tables, views, triggers, sequences, constraints, Stored Procedures, Functions, and Packages using SQL, and PL/SQL based on the documented user requirements."}
{"text": "Write backend Sql queries, stored procedures and triggers."}
{"text": ""}
{"text": "Environment: IIS7, Windows 2000, .Net Framework 1.1, ASP.NET Win Forms, C# ADO.NET, Visual Studio.Net IDE, Crystal Reports, Visio 2002 and SQL Server 2000."}
{"text": ""}
{"text": "SOURCENXT, Hyderabad, INDIA\t\t\t\t\t                                  Jun 2008 – Aug 2010"}
{"text": "Role: Developer/ Analyst"}
{"text": "SOURCENXT is a startup which is focused on catering quality training services to students and prepare them for the future by giving educational and training needs in the field of Science and Technology. SourceNxt offers services designed to help individuals and organizations harness their full potential through lectures, workshops, seminars and demonstrations. SourceNxt is well equipped and offers services in Ethical hacking and Information Security, Robotics, Android Application Development, Personality development, Time Management, Web Designing, Photography, Stocks and many more. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "User interface was totally designed using Web Server Controls."}
{"text": "Developed the web service to make available the Site Man data to other systems of."}
{"text": "Implemented search of building data, lease information, path information, Engineering projects"}
{"text": "Designed search results control to pull data from database and display in Data Grid."}
{"text": "Involved in Middle Tier development."}
{"text": "Create a synchronization mechanism with packages to sync the data between development, staging and production environment."}
{"text": "Responsible for creating and consuming WCF services to retrieve the data from the database using HTTP protocol."}
{"text": "Working with SQL and relational databases; ODBC, Oracle 8i/9i, 11g, SQL, PL/SQL. "}
{"text": "Used DATA access technologies (SQL Data Provider / ADO.NET)."}
{"text": "Also for data validations used Validation controls in C#.NET & Java script."}
{"text": "Designed a generic data access component to execute Stored Procedure and SQL statements from the Business Layer."}
{"text": "Design and development of credit card transactions and statements module."}
{"text": "Backend database interaction with Oracle 8i."}
{"text": "Administration section for customer support personnel."}
{"text": "Design and development of various stored procedures to Fetch, Update and Insert data."}
{"text": "Design the testing process and unit testing."}
{"text": "Maintained the Site Man Website."}
{"text": ""}
{"text": "Environment:  ASP.NET, HTML, C#.NET, Visual Studio.NET, ADO .NET, .NET Framework, MS SQL Server, JavaScript, JQuery, WCF."}
{"text": ""}
{"text": "Education:"}
{"text": ""}
{"text": "Bachelor of Technology – Computer Science from JNTU, Hyderabad, India."}
{"text": ""}