{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Ho Chi Minh City, Vietnam"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 402825730193"}
{"text": "Professional Summary:"}
{"text": ""}
{"text": "7 Years of experience in Analysis, Design, Development, Testing, Customization, Bug fixes, Enhancement, Support and Implementation of various web, stand-alone, client-server enterprise applications using Python, C, Django, Django Rest Framework in various domains."}
{"text": "Experienced with Object Oriented Programming, Software Development Life Cycle, Database designs, agile methodologies, coding and testing of enterprise applications. "}
{"text": "Experienced in developing web-based applications using Python, Django, XML, CSS, HTML, JavaScript, jQuery. "}
{"text": "Experienced in LAMP (Linux, Apache, MySQL, and Python/PHP) and WAMP (Windows, Apache, MYSQL, and Python/PHP) Architecture."}
{"text": "Skilled in Developing Microservices based on Restful web service using Akka Actors and Akka-Http framework in Scala which handles high concurrency and high volume of traffic."}
{"text": "Experience in configuring and implementing various AWS components such as Elastic IPs, EBS, ElastiCache, Elastic Beanstalk, DynamoDB, Redshift and Cloud Formation. "}
{"text": "Strong Development Skills on Cloud Amazon Web Service (AWS)."}
{"text": "Familiar with JSON based REST Web services and Amazon Web services."}
{"text": "Strong Operational skills on Cloud Services EC2, S3, VPC, Cloud Formation, Cloud Watch, RDS, Dynamo DB, SQS, SNS, API Gateway"}
{"text": "Experience in writing scripts using Gherkin Syntax in Behave framework in Python."}
{"text": "Experienced in writing Sub Queries, Stored Procedures, Triggers, Cursors, Subroutines, functions on SQL .PL/SQL and PostgreSQL database."}
{"text": "Worked on refactoring the code (Struts, JSP and JavaScript) by restructuring it for better performance."}
{"text": "Proficient in Front end development experience using Python 3.6/2.7, Django 1.7/1.8, HTML, XML, CSS, JavaScript, Bootstrap, JQuery, JSON and, Angular.js, Node.js. "}
{"text": "Good knowledge of web services with protocols SOAP, REST and knowledge of server Apache Tomcat, Web logic. "}
{"text": "Implemented user interface guidelines and standards throughout the development and maintenance of the website using the HTML, CSS, JavaScript and JQuery. "}
{"text": "Hands on experience in SVN, Git, JIRA and Bugzilla worked in SQL databases MS SQL, Apache Cassandra, Oracle and MongoDB. "}
{"text": "SQL and PL/SQL programming, developing complex code units, database triggers and using the latest features to optimize performance (Bulk Binds, Materialized views, Inline views, Global Temporary Tables). "}
{"text": "Leveraging queueing architectures with Rabbit MQ for scalability, performance and building."}
{"text": "Proficient in Unit testing/ Test-driven Development (TDD), Load Testing and Integration Testing. "}
{"text": "Experienced in using SVN, Eclipse, Pycharm, Pyscript, Spyder, JIRA and GIT."}
{"text": "Used Ansible and Ansible Tower as Configuration management tool, to automate repetitive tasks, quickly deploys critical applications, and proactively manages change."}
{"text": "Written Python Code using Ansible Python API to Automate Cloud Deployment Process."}
{"text": "Good knowledge in strategy and implementation of AWS technologies such as EC2, S3, and EBS."}
{"text": "Having experience in Agile Methodologies, Scrum stories and sprints experience in a Python based environment, along with data analytics, data wrangling and Excel data extracts. "}
{"text": "Experienced in various types of testing such as Unit testing, Integration testing, User acceptance testing, Functional testing. "}
{"text": "Ability to work on own initiative and as a part of team. Willingness to learn new Technologies, openness to new ideas and ability to learn very quickly."}
{"text": ""}
{"text": "Technical Skills:"}
{"text": "Operating Systems: Unix, Linux, Windows and Mac "}
{"text": "Programming Languages : Java, C, C++, Python 3.6,3.3,/2.7/2.4, Perl, Ruby,"}
{"text": "Scripting Languages : CSS, Java Script, JQuery, Shell Scripting "}
{"text": "Markup languages : HTML, XML, JSON "}
{"text": "Analytics Tools : JMP PRO, SAS, Tableau, UCI NET, Node XL, MVC3 "}
{"text": "Python Libraries : Beautiful Soup, numpy, matplotlib, python-twitter, Pandas data frame, urllib2. "}
{"text": "Databases : Oracle 10/11g, MySQL, SQL Server and PostgreSQL "}
{"text": "Servers : Apache Tomcat, IBM Web sphere, RESTful web services "}
{"text": "Tools : Intellij, PyCharm, FileZilla, PL/SQL Developer, and TOAD "}
{"text": "Integration Tools : Jenkins and Web Builder "}
{"text": "Version Control : GitHub and SVN"}
{"text": "Defect Tracking : JIRA, Git, and VersionOne "}
{"text": "Methodologies & tools : Object Oriented Programming, UML, Agile Scrum "}
{"text": "Cloud Services: AWS, Azure"}
{"text": ""}
{"text": "Education & Certifications:"}
{"text": ""}
{"text": "Ph.D in Information Technology  "}
{"text": ""}
{"text": "Professional Experience:"}
{"text": "\nClient: Fidelity Investments Merrimack NH /     Oct 2018 – Till date "}
{"text": "Role: Sr. Python Developer"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Implemented or exposing the Micro services to base on RESTful API utilizing Spring Boot with Spring MVC and Apache Kafka. Developed Rest API's with python with Django framework, mongo DB for front end team. "}
{"text": "Designed DynamoDB pipeline for routing/storing of email bounce handling records."}
{"text": "Used Pandas API to put the data as time series and tabular format for local timestamp data manipulation and retrieval and storing it into MongoDB."}
{"text": "Created UI Screens for initiation and validation. Design and developing User Interaction screens using HTML5, XHTML, CSS3, JavaScript, Angular-JS, Bootstrap, AJAX, JSON and Gulp. Used PyQuery for selecting particular DOM elements when parsing HTML."}
{"text": "Developed Single Page applications using angular JS2, DHTML, CSS, Semantic UI libraries."}
{"text": "Used Python, Perl, CGI, jQuery, JavaScript and JSON at the front end and experience in Shell Scripting, SQL Server, UNIX and Linux, Open stock. "}
{"text": "Successfully migrated the Django database from SQLite to MySQL to PostgreSQL with complete data integrity. "}
{"text": "Developed various web components for screens using React.JS and used various predefined components from NPM (Node Package Manager)."}
{"text": "Wrote and executed various MySQL database queries from python using Python-MySQL connector and MySQL DB package. "}
{"text": "Used Apache Spark Scala as machine learning language for model creation and predictions using Logistic Regression algorithm. "}
{"text": "Worked on migrating MapReduce programs into Spark transformations using Spark and Scala."}
{"text": "Used Python for data analytics, data wrangling and extracting data using Pandas, Pyexcel, NumPy and SciPy. "}
{"text": "Added support for Amazon AWSS3 and RDS to host static/media files and the database into Amazon Cloud."}
{"text": "Infrastructure as code with Terraform, Packer, Cloudformation, ServerSpec and Ansible to manage AWS infrastructure. "}
{"text": "Responsible for writing/modifying scripts using sh, ksh, and Bash for day-to-day administration."}
{"text": "Experienced in developing Web Services with Python programming language and experienced in MVC frameworks like Django, Flask and Pyramid."}
{"text": "Worked on Setup Git revision control system on Atlassian Bitbucket and local development environments."}
{"text": "Successfully migrated the DynamoDB from PostgreSQL with complete data integrity."}
{"text": "Used Amazon Elastic Beanstalk with Amazon EC2 instance to deploy Django project into AWS. Configured continuous integration with Jenkins on Amazon EC2. "}
{"text": "Worked in team of Architects and Developers to build and deploy Python Django Peewee Linux AWS. Worked in AWS S3 buckets, instances using python boto3. "}
{"text": "Worked on AWS SDK gem, including utilities that initialize local application environments mirroring Beanstalk environments."}
{"text": "Created Lambda functions and python scripts to automate the AWS environments."}
{"text": "Used AWS Cloud Watch for performing Monitoring, customized metrics and file logging and successfully completed the task in using AWS Lambda to manage the servers and run the code in the AWS. "}
{"text": "Used Django evolution and manual SQL modifications was able to modify Django models while retaining all data, while site was in production mode."}
{"text": "Implemented AWS solutions using DynamoDB, EBS, Elastic Load Balancer, Auto scaling groups."}
{"text": "Worked on creating the Docker containers and Docker consoles for managing the application life cycle. "}
{"text": "Setup Docker on Linux and configure Jenkins to run under Docker host. "}
{"text": "Worked closely with designer, tightly integrating Flash into the CMS with the use of Flashvars stored in the Django models. Also created XML with Django to be used by the Flash. "}
{"text": "Implemented SQL Alchemyas ORM mapping tool for complete access and Wrote SQL queries and maintained PostgreSQL RDBMS in the local development environment. "}
{"text": "Used Pandas library for statistical Analysis. "}
{"text": ""}
{"text": "Environment: Python 3.6/2.7, Django 2.0/1.6, Flask, HTML5, CSS, XML, Spark ,Scala Java, JavaScript, Angular JS, Backbone JS, JQuery, CSS Bootstrap, Terraform, Microservices, Mongo DB, MS SQL Server, T-SQL, Eclipse, Git, GitHub, AWS, Linux, Shell Scripting."}
{"text": ""}
{"text": "Client: Petco, Sandiego, CA          /              Aug 2017 – Oct 2018"}
{"text": "Role: Python Developer"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Good experience in developing web applications and implementing Model View Control (MVC) architecture using server side applications like Django and Flask."}
{"text": "Experience in developing views and templates with Python and Django view controller and templating language to create a user-friendly website interface."}
{"text": "Developed views and templates with Python and Django view controller and templating language to create a user-friendly Website interface."}
{"text": "Migrated platform from physical server to virtual environment. Took it from development into production by wiring up a Nginx stack."}
{"text": "Consumed external APIs and wrote RESTful API using Django REST Framework and AngularJs."}
{"text": "Good working experience within the Django ORM or writing native SQL in SQLServer."}
{"text": "Developed Python Script for moving files from dropbox to Amazon server."}
{"text": "Build the pipelines, ran the tests in Jenkins and deployed the application in AWS "}
{"text": "Created API Keys and Usage plans in AWS API Gateways and used the keys across the regions for using the API Gateway"}
{"text": "Developed the notification service by posting the JSON request in AWS API Gateway, Validating the response in Lambda by getting the data from Dynamodb and sending the notification through AWS SNS."}
{"text": "Created AWS Secrets Manager to store the properties across the regions, retrieve the secrets and wrote a shell script to automate the process"}
{"text": "Created AWS kinesis Firehouse and attached it to S3 bucket for having the log information and store that as Event data in the S3 storage bucket"}
{"text": "Written Python Scripts for loading data from CSV files into the database tables."}
{"text": "Documented tasks in Confluence and related them to the JIRA tickets."}
{"text": "Extensive experience in using Python /Perl to code and design various phases for data processing pipeline"}
{"text": "Experience working with version control systems such as Git and Apache SVN for maintaining a consistent state throughout the application development process. "}
{"text": "Involved in database-driven web application development using a variety of frameworks such as Django on Python."}
{"text": "Excellent experience in designing and maintaining complex SQL queries and developing PL/SQL stored procedures."}
{"text": "Followed the best practice of Python such as PEP-8. "}
{"text": "Developed Python scripts to execute Stored Procedures and load data from various forms of csv files into staging tables in SQL Server database."}
{"text": "Involved in back end development using Python with framework Flask "}
{"text": "Developed internal project in Flask to generate report from google analytics on daily, monthly and weekly basis."}
{"text": ""}
{"text": "Environment: Python 3.3, AWS, Flask, Java Script, Matplotlib, HTML, RESTful API, Angular JS, JQuery, JSON, AJAX, XML, CSS, Oracle 10G, SQL, MySQL, Bootstrap, Restful Web Services, Beautiful Soup, Jenkins, GitHub, SVN, Linux, PyCharm."}
{"text": "\nClient: Time Warner Cable, Renton VA              /          Nov 2016 –Aug 2017"}
{"text": "Role: Python Developer"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Developed Views and Templates with Django view controller and template language to create a user-friendly website interface."}
{"text": "Configured the Django admin site, dashboard and created a custom Django dashboard for end users with custom look and feel. Used Django APIs for database access. "}
{"text": "Used Python and Django for XML, JSON processing, data exchange and business logic implementation."}
{"text": "created web-sockets by using Django to get a handle on what we needed to be done on the backend of the applications."}
{"text": "Deployed Application using AWS EC2 Standard Deployment Techniques. "}
{"text": "Built database Model, Views and API's using Python for interactive web based solutions. "}
{"text": "Used Python scripts to update the content in database and manipulate files. "}
{"text": "Created UI using JavaScript and HTML5. Designed and developed data management system using MySQL. "}
{"text": "Worked in MySQL and NoSQL database on simple queries and writing Stored Procedures for normalization and renormalization. "}
{"text": "Worked on Jenkins continuous integration tool for deployment of project. "}
{"text": "Played a key role in a development wide transition from Subversion to Git, which resulted in increase in efficiency for the development community. "}
{"text": "Developed most of the application part in Linux environment and very much familiar with all of its commands. "}
{"text": "Used TKinter to implement GUI for the user to create, modify and view reports based on client data. "}
{"text": "Added support for Amazon AWS S3 and RDS to host static/media files and the database into Amazon Cloud. "}
{"text": " Implemented Restful Web-Services for sending and receiving the data between multiple systems."}
{"text": "Written Cloud formation templates and deployed AWS resources using it."}
{"text": "We used to send text data through we sockets with most APi’s and JSON."}
{"text": "Gained Knowledge on Deploying app using AWS Cloud Formation. "}
{"text": "Used Python Library Beautiful Soup for web-Scrapping. ss. "}
{"text": "Responsible for debugging and troubleshooting the web application."}
{"text": ""}
{"text": "Environment: Python 2.7, Flask, Java Script, Matplotlib, HTML, Angular JS, JQuery, JSON, AJAX, XML, CSS, Oracle 10G, SQL, MySQL, Bootstrap, Restful Web Services, Beautiful Soup, Jenkins, GitHub, SVN, Linux, PyCharm. \u2028"}
{"text": ""}
{"text": "Client: Value Labs / United Airlines, Chicago, IL        /           Sep 2014 – Nov 2016"}
{"text": "Role: Python Developer"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Develop and maintain automated tests using Python and the Robot test framework."}
{"text": "Developed entire frontend and backend modules using Python on Django Web Framework."}
{"text": "Designed and developed the UI using ReactJs, HTML, AJAX, CSS and JavaScript"}
{"text": "Implemented several Socket, TCP/IP, UDP, XMLRPC programs to retrieve data from various data centers."}
{"text": "Built python framework to transform Datasets and Data tables into HTTP-serializable JSON strings."}
{"text": "Used Python in-built libraries urllib2 and beautiful soup modules for web scraping."}
{"text": "Developed Python scripts to store read and write data to CSV files."}
{"text": "Developed scripts to read and dump data to MySQL database."}
{"text": "Worked in Agile and scrum environment which includes daily standup and sprint planning."}
{"text": "Implemented automation script using Crontab in python to run the web crawler."}
{"text": "Used cURL for web scraping contents that cannot be scraped normally."}
{"text": "Wrote python scripts to read and write from csv files to database using Django ORM."}
{"text": "Used R-Analytics for analyzing data and plotting Pie Charts, Bar Charts, Box plots, Histograms, Line Graphs, Scatter plots."}
{"text": "Implemented Google Python Coding Style and PEP-8 while working with various teams."}
{"text": "Built python frameworks using Numpy and Pandas for data analysis."}
{"text": ""}
{"text": "Environment: Python 2.7, Python, Django 1.6, Django REST Framework, Flask, XML, HTTP, Ajax, Bootstrap, JSON, HTML, CSS, jQuery, Pandas, Bugzilla, GITHUB, Java Script, PL/SQL, Microsoft SQL Server, Shell Scripting, Amazon Web Services (AWS)."}
{"text": ""}
{"text": "Client: Merchant Link, Silver Spring, MD,     /      Nov 2012 - Sep 2014"}
{"text": "Role: Python Developer"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Managed datasets using data frames and MySQL, queried MYSQL database queries from python using Python-MySQL connector MySQL dB package to retrieve information. "}
{"text": "Development of real-time multi-tasking systems using Python. "}
{"text": "Designed and developed components using Python with Django framework. Implemented code in python to retrieve and \u2028manipulate data. "}
{"text": "Used Python & Django creating graphics, XML processing of documents, data exchange & business logic implementation \u2028between servers. "}
{"text": "Worked on development of backend services using Python, SQL and Linux. Created many API's for I scrum project which \u2028involves creating and maintaining projects in an organization. and developed UI using HTML, CSS and JavaScript. "}
{"text": "Developed backend services and created many API's using Python Programming Language and SQL. "}
{"text": "Involved in developing a video calling application using python web-sockets. "}
{"text": "Performed research regarding Python Programming and its uses and efficiency. "}
{"text": "Developed GUI screens for XTT & LD application using JSP, HTML and CSS. "}
{"text": "Wrote JavaScript functions to get Dynamic data and Client-side validation. "}
{"text": "Used jQuery to make the frontend components interact with the JavaScript functions to add dynamism to the web pages at \u2028the client side. "}
{"text": "Implemented a Node.js server to manage authentication. "}
{"text": "Created Node.js middleware application server to encapsulate modern JS widget framework Worked with JSON objects and \u2028JavaScript and jQuery intensively to create interactive web pages. "}
{"text": "Implemented web based front-end using HTML, CSS, jQuery, and AngularJS. "}
{"text": "Involved in developing the UI panels using JSF, XHTML, CSS, DOJO and jQuery. "}
{"text": "Set up the deployment environment on Web Logic Developed system preferences UI screens using JSP and HTML. "}
{"text": "Created a Rich Single Page Application using HTML, CSS, Angularjs, JQuery and REST Services. "}
{"text": "Designed and implemented UI layer using JSP, JavaScript, HTML, DHTML, JSON, XML, XHTML, XSL, XSLT, XSL-FO. "}
{"text": "Used Backbonejs, Node.js, Bootstrap and other javascript libraries to create intuitive and rich Single Page Applications. "}
{"text": "Used JQuery JavaScript libraries for providing richer user interface and facilitates asynchronous request invocations using \u2028AJAX. "}
{"text": "Developed Dash-Board to monitor and report Cache Coherence Servers. "}
{"text": "Prepared statements are used for communication Sql database. "}
{"text": "Involved in Requirement analysis, design and Implementation applying the Water fall model."}
{"text": ""}
{"text": "Environment: Python, Django, HTML, CSS, JavaScript, Ajax, JSON, jQuery, MySQL, TOAD, SQL, DB2, Apache Axis, WSDL, NetBeans, JBOSS, Mercurial, Coherence, ClearCase, Selenium, Water Fall Model, UML, JSP, Servlet, Ant, XML, Jira, Swing, Congo’s."}
{"text": ""}
{"text": ""}