{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Chengdu, China"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 748492861139"}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": ""}
{"text": "Over 7+ years of working experience in software quality assurance in Finance industry."}
{"text": "Exposure to all aspects of testing in Manual and Automated environment."}
{"text": "Expertise in writing good Test Plans, Test Cases and Test Scripts for manual/automatedtesting environment for multiple operating systems i.e. Windows and UNIX"}
{"text": "Excellent knowledge of SDLC (Agile/Waterfall) and its phases."}
{"text": "Excellent working knowledge of various tools processes and workflows in the Finance Industry like stock and bonds.Understanding the long-term business objectives and suggesting technical strategies to meet those objectives; introducing innovation to business processes through technology."}
{"text": "Comprehensive experience in implementing control self-assessment processes "}
{"text": "Excellent knowledge of SOX Compliance and s.404 testing "}
{"text": "Skilled in identifying risks & controls, & developing audit tests of controls "}
{"text": "Excellent skills in the efficient use of Microsoft Excel and Word software"}
{"text": "Extensive working knowledge of different kinds of testing like Front-end & Backend Testing, Positive/Negative Testing, Black Box Testing, Configuration Testing, Data Driven Testing, User Acceptance Testing (UAT) and Regression Testing, Integration Testing and System Testing."}
{"text": "Expertise in using Automated Testing tools like Load Runner, QTP and experienced in reporting bugs using Bug tracking tools such as Quality center"}
{"text": "Extensive experience in Client/server database programming both in Oracle and SQL Server."}
{"text": "Expertise in Performance Testing, Stress Testing, Load Testing and Volume Testing of client server and web based applications using different tools."}
{"text": "Extensive knowledge of Requirements Traceability Matrix and Gap Analysis."}
{"text": "Command on writing SQL queries to perform Backend Testing on databases."}
{"text": "Strong communication skills/presentation skills and a complete team player."}
{"text": "Worked closely with the project manager to estimate best/worst case scenarios, track progress with weekly estimates of remaining work to do, conducting informal meetings ad hoc and as needed."}
{"text": "TECHNICAL SKILLS"}
{"text": "Testing Tools\t\tQTP/HP Quality Center, Soap UI pro,Rational Clear Quest          SOAPUI.\t"}
{"text": "Languages\t\t\t\tVB Script, SQL, HTML & XML"}
{"text": "Documentation\t\t\tMS Office & Adobe Tools"}
{"text": "Operating Systems\t\t\tLinux, Windows NT/2000/XP/Vista/Windows 7"}
{"text": "Methodology\t\t\t\tAgile (SCRUM) and water fall"}
{"text": ""}
{"text": "TD Bank, Cherry Hill, New JerseyJun2015 to Sep 2017"}
{"text": "Manual QA Tester"}
{"text": "\nWorked as a Sr. Manual Tester for TD Bank, which is one of the nation's leading Banking. As a Senior Manual Tester I worked on multiple projects focusing on key operational, accounting, and financial reporting controls within the assigned areas and scope for SOX reviews. As a QA tester I conducted manual functional testing for the SOX based projects along with backend, GUI and UAT testing."}
{"text": "Responsibilities:\t"}
{"text": "Involved in creating Test Plans for the different aspects of the project according to the business specifications in coordination with the QA lead and project manager"}
{"text": "Responsible for reviewing business requirements, functional specifications, project schedules, documentation and test plans.  "}
{"text": "Scripted test cases for component and UAT using HP Quality Center."}
{"text": "Identified key controls, assessed controls for design deficiencies, and updated process."}
{"text": "Scheduled testing of operating effectiveness in compliance with tests plans."}
{"text": "Detected operating deficiencies and proposed ways to remediate control failures."}
{"text": "Identified mitigating controls to minimize risk exposures."}
{"text": "Participated in the implementation of new processes and corrective action plans to ensure SOX compliance."}
{"text": "Performed UAT, Positive, Negative and Boundary testing using the approved test cases."}
{"text": "Involved in creating test cases for regression testing and assist test lead during the testing activities."}
{"text": "Analyze the requirement coverage and traceability to ensure the testing coverage."}
{"text": "Coordinate with QA team to manage and update the missing parameters of test cases and defects in QC."}
{"text": "Assisted Testing team in conducting Mainframe Testing. "}
{"text": "Performed Manual Testing to test the usability of the application."}
{"text": "Conducted GUI testing to test the appearance and properties manually. ."}
{"text": "Verified the web services for its functionality, reliability, scalability using SOAPUI web services test automation tool."}
{"text": "Performed back-end testing using SQL queries to validate data and perform Data integrity testing."}
{"text": "Analysis the testing activities as per the planned forecast for the given projects."}
{"text": "Analysis the Weekly QA Metrics Reports for to correct the reporting errors."}
{"text": "Tested each web services using SOAP messages"}
{"text": "Conducted User Acceptance Testing (UAT)."}
{"text": "Supported User acceptance testing (UAT) in preparing the test scripts and test execution. "}
{"text": "Documented and reported bugs using Quality Center."}
{"text": "Environment: Quality Center/ALM, Oracle, Solaris Mainframe, SQL, SOAPUI, HTML,TSYS, Windows."}
{"text": "National city Bank, Cleveland, OHAug 2013 to May 2015Manual QA Analyst"}
{"text": "National City is the diversified financial holding company, and one of the major financial services company in the Midwest America. Its subsidiaries provide financial services for corporate and small banking and treasury management, personal banking, investment services, mortgage, and insurance services. I was involved in the web-based application OTS (Online Transaction System). This application was developed for online transactions like accessing personal accounts, checking balances, loan rates, payment of bills, transfer of funds between its customers and between its bank and other institutions."}
{"text": "Responsibilities:"}
{"text": "Worked closely with Business Analysts and Developers to gather requirements in order to formulate the test plan."}
{"text": "Performed Black Box Testing of the application to better understand the functionality of the application."}
{"text": "Prepared Test cases according to the requirement."}
{"text": "Executed the design reviews and test plans in a timely manner."}
{"text": "Executed test plans at assigned locations."}
{"text": "Documented work as per established practices and SOX standards."}
{"text": "Prepared detailed findings for review with appropriate management personnel."}
{"text": "Submitted status reports to compliance executive on time."}
{"text": "Ensured to communicate SOX testing results to the appropriate authority."}
{"text": "Involved in creating test strategies, status reports and test timelines that clearly communicate to business owners the history of UAT testing activities and results."}
{"text": "Defined the Scope of testing for User Acceptance Testing. Developed detailed test conditions. Supported documentation across extended testing team as directed by UAT Manger."}
{"text": "Created test plan and test cases for back end testing from the business requirement."}
{"text": "Created and executed SQL queries using Relational Database."}
{"text": "Used HP Quality Center to execute the test cases, track execution against the plan during testing and manage defects from inception to resolution."}
{"text": "Assisted the business analysis team in preparing the Functional Specifications document"}
{"text": "Prepared Test Plans and Test Cases based on the business requirements"}
{"text": "Performed Functionality Testing of the application manually"}
{"text": "Performed SOA / Web Service testing using SOAPUI."}
{"text": "Involved in Back End testing using SQL Queries on Oracle Database"}
{"text": "Performed Security Testing by writing using Positive and Negative Testing approach to ensure appropriate user authentication"}
{"text": "Performed Regression Testing after the defects have been fixed to ensure no further effect on other functionalities."}
{"text": "Participated in Walkthroughs and Inspection meetings to review "}
{"text": ""}
{"text": "Environment: Quality Center, Oracle 9i, Windows,Mainframe, 98/2000/XP, HTML, SQL, SOAP UI, Clear Quest, UNIX.\n"}
{"text": "PNC Bank. Louis, MOSep 2011 to July 2013"}
{"text": "Manual QA Tester"}
{"text": "PNC bank is a leading financial service provider. PNC bank provides their customers, mortgages and other financial services at the most competitive rates. They developed an in-house application, which maintained the information about the mortgage rates and other related information limited to the company only. "}
{"text": "Responsibilities:"}
{"text": "Developed detailed test plans and test cases, entrance and exit criteria for the application being tested and ensured that standards for documentation were followed."}
{"text": "Perform Regression Testing manually."}
{"text": "Participated in requirement walkthroughs and creation of test plan."}
{"text": "Maintained various versions of Test Scripts."}
{"text": "Modification of existing Test Plans and Test Scripts for regression testing."}
{"text": "Created and maintained the Requirements Traceability Matrix and Test Matrix."}
{"text": "Worked with Project Management to scope the testing effort and provide status and estimates."}
{"text": "Conducted manual functionality and regression testing for each build and version"}
{"text": "Performed Black box testing, System testing, Regression Testing."}
{"text": "Performed negative and positive testing for the application."}
{"text": "Implemented whole life cycle of QA methodologies starting from planning, capturing, creating, tracking the defects using Quality Center."}
{"text": ""}
{"text": "Environment: Oracle, UNIX, QTP, Quality Center, SOAP UI"}
{"text": ""}
{"text": "HSBC Bank Buffalo, New York                                                                 Aug 2010 to Aug 2011"}
{"text": "QA Analyst"}
{"text": "HSBC Bank is one of the leading financial services institutes in the United States that is headquartered in New York City. It offers various services including banking, Home Loans, Insurance, Mortgaging and investments. My project involved testing of their Mortgage and Home Equity Application Page on their website. The customers can apply for a loan by filling out an application or receive mortgage quotes based on their requirements."}
{"text": "Responsibilities:"}
{"text": "Formulated detailed Test Plan, Test Cases and Testing Procedures, which included Test Cases/Scripts, capturing Test Results and capturing and resolving Test Anomalies."}
{"text": "Conducted Manual Testing for checking the flow of the application functionality."}
{"text": "Performed Configuration and Graphical User interface testing manually."}
{"text": "Created and Maintained SQL queries to extract data from the database for Back End Testing."}
{"text": "Ensure that products and changes are fully documented."}
{"text": "Analyzing and documenting detailed program information working and interacting with software developers and members of various other dependent departments"}
{"text": "Performed Sanity and Smoke testing."}
{"text": "Performed Positive and Negative Testing"}
{"text": "Conducted Data validation testing using SQL queries"}
{"text": "Performed Security testing and System testing"}
{"text": "Participated in conducting System testing and End to End testing "}
{"text": "Participated and supported UAT Testing"}
{"text": "Performed Regression Testing in the application after the bugs have been fixed."}
{"text": "Conducted defect management using Quality Center."}
{"text": ""}
{"text": "Environment: Windows/UNIX, MS SQL Server, QC, Windows."}
{"text": ""}