{"text": "Name: alice alice"}
{"text": "E-Mail: alice.alice@gmail.com"}
{"text": "Address: Chennai, India"}
{"text": "Github: https://github.com/alice"}
{"text": "LinkedIn: https://linkedin.com/alice"}
{"text": "Phone No. 875985718949"}
{"text": "                                                                                                                                "}
{"text": ""}
{"text": "SUMMARY OF QUALIFICATIONS"}
{"text": "Over 15  years of  IT Helpdesk Customer Service and ticketing"}
{"text": "Over 21 years of Mainframe Computer Operations / Data Processing ;"}
{"text": "Certified Public Manager Level III-obtained by the Mississippi State Personnel Board"}
{"text": "5+ years leading and supervising a Computer Operations/Data Processing  team;"}
{"text": "5+ years of writing technical policies and procedures for day to day operations and updating Disaster Recovery processes; "}
{"text": "5+ years of Telecom Coordination, acting as single point of contact for the Avaya Voice Services Phone System; Overseeing all Telecommunications and coordination of telephones, voice services, and long distance activities within an agency. "}
{"text": "Strong computer skills using MS office products;"}
{"text": "Outstanding Analytical skills and ability to problem solve and prioritize with little guidance"}
{"text": "Skilled in gathering, analyzing and interpreting information."}
{"text": "Skilled in establishing priorities, training, hiring, and coordinating work activities."}
{"text": ""}
{"text": "      "}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Bachelor of Business Administration in Management"}
{"text": "Jackson State University’s School of Business AACSB Accredited"}
{"text": ""}
{"text": "Work Experience"}
{"text": ""}
{"text": "US Tech Solutions for Ricoh @ USMD Holdings"}
{"text": "(North Richland Hills, TX)                                                                                                  March 2018 to Present"}
{"text": "Print Fleet Manager- Contractor"}
{"text": "Act as single point of contact between Ricoh and the customer;\n"}
{"text": "Review invoicing and ensure accuracy;\nMonitor Equipment Leases;"}
{"text": "Develop and maintain reports to meet individual customer needs including but not limited to: Department charge-backs, Utilization percentages, Cost reductions, Commitment Action Document (CAD) etc. "}
{"text": "Optimize fleet productivity and equipment up-time. "}
{"text": "Coordinate month end meter reads."}
{"text": "Optimize fleet productivity;"}
{"text": ""}
{"text": "Tarrant County Department of Information Technology via Open Systems Technologies                           (Fort Worth, Texas) "}
{"text": "CA-7 Mainframe Computer Operator- Contractor\t                  November 2016  to  Present"}
{"text": "Process, release, and schedule mainframe batch jobs via TSO/CA-7 scheduler; "}
{"text": "Use of  SysView, Netview,   SYSD and SDSF"}
{"text": "Use of Service Now  ticketing system;   Provides Help Desk support after normal duty hours"}
{"text": "Use of OnBase, Networker, MVS System, JES, TSO, and SYSD commands;"}
{"text": "ADIC Tape backup and offsite management"}
{"text": "MICR printing of checks for DA, County Clerk, Hot Checks and Child Support"}
{"text": "Use of VINE SFTP Application and What’s Up Gold"}
{"text": "Develop database and maintain a job log for assigned projects; Trouble-shoot production files;"}
{"text": " Processes, prints, and break down printed output for distribution\n Provides Help Desk support after normal duty hours\n\nAmazon.Com                                                                                                                           (Irving, Texas) "}
{"text": "Fulfillment Associate\t  \t\t                                                November 2016 to January 2017"}
{"text": "Accurately receive and stage received items to proper areas \nPut away to correct location and verify expected item and quantity \nPick items and quantities from designated location\nNotify lead of any shortages or product quality issues"}
{"text": "Use of a hand-held mobile computer/scanner"}
{"text": "Package and ship in accordance with packaging guidelines and accepted methods/practices "}
{"text": ""}
{"text": "Walmart Supercenter                                                                                                       (Cedar Hill, Texas) "}
{"text": "Front End Cashier\t  \t\t                                                           August 2015 to Feb. 2016"}
{"text": "Greeted customers, Scanned items and ensured pricing was correct."}
{"text": "Took coupons and scan correctly, Take money in the form of cash, credit card, or check."}
{"text": "Took food stamps or WIC coupons, Dispense correct change,  change receipt paper as needed"}
{"text": "Ask for one or two forms of ID to confirm identity."}
{"text": "Cashed checks and provided change, validated checks.  Issued receipts, refunds, and credits."}
{"text": "Counted money in cash drawers at the beginning of shifts to ensure that amounts were correct and that there was adequate change."}
{"text": "Resolved amount discrepancies, processed returns and checked to see if items were damaged;"}
{"text": "Weighed items, Bagged items carefully. Cleaned up checkout area with damp cloth and disinfectant."}
{"text": "Established or identified prices of goods, services or admission, and tabulated bills using calculators, cash registers, or optical price scanners."}
{"text": "Sold liquor, lottery tickets, and cigarettes, answered customers' questions;"}
{"text": ""}
{"text": "Office Depot –Darby Day Staffing                                                                             (Grand Prairie, Texas) "}
{"text": "Production Print Operator\t  \t\t                                                April 2015 to Oct. 2015"}
{"text": "Printed various forms using Xerox Docu-Print 500 and Docu-Print 100/100MX"}
{"text": "Processed and produced signs and graphics print/finish orders as requested; "}
{"text": "Ran high volume copy machines and performed binding and finishing work."}
{"text": "Reviewed online print requests, Operated Xerox Nuvera 120 EA, Xerox Nuvera 144 Production System,  Xerox 6155, Xerox Nuvera 120 MICR, Xerox Nuvera 314 EA, Xerox Docu Print 550,  and Xerox Production 800/1000i Color printers;   "}
{"text": "Monitored printing and production services for the Southeast Regional Offices"}
{"text": "Develop database and maintain a job log for assigned projects; Trouble-shoot production files;"}
{"text": "Performed pre-flight digital file preparations and originals clean up; Create and implement an accountability system for each phase of the production schedule to insure the timely completion and availability of projects;"}
{"text": "Ensured copiers were working properly, checked for quality via daily inspections. Cleared paper jams and informed technicians of specific problems."}
{"text": "Maintained records for management reports and inventories of supplies needed."}
{"text": "Delivered completed jobs to pre-determined locations within and outside of the site."}
{"text": "Maintains daily meter and service logs."}
{"text": "Ensures upkeep of convenience copier areas by keeping neat and well stocked."}
{"text": "Performs duties related to the shipping of materials."}
{"text": ""}
{"text": ""}
{"text": "Alcon Laboratories/ Novartis - Source One Technical Solutions                           (Fort Worth, Texas) "}
{"text": "IT Analyst-Contractor\t  \t\t                                                      October 2013 to Jan 2014"}
{"text": "NOC monitoring"}
{"text": "Monitored  Control-M Global Computer Command Center  for any alerts/failures"}
{"text": "Escalated  job abends to application support team as per ABEND documentation."}
{"text": "Performed temporary and permanent ControlM job set up changes and submissions in AJF and Desktop."}
{"text": "AS400/iSeries:"}
{"text": "Monitored and acted on alerts/failures reported via AS400 MPLUS"}
{"text": "Monitored and restarted TSM backup jobs running on Wintel and AIX platforms"}
{"text": "Monitored, coordinated responded, and troubleshot Infrastructure Alerts;"}
{"text": "Performed stops and starts on Server services"}
{"text": "Monitored Remedy queues and dispatched GCC Incidents"}
{"text": "Supported facility change requests;  Supported global notification process during outages."}
{"text": ""}
{"text": "Public Employees Retirement System of Mississippi                                                (Jackson, Mississippi) \t"}
{"text": "Lead System Operator- MIS Operations Supervisor\t  \t\t  July 2007 to March 2013                                      "}
{"text": "Provided Computer Operations Support including: running of Nightly Batch jobs, printing of payroll checks, daily refund checks, daily 1099r's, annual 1099r's and other agency forms; maintain forms and toner inventory;"}
{"text": "atch scheduling of all daily, weekly, monthly, and annual production jobs; "}
{"text": "Established and maintained standards and procedures to maximize operations responses to encountered incidents to minimize service availability interruptions."}
{"text": "Reviewed incident data to analyze assigned problems.  Prioritized  and classified all issues and problems; "}
{"text": "Investigated assigned problems through to resolution or root cause.  "}
{"text": "On call on a 24x7 basis in support of all operations"}
{"text": "Coordinated the actions of others as necessary to assist with the analysis and resolution actions for problems and known errors.  "}
{"text": "Monitored batch cycle performance to meet the scheduled production requirements."}
{"text": "Executed Baselines-code deployments, system refreshes and recycles;"}
{"text": "Monitored,  Coordinated/scheduled all  MIS Helpdesk activities, responded to user requests and trouble tickets; troubleshot problems related to users’ accounts (consisting of Windows / Novell, Outlook, Internet, VPN, mainframe, Active Directory, etc) ; Assisted users and clients with inquiries and problem calls on report viewing, printed related issues and other problems. Managed payroll processing team; worked closely with other service delivery departments for Client Services, Technical Services, and Payroll Production to deliver quality, accuracy, and timeliness in the payroll process.  Reconciled Monthly payroll and daily refund discrepancies."}
{"text": "\tPerformed procedures for backup, recovery, and archival of files stored on the network. Assisted in maintaining the operating system and security software utilized on the network"}
{"text": "\tDeveloped priorities, planned and followed-up on practices for systems and processes. "}
{"text": "\tDevised or modified procedures to solve complex problems considering computer equipment capacity and limitations, operation time, and form of desired results."}
{"text": "\tPerformed as Telecom Coordinator- responsible for the agency’s Avaya Voice Services- Communication System; Set up user telephone access, long distance codes, voicemail, name display etc.; Worked with call center managers to trouble-shot CMS software;"}
{"text": "\tCreated, maintained, and updated MIS documentation. Assisted systems programmers in implementation changes to the O/S"}
{"text": "\tTested, Maintained and updated Disaster Recovery Procedures"}
{"text": "\tScheduled, Conducted and Participated in conferences and meetings, working with business units on projects, and upgrades (such as RFP’s and IDP sessions);  Assisted in product evaluations of upgraded or new hardware and software and identified strengths, weaknesses, and potential benefits to the agency"}
{"text": "\tPerformed QA & QA testing of MIS processes and procedures;"}
{"text": ""}
{"text": "U.S. FoodService Inc. Formerly- PYA Monarch Inc.                                       (Jackson, Mississippi)"}
{"text": "Data Processing Coordinator/Computer Operator                                     October 2000 to July 2007"}
{"text": "Responsible for all Data Processing Transactions for 2nd Shift; "}
{"text": "Monitored all system activity via TSO, CA-7. Autosys,  Performed IPLs;"}
{"text": "Monitored / escalated client server alerts (UNIX, Intel, NetBackup, Exchange environment) and "}
{"text": "Batch processing abends. "}
{"text": "Served as backup in Network Operations (supported modems, routers, switches, etc.)"}
{"text": "Answer Incoming calls and resolve driver, sales representatives and customer issues as needed. "}
{"text": "Populating/creating/updating various spreadsheets/departmental reports."}
{"text": "Schedules processing and prints picking documentation (labels/split case documents). "}
{"text": "Assists Function Manager in supporting desktop users, hardware maintenance, and LAN maintenance. Configures, maintains PC workstations; troubleshoots, performs support functions for systems users; "}
{"text": "Process driver trip sheets. - Collect payments (COD Collections)"}
{"text": "Tracking and filing of Driver Vehicle Inspection Reports (DVIR5)."}
{"text": "Order office supplies. - General clerical duties as assigned"}
{"text": "Created / updated Virtual Tech problem tickets. Created and maintained documentation. "}
{"text": "Printed driver truck manifest and warehouse shipping labels. "}
{"text": "Documented problems/added issues in shift logs. "}
{"text": "Assisted/trained other operators when needed."}
{"text": "Systems/Software/Applications Used"}
{"text": "Proficient with Microsoft Office Suite 2010, 2007, and 2003;  Microsoft Access 2007, 2003"}
{"text": "Microsoft Operating Systems-Windows 8.1, Windows 7, Windows Vista, Windows XP, Windows 2000, Windows NT, 2003, Novell, Server/Exchange, Windows domain networking,  and remote access software( Dame Ware Mini Remote) VPN;  IBM Mainframe OS/390, AIX, Unix"}
{"text": "MS SQL,  Active Directory, Internet Explorer, Filezilla, FTP, Zendesk, Remedy, Tivoli,  Merant Tracker, Vinsoft’s ECS production job scheduler, TSO/ISPF, SQL Query Analyzer,  CICS,  MS Outlook, Forte Application Environment, Forte Conductor, SQL, Foxpro, Oracle, Microsoft Access 2003 and 2007"}
{"text": "HP Storage Works-Cybernetics; "}
{"text": "TCP/IP network addressing and data delivery"}
{"text": "Comp TIA Network +, and Security + procedures "}
{"text": " Extensive experience with PC and mainframe computer operations systems;"}
{"text": "LAN/WAN, TCP/IP, VPN (SSL, L2TP/IPSec,SSTP, PPTP)"}
{"text": "Configured and Implemented different Networks (Ethernet and Wireless 802.11/b/g/n)"}
{"text": "Configured Cisco Switches and Routers"}
{"text": "Configured and Install different Servers (Windows 2003/2008/2012) with various services:"}
{"text": ""}
{"text": "PROFESSIONAL TRAINING"}
{"text": "\tState of Mississippi’s Certified Public Manger Program Levels  I, II, and III,  Basic Supervisory Program,  SQL Querying Levels I, and II, Microsoft Excel Levels I, II and III, PERS PLUS Management Training;  Communications and Diversity Training for Managers; Quality Assurance Management for IT Members;  Mind-leaders ON-Line Training for Technical and Business Class Leaders; Oracle 11g"}
{"text": ""}