{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Tianjin, China"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 180763811779"}
{"text": "SUMMARY:"}
{"text": "6 years’ experience as a Business Analyst in the HealthCare domain."}
{"text": "Specific expertise in Business Analysis, GAP Analysis, Data Analysis, Business Rules and developing and creating business process documents."}
{"text": "In depth knowledge and hands on experience working with SDLC methodologies like waterfall, RUP, Scrum, and Agile."}
{"text": "Expertise and experience in preparing Business Requirement Documents, Use Case specifications and functional specifications."}
{"text": "Good knowledge of important and frequently used UML diagrams such as use case Diagram/template Activity Diagrams and Sequence Diagrams."}
{"text": "Experience in using Joint Requirement Planning (JRP) and Joint Application Deployment (JAD) sessions for gathering requirements and brainstorm ideas."}
{"text": "Extensively worked with HTML, creating and developing websites."}
{"text": "Managed internal projects improving project planning, resource management, and time billing using MS project, Share point, Visio, CA clarity, Team Track and IQ Navigator for prototyping and process simplification."}
{"text": "An excellent knowledge of ICD-9 and ICD-10 structures and formats."}
{"text": "Have excellent knowledge in insurance products like HMO, PPO, POS and HIPPA and Regulations."}
{"text": "Well experienced with the complex tasks of ICD 9 to ICD 10 conversion and mapping."}
{"text": "Strong understanding of EDI claims, Member Enrollment, Eligibility, and HIPPA 5010 standards "}
{"text": "Knowledge of different modules within Healthcare Claims Adjudication Process (Membership process, billing process and enrollment & claims process)."}
{"text": "Strong expertise in Health Insurance Claim process, social services, Medicaid."}
{"text": "Experience in the Data Analysis and Testing of Data Warehousing using data Conversions, Data Extraction, Data Transformation and Data Loading (ETL)"}
{"text": "Experience with HIPPA compliance in the healthcare systems."}
{"text": "Experience providing analysis for business process running on EDI (Electronic Data Interchange) standard."}
{"text": "Expertise in impact analysis on the key application systems (claims processing, reporting, payments) and business process of health insurance companies."}
{"text": "Excellent working knowledge of requirement management tools like Microsoft SharePoint."}
{"text": "Excellent presentation and communication skills can act as an excellent mediator between business & technical teams."}
{"text": "Experience with handling and coordinating UAT."}
{"text": ""}
{"text": "Technical Expertise:"}
{"text": "Project methodologies: SDLC, RUP, UML, Agile, Waterfall,"}
{"text": "Business Modeling Tools: Microsoft Visio, Rational Rose"}
{"text": "Platforms: Windows, UNIX, Sun Solaris, IBM AIX"}
{"text": "Defect Tracking Tools: Rational Clear Quest, Quality Center, HP Application Life Cycle Management, Clear case, win runner, Mercury Quality Center"}
{"text": "Change Management Tools: Rational Clear Quest"}
{"text": "Office tools: MS project, MS office, MS Visio"}
{"text": "Business Applications: MS office 2013 (Word, Excel, PowerPoint, Outlook), Adobe Acrobat, MS visio, MS"}
{"text": "Database: Project, Data warehouse, Business Objects, Business Intelligence, MS SQL Server, MS Access, and Oracle"}
{"text": ""}
{"text": "Professional Experience"}
{"text": ""}
{"text": "State Farm, Billings, MT                                                                                                         Jan 2017-present"}
{"text": "Business System Analyst"}
{"text": "State farm is a provider of insurance products and related services in North America and selects worldwide markets. It is a brand name for a family of health insurance products focused on providing a variety of affordable plan choices to consumers. The portfolio of health care products includes major medical, supplemental and fixed-benefit plans for individuals, families and small employers. Also integrate the Medicare (Part A, Part B, Part C, Part D) data all in one single system for a smooth flow through the claims processing system."}
{"text": "Responsibilities:"}
{"text": "Performed a project analysis on new projects, including requirements, personnel, and costs."}
{"text": "Developed and maintained work plan for system projects."}
{"text": "Facilitate daily scrum, sprint planning and sprint retrospectives meeting."}
{"text": "Worked on release on multiple sprints after successful completion of sprints."}
{"text": "Met with supervisors and business users and defined the scope of the project, gathered business requirements, and conducted gap analysis."}
{"text": "Managing and Billing Medicare, Commercial HMO/PPO claims on a daily basis."}
{"text": "Involved in the documentation of extraction, of the data from various tables in the Data warehouse."}
{"text": "Worked closely with Business Team, SME’s, Infrastructure team, and coordinated with offshore team."}
{"text": "Expertise in claims, subscriber/Member, Plan/Product, claims, Provider, Commissions and billing Modules of Facets."}
{"text": "Participated in creating Facets data model."}
{"text": "Worked on the EDI 834-file load to Facets through MMS (Membership maintenance sub-system)"}
{"text": "Worked with providers and Medicare or Medicaid entities to validate EDI transaction sets or internet portals."}
{"text": "Worked on ICD 10 with respect to the claims related to Medicare ( Part A, Part B, Part C, Part D)"}
{"text": "Work with solutions/ delivery teams to implement data quality processes during acquisition, ETL, and delivery stages for Business Intelligence solutions and changes to Data Warehouses "}
{"text": "Worked on the MMS (Medicaid Management Information Systems)."}
{"text": "Designed claims Inquiry screen within the MMIS and executed Testing Scenarios, cases and conditions involving user acceptance testing, Regression, Integration and system testing "}
{"text": "Wrote BRD’s for 834(member Eligibility), providers file and claims tracking system, use-case Narratives including business process workflow diagrams and Requirement Traceability based on any of the projects need."}
{"text": "Worked on Business requirement for payer information in geographical area and contact payers to facilitate contacting."}
{"text": "Documented and gathered Functional specifications for 837 (claims), 278 (Authorizations) and 270/271 (Eligibility and Benefit Response)"}
{"text": "Conducted Requirements Walk-Thru JAD sessions and resolved all issues/findings."}
{"text": "Lead & facilitated numerous meetings to help answer any question on requirements during design, Development, Testing and Implementation phase."}
{"text": "Organized brainstorming and JAD sessions with stake holders, business users, technical teams, testing team to analyze and validate the business requirements, system life cycle and explained the key performance indicators and documented and specifications."}
{"text": "Created Use Case diagrams by analyzing by analyzing the business process followed by Activity diagrams using MS-Visio and participate in production of HIPPA 5010 EDI Test data."}
{"text": "Developed use case designed process flow diagrams using Ms-Visio and Business context Diagram."}
{"text": "Environment: Agile, UAT, MS office (MS word, MS Excel, MS PowerPoint, MS Visio), MMIS, HP ALM, SQL Server."}
{"text": ""}
{"text": "Well care, Atlanta                                                                                                                          Aug 2014- Dec 2016"}
{"text": "Business system analyst"}
{"text": "Well care is a Medicare and Medicaid advantage organization. Medicare part D project involved the expansion of Benecard services to function as PBM for various part D sponsors. The project involved implementation of various processes required to perform a PBM functions as per CMS guidelines and nbusiness rules. I worked on claim adjudication module."}
{"text": "MTM project dealt with the development of a secure web portal to enable the authorized user to have access to patient’s profile and perform the MTM function. This project involved implementation of different process such as claim feed, enrollment data feed, prescriber data feed, Eligibility check process, patient case routing, clinical rule engine, Billing and reporting."}
{"text": "Responsibilities :"}
{"text": "Review CMS guidelines around Medicare part D claim adjudication, PDE reporting, MTM program and facilitated JAD sessions, meetings with stakeholders to licit the business requirements."}
{"text": "Created BRD, process flow diagrams, Use cases for pharmacy claim adjudication, PDE reporting and MTM program."}
{"text": "Provide required assistance to testing team by giving them requirement walkthrough and address any questions."}
{"text": "Performed GUI testing, Integration testing, Regression testing, Ad-hoc testing, Negative testing, End to End testing and logged defects into the Mantis bug tracking tool."}
{"text": "Validating NCPDP claims and 834 file."}
{"text": "Responsible for validating the UAT or PROD defects submitted by business, creating Tickets and assigning it to the development team for fix."}
{"text": "Monitored defects using Mantis BT and ensured that the timelines for bug fixation are et."}
{"text": "Wrong SQL queries to produce various day t day reports as requested by business."}
{"text": "Created data mapping document."}
{"text": "Actively participated in CMS audit."}
{"text": "Environment: MS office 2013 (Word, Excel, PowerPoint, Outlook), Adobe Acrobat, MS Visio, MS"}
{"text": ""}
{"text": "Oklahoma Health Care Exchange LLC   Pittsburg County, OK                                                                 DEC 2012- July 2014"}
{"text": "Business Analyst"}
{"text": "The project was based on the transition from mainframe based legacy system to a new enterprise open systems-based solution. Adhered to strict compliance, policies and regulations and configured facets modules such as claims, membership, benefit and plan. I was involved in migrating application functionality and converting data. I supported migration of ICD 9- CM (Clinical Modification) to ICD-10-CM/PCS (Clinical modification/ procedure coding system)."}
{"text": "Responsibilities:"}
{"text": "Conducted meetings with business process owners, SME (subject matter experts) and trading partners for requirement gathering during the definition stage."}
{"text": "Involved in FACETS implementation, testing, involved end to end testing "}
{"text": "FACETS Billing, Claim Processing and subscriber/Member module"}
{"text": "Analyzed data/workflows and defined the scope"}
{"text": "Analyzed the data movement between systems to validate the business requirements."}
{"text": "Worked on data mapping to bring data from one system and reside in another system."}
{"text": "Ensured that EDI files where in compliance with new ICD-10 standards."}
{"text": "Carried out forward backward mapping when necessary."}
{"text": "Submitted claims to insurances and processed payment from insurance companies."}
{"text": "Subscriber/Member module."}
{"text": "Prepared documents such as project scope, project Vision, Project Success, Business Requirements, Functional Specification, Data Warehouse Process Flow (SQL queries and Crystal Reports) using MS Office (Word, Excel, Visio) and dashboards"}
{"text": "Interacted with DBA for the process of data extraction, data transformation, data load, data integration and conversion processes using business intelligence tools on the benefit plan functionality."}
{"text": "Validating the site for HTML syntax errors and defects for website functionality."}
{"text": "Created use Cases and maintained the traceability matrix."}
{"text": "Conducted series of meetings, joint sessions, and interviews with health insurance experts, operations experts, subscribers, and technical people to properly identify and understand the problems and claims management."}
{"text": "Performed Data verification and Validation against the user requirements."}
{"text": "Reviewed complex SQL queries to extract and validate the data from the Facets database"}
{"text": "Performed Gap analysis of short term business requirements with long term business requirements and reported the GAP to the management."}
{"text": "Used Teradata SQL assistance to write SQL queries for data extraction."}
{"text": "Created and provided Ad hoc data request to the users with quick time around."}
{"text": "Work closely with Heath Insurance Trading Partners and with other contractor companies to ensure the quality of cases."}
{"text": "Involved in testing the EDI transactions 834,837, 835. 270/271 & 276/277 conversion to Facets."}
{"text": "Created HTML Mock-up screens and prototypes to obtain user feedback on implementation of key requirements."}
{"text": "Worked on FACETS claims processing, payment adjustments, claims inquiry, benefits "}
{"text": "Conducted JAD sessions to understand the detailed requirements."}
{"text": "Worked closely with the business analyst and Data warehouse architect to understand the source data and need of the Warehouse."}
{"text": "Derived BPMN for batch loading of provider and Member data into FACETS."}
{"text": "Managing the implementation and delivery of medium to large websites and web applications"}
{"text": "Participated in for website backend testing with Linux and UNIX environment."}
{"text": "Processed claims in Facets and verified 835*12’s are generated and sent to provider."}
{"text": "Extensively involved in updating the official changes to the tabular list, instruction manual and alphabetical index of ICD-9 to ICD-10 in regards to data transactions."}
{"text": "Actively participated in status report meetings & interacted with developers to discuss the technical process."}
{"text": "Conducted walkthroughs and defect meetings periodically to assess the status of the testing process."}
{"text": "Set claim processing data for different Facets modules"}
{"text": "Helped developers with the following list of HIPAA-EDI Transaction Code Sets: (837, 835, 834)"}
{"text": "Followed workgroup for EDI standards for testing that need to comply with the HIPPA guidelines."}
{"text": "Conducted UAT (User acceptance testing). Used SharePoint for UAT bug tracking."}
{"text": "Used SharePoint for document sharing and version control."}
{"text": ""}
{"text": "Environment: Facets, Windows, MS Office, Oracle, MS-Visio, Microsoft Project, HP ALM."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}