{"text": "Name: annie annie"}
{"text": "E-Mail: annie.annie@gmail.com"}
{"text": "Address: Shijiazhuang, China"}
{"text": "Github: https://github.com/annie"}
{"text": "LinkedIn: https://linkedin.com/annie"}
{"text": "Phone No. 863405310047"}
{"text": ""}
{"text": ""}
{"text": "QUALIFICATION SUMMARY:"}
{"text": "7+ years of experience in Networking, including hands-on experience in providing network support, installation and analysis for broad range of LAN/WAN/MAN communication systems."}
{"text": "Proficient in Cisco IOS for configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, MPLS and BGP v4."}
{"text": "Excellent knowledge in Routing, Switching, Firewall and Gateway technologies, system design, wireless design, data network design, capacity management and network growth."}
{"text": "Hands on experience in installing, configuring, maintaining and troubleshooting Cisco Switches, Cisco Routers, Juniper EX Switches, Juniper Routers and Cisco Nexus Switches."}
{"text": "Involved in troubleshooting of DNS, DHCP and other IP conflict problems."}
{"text": "Responsible for Check Point and Cisco ASA firewall administration across global networks."}
{"text": "Experience in working with Cisco Nexus Switches and Virtual Port Channel configuration."}
{"text": "Knowledge of implementing and troubleshooting complex layer 2 technologies such as VLAN Trunks, VTP, Ether-channel, STP, RSTP and MST. "}
{"text": "Implementation of HSRP, VRRP for Default Gateway Redundancy."}
{"text": "Experience in testing cisco routers and switches in laboratory and deploy them on site production."}
{"text": "Expert level knowledge on OSI model and TCP/IP protocol suite."}
{"text": "Worked on Network Topologies and Configurations, Routers, Frame Relay, Token Ring, ATM, Bridges, Switches, Hubs and Repeaters."}
{"text": "Strong knowledge of TACACS+, RADIUS implementation in Access Control Network."}
{"text": "Experience in Designing andAssisting in deploying enterprise wide Network Security and High Availability Solutions for ASA."}
{"text": "Worked extensively in Configuring, Monitoring and Troubleshooting Cisco's ASA 5500/PIX security appliance, Failover DMZ zoning & configuring VLANs/Routing/NATing with the firewalls as per design."}
{"text": "Worked on Extensively on Cisco Firewalls, Cisco PIX (506E/515E/525/) & ASA 5500(5510/5540) Series."}
{"text": "Responsible for Checkpoint and Cisco ASA firewall administration across our global networks."}
{"text": "Strong knowledge of Cisco and Juniper software (IOS/XR and JunOS) and hardware."}
{"text": "Installation, configuration, and management of WAN optimizer, Riverbed Steelhead."}
{"text": "Experience with hardware load balancer administration and support, preferably with F5 and Cisco ACE load balancers."}
{"text": "Experience with convert Checkpoint VPN rules over to the Cisco ASA solution. Migration with both Checkpoint and Cisco ASA VPN experience."}
{"text": "Experience in layer-3 Routing and layer-2 Switching."}
{"text": "Experience with VOIP and QOS implements and support."}
{"text": "Experience in installing and configuring DNS, DHCP server."}
{"text": "Experience with Putty, Exceed, Secure CRT, GNS 3 and Cisco Packet Tracer."}
{"text": "Adept in preparing Technical Documentation and presentations using Microsoft VISIO/Office."}
{"text": "Ability to Install, Manage & Troubleshoot Large Networks & Systems Administration on Windows & Linux platforms in Development, Lab & Production Environments."}
{"text": "Excellent customer management/resolution, problem solving, debugging skills and capable of quickly learning, effectively analyzes results and implement and delivering solutions as an individual and as part of a team."}
{"text": ""}
{"text": "CORE COMPETENCIES:"}
{"text": "Network Configuration:Advanced switch/router configuration (Cisco IOS access list, Route redistribution/propagation)."}
{"text": "Routing Protocols:IGRP, EIGRP, OSPF, BGPv4, MP-BGP"}
{"text": "WAN Protocols:HDLC, PPP, MLPPP"}
{"text": "Circuit switched WAN:T1/E1 – T3/E3/OCX (Channelized, Fractional & full)."}
{"text": "Packet Switched WAN:ATM, FRAME RELAY, MPLS, VPNs"}
{"text": "Security Technologies: Cisco FWSM/PIX/ASDM, Nokia Checkpoint NG, Juniper SRX"}
{"text": "Cisco Routers: Cisco GSR 12416, 12418, Cisco 7200vxr, Cisco 3640, Cisco 3600"}
{"text": "Cisco Switches: Cisco 2960, Cisco 3560, Cisco 3750, Cisco 6500 series"}
{"text": "Juniper EX Switches: EX8200, EX4500, EX4200, EX3200, EX2500, EX2200 Series"}
{"text": "Juniper Routers: E, J, M and T- Series"}
{"text": "Cisco Nexus Switches:Cisco 7010, Cisco 7018, Cisco 5020, Cisco 2148, Cisco 2248"}
{"text": "Redundancy and management:HSRP, RPR, NSF/NSR"}
{"text": "Physical interfaces: Fast Ethernet, Gigabit Ethernet, Serial, HSSI,  Sonet (POS)"}
{"text": "Layer 2 technology: VLAN, VTP, VMPS, ISL, dot1q, DTP, Spanning-tree, PVST"}
{"text": "Layer 3 Switching: CEF, MLS, Ether Channel"}
{"text": "QOS: CBWFQ, LLQ, WRED, Policing/Shaping."}
{"text": "Switches: Catalyst 6500, MSFC, MSFC2, 7600, 3700, 3500"}
{"text": "LAN Technologies: Ethernet, Fast Ethernet, Gigabit Ethernet, & 10 Gigabit Ethernet, Port- channel, VLANS, VTP, STP, RSTP, 802.1Q."}
{"text": "WAN Technologies: Frame Relay, ISDN, ATM, MPLS, leased lines & exposure to PPP, HDLC, CSU/DSU."}
{"text": "Operating Systems: Microsoft XP/Vista/7, UNIX, Linux(Redhat,OpenSuse,Fedora)"}
{"text": "Windows Servers 2003/2008, Windows MS-Office. "}
{"text": ""}
{"text": "EDUCATION & CREDENTIALS:"}
{"text": "Bachelor of Technology in Electronics and Communication Engineering at JNTU, INDIA."}
{"text": ""}
{"text": "CERTIFICATIONS:"}
{"text": "Cisco Certified Network Associate (CCNA) – Routing and Switching "}
{"text": "Cisco Certified Entry Networking Technician (CCENT)– Routing and Switching "}
{"text": "Juniper Network Certified Associate(JNCIA – JUNOS)– Routing and Switching "}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "Ascena Retail Group, Pataskala, OH.                               Oct 2014 - Present"}
{"text": "Sr Network Engineer"}
{"text": "Key Responsibilities"}
{"text": "Rolling out and troubleshooting of hundreds of the combination of Cisco 1800 series Routers and Dell 3524 Switch with DSL and ADSL Circuits to Cisco 1921 routers and Cisco 2960 Switch with T1 Circuit in all the Dress Barn and Justice Brothers Retail Stores all over the United States."}
{"text": "Designing and configuring of OSPF, BGP on Juniper Routers and SRX Firewalls."}
{"text": "Configuring RIP, OSPF and Static routing on Juniper M and MX series Routers."}
{"text": "Experience working Juniper T-Series, M-Series, MX-Series, J-Series Routers."}
{"text": "Performing the ACL requests changes for various clients by collecting source and destination information from them."}
{"text": "Worked in TACACS+ and RADIUS Servers."}
{"text": "Strong Knowledge in working with F5 Load Balancers and their Implementation in various Networks."}
{"text": "Handled Load Balancing usingF5 Networks – LTM, GTM series like 6400, 6800, 8800 for the corporate applications and their availability."}
{"text": "Checking the Access-list configuration and uploading them in the Solar winds, which make the ORPOS (Oracle Retail Point-of-Service) rollouts easily. "}
{"text": "Configuring, Installing and troubleshooting on Check Point Devices and Access-lists."}
{"text": "Configured PPP, HDLC, BGPv4, EIGRP, MPLS and OSPF routing."}
{"text": "Troubleshooting of T1, DSL and ADSL circuits, T1 WIC Cards, Smart Jack, Biscuit Jack and Demarcation Point."}
{"text": "Implemented Meraki Access Points and WLAN Aruba Wireless Access Points and its Controllers at various corporate sites fort 11n Infrastructure and its legacy technologies."}
{"text": "Configuring, Monitoring and Troubleshooting Cisco's ASA 5500/PIX as per the design."}
{"text": "Adding and removing checkpoint firewall policies based on the requirements of various projects."}
{"text": "Worked in UNIX and Linux environment and also involved in installing and configuring all the Linux servers in the network per specifications of clients."}
{"text": "Worked on Aruba Wireless LAN Implementation for 11n Infrastructure Across the Corporate Network."}
{"text": "Good communication with Service Providers such as Century Link and XO communications."}
{"text": "Good coordination with different IT vendor’s in-order to meet the user needs."}
{"text": "Providing daily network support for national wide area network consisting of MPLS, VPN and point-to point site."}
{"text": "Establishing VPN Tunnels using IPSec encryption standards and also configuring and implementing site-to-site VPN, Remote VPN."}
{"text": "Responsible for day-to-day management of Cisco Devices, Traffic management and monitoring."}
{"text": "Troubleshooting the Cradle Point along with the tunnel interfaces to generate the 4G signals."}
{"text": "Implementing, configuring and troubleshooting routing protocols such as OSPF (v3, v2), RIPv2, BGPv4, EIGRP, HSRP, GLBP and MPLS"}
{"text": "Working on physical interfaces such as Gigabit, Fast Ethernet and Serial interfaces."}
{"text": "Experience in troubleshooting Traffic Counters, Registers, Meraki Access Points, NOMI Sensors and Internet Service Providers (ISPs)."}
{"text": "Creating and implementing IOS configuration for the Cisco 1921 routers and Cisco 2960 switches and importing them into the Solar winds."}
{"text": "Creating, assigning and allocating IP addresses based on Subnet and Supernet (CIDR) concepts."}
{"text": "Experience with VOIP and QOS implements and support."}
{"text": "Experience in installing and configuring DNS, DHCP server."}
{"text": "Environment:Cisco 3560/3750/3550/3500/2960 6500 switches, Cisco Nexus 7K/5K/2K,Dell 3524 Switch, Cisco 7200/3845/3600/1921/1841/1811 routers, Cisco ASA5510/5505, Checkpoint,Juniper EX8200/EX2500/EX2200 switches and Juniper T4000/T1600/T640/T320 routers."}
{"text": ""}
{"text": ""}
{"text": "AIG, Dallas, TX.\t\tJan2013–Sep 2014"}
{"text": "Sr Network Engineer"}
{"text": "Key Responsibilities"}
{"text": "Working with Network Design and implementation Team on various projects Across North America and South America."}
{"text": "Configure Corporate, Wireless and Lab Devices, which includes Bandwidth Upgrade, Adding New Devices, Decom the Devices, Testing (Pilot)."}
{"text": "Configured CIDR, IP, RIP, PPP, BGP, MPLS and OSPF routing."}
{"text": "Designing and configuring of OSPF, BGP on Juniper Routers and SRX Firewalls."}
{"text": "Configuring RIP, OSPF and Static routing on Juniper M and MX series Routers."}
{"text": "Understand the JUNOS platform and worked with IOS upgrade of Juniper devices."}
{"text": "Configuring VLAN, Spanning tree, VSTP, SNMP on EX series switches."}
{"text": "Handled Load Balancing usingF5 Networks – LTM, GTM series like 6400, 6800, 8800 for the corporate applications and their availability. "}
{"text": "Involved in the configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, and BGP v4. "}
{"text": "Configured IP access filter policies. "}
{"text": "Experience working Juniper T-Series, M-Series, MX-Series, J-Series Routers."}
{"text": "Experience in configuring Load balancers and Riverbed WAN optimizers."}
{"text": "Created Visio Dean / Visio Documentation to give complete picture of network design for each building."}
{"text": "Troubleshoot the Network Issues onsite and remotely depending on the severity of the issues."}
{"text": "Deploying and decommissioning the VLANs on core ASR 9K, Nexus 7K, 5K and its downstream devices."}
{"text": "Convert Branch WAN links from TDM circuits to MPLS and to convert encryption from IPSec/GRE to GetVPN."}
{"text": "Experience in creating MOPS (Method of procedures) and get approved from peers for performing configuration changes."}
{"text": "Performed OSPF, BGP, DHCP Profile, HSRP, IPV6, and Bundle Ethernet implementation on ASR 9K redundant pair."}
{"text": "Deploying and decommissioning the TOR switches and their respective software upgrades."}
{"text": "Performing troubleshooting on slow network connectivity issues, routing issues involves OSPF, BGP and identifying the root cause of the issues."}
{"text": "Performed Break Fix support through driving to different buildings, identifying the root cause of the hardware issues with switches, routers."}
{"text": "Design, implementation and operational support of routing/switching protocols in complex environments including BGP, OSPF, EIGRP, Spanning Tree, 802.1q, etc."}
{"text": "Environment:Cisco 2948/3560/4500/3560/3750/3550/3500/2960 6500 switches and Cisco 3640/12000 /7200/3845/3600/2800 routers,Cisco Nexus 7K/5K, Cisco ASA5510, Checkpoint, Aruba Controllers 6000, 3600, 3400,650: windows server 2003/2008: F5 BIGIP LTM."}
{"text": ""}
{"text": ""}
{"text": "Herbalife, Fresno, CA.\t\t\t\t\t\tFeb2012 – Dec2012"}
{"text": "Network Deployment Engineer"}
{"text": "Key Responsibilities"}
{"text": "Configuring routing protocols OSPF, EIGRP, RIP, MPBGP, LDP and BGPV4."}
{"text": "Implemented DHCP, DNS, IPAM configuration on the servers to allocate, resolute the ip addresses from Subnet."}
{"text": "Configuring HSRP between VLANs, Configuring Ether-Channels, Port Channel on 6500 catalyst"}
{"text": "Switches Replace branch hardware with new 2851 routers and 2960 switches."}
{"text": "Implemented WLAN Aruba Wireless Access Points and its Controllers at various corporate sites fort 11n Infrastructure and its legacy technologies."}
{"text": "Configuring and troubleshooting Juniper Netscreen Firewalls using NSM."}
{"text": "Experience in working with cisco Nexus 5000 series switches for data center."}
{"text": "Conversions to BGP WAN routing, which converts WAN routing from OSPF to BGP (OSPF is used for local routing only) that involves new wan links."}
{"text": "Configuring various advanced features (Profiles, monitors, iRules, Redundancy, SSL Termination, Persistence, SNATs, HA on F5 BIGIP appliances SSL termination and initiation, Persistence, Digital Certificates, Executed various migration/upgrade projects across F5 and hands on with F5 BIGIP LTMs/EM."}
{"text": "Configured various BGP attributes such as Local Preference, MED, Extended Communities, Route-Reflector clusters, Route-maps and route policy implementation."}
{"text": "Actively participated in upgrading fast Ethernet, Layer 3-switched/Routed LAN infrastructure from Cisco 3640 to Cisco 2811 ISR routers and switches at access level to 2950, 3550."}
{"text": "Converting CatOS to Cisco IOS Config Conversion on distribution layer switches."}
{"text": "Configuring VLAN’s, VTP’s, enabling trunks between switches."}
{"text": "Configured VLANs with 802.1q tagging. Configured Trunk groups, ether channels, and Spanning tree for creating Access/distribution and core layer switching architecture. "}
{"text": "Configured various Router interfaces like ATM interface, T3 & Channelized T1 interfaces."}
{"text": "Configuring and troubleshooting CISCO catalyst 6509, 7609, 7613 with Supervisor cards, Cisco 3640, Cisco GSR 12416,21418(with PRP and RPR processors)."}
{"text": "Plan Design and assist in deploying enterprise wide Network Security and High Availability Solutions for ASA."}
{"text": "Worked on Extensively on Cisco Firewalls, Cisco PIX (506E/515E/525/) &ASA 5500(5510/5540) Series."}
{"text": "Experience with design and implementation of Data center migration at NBC Universal"}
{"text": "Data center migration was involved in Access, Distribution and Core layers."}
{"text": "Wrote IOS and CAT OS upgrade procedures and Pre/Post checks for customer production upgrades."}
{"text": "Strong Knowledge in working with F5 Load Balancers and their Implementation in various Networks."}
{"text": "Created MOPS and get approval from peers to perform configuration add/ remove changes."}
{"text": "Performed Configuration on ASR 9K Pairs includes HSRP, BundleEthernet Config, Assigning DHCP profiles."}
{"text": "Excellent Troubleshooting Skills and Customer Centric approach. "}
{"text": "Environment: Cisco 3750/3550/3500/2960 switches and Cisco 3640/12000 /7200/3845/3600/2800 routersCisco Nexus 7K/5K, 2248/3560/5020/6509, Cisco ASA5510, Checkpoint, Aruba Controllers 6000, 3600, 3400,650."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Amedisys, Baton Rouge, LA.\t\t\t\tAug 2010 – Jan 2012"}
{"text": "Network Engineer"}
{"text": "Key Responsibilities"}
{"text": "Involved in the configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, and BGP v4. Configured IP access filter policies"}
{"text": "Configured CIDR, IP, RIP, PPP, BGP and OSPF routing."}
{"text": "Identify, design and implement flexible, responsive, and secure technology services."}
{"text": "Experience with Firewall Administration, Rule Analysis, Rule Modification."}
{"text": "Troubleshoot traffic passing managed firewalls via logs and packet captures."}
{"text": "Configured and resolved various OSPF issues in an OSPF multi area environment. "}
{"text": "Configuration and troubleshooting of Cisco catalyst 6509,7613 with supervisor cards."}
{"text": "Experience with implementing and maintaining network monitoring systems (Cisco works and HP Open view) and experience with developing complex network design documentation and presentations using VISIO."}
{"text": "Configuring IPSEC VPN on SRX series firewalls."}
{"text": "Configuring Virtual Chassis for Juniper switches EX-4200, Firewalls SRX-210."}
{"text": "Worked on Extensively on Cisco Firewalls, Cisco PIX (506E/515E/525/) & ASA 5500(5510/5540) Series, CHECKPOINT AI, NGX, Nokia IP 740/530/340 Appliances on IPSO platform."}
{"text": "Design, implementation and operational support of routing/switching protocols in complex environments including BGP, OSPF, EIGRP, Spanning Tree, 802.1q, etc."}
{"text": "Estimated Project costs and created documentation for project funding approvals. "}
{"text": "Planned resources and presented project status to higher management.     "}
{"text": "Deployed 7613 as PE and CE router and Configured and troubleshoot the Edge Routers."}
{"text": "Excellent troubleshooting knowledge on T1, T3, OC-3 and OC-12."}
{"text": "Created and delivered internal trainings for BGP.  "}
{"text": "Hands-on experience with WAN (ATM/Frame Relay), Routers, Switches, TCP/IP, Routing Protocols (BGP/OSPF), and IP addressing."}
{"text": "Installed different software on the systems. Install and managing network devices including Hubs, Switches."}
{"text": "Modified internal infrastructure by adding switches to support server farms and added servers to existing DMZ environments to support new and existing application platforms."}
{"text": "Analyzed customer application and bandwidth requirements, ordered hardware and circuits, and built cost effective network solutions to accommodate customer requirements and project scope"}
{"text": "Configured egress and ingress queues for ISP facing routers using CBWFQ."}
{"text": "Generating RCA (Root Cause Analysis) for critical issues of layer1/layer2/layer3 problems."}
{"text": "Ability to analyze, configure and troubleshoot networks."}
{"text": "Worked on Unix, Linux, Windows Platforms and also involved in capacity planning of Network maintenance."}
{"text": "Environment: Cisco 6509/ 3750/3550/3500/2950 switches, Cisco 7200/3845/3600/2800 routers, Checkpoint firewalls (SPLAT), Net Flow, TACACS, EIGRP, RIP, OSPF, BGP, VPN, MPLS, CSM, SUP720, Ether Channels, Fluke and Sniffer."}
{"text": ""}
{"text": ""}
{"text": "BSNL, Hyderabad, INDIA.\t\t\t\t\tMar 2009 – Jul 2010"}
{"text": "Network Technician                                                                                          "}
{"text": "Key Responsibilities"}
{"text": "Designed and implemented Cisco VoIP infrastructure for a large enterprise and multi-unit office environment. Met aggressive schedule to ensure a Multi-office reconfiguration project, which was successfully delivered."}
{"text": "Responsible for service request tickets generated by the helpdesk in all phases such as troubleshooting, maintenance, upgrades, patches and fixes with all around technical support."}
{"text": "Providing daily network support for national wide area network consisting of MPLS, VPN and point-to point site."}
{"text": "Configuring HSRP between the 3845-router pairs for Gateway redundancy for the client desktops."}
{"text": "Configure VRRP & GLBP and VLAN Trunking 802.1Q & ISL, STP, Port Security on Catalyst 6500 switches."}
{"text": "Negotiate VPN tunnels using IPSec encryption standards and also configured and implemented site-to-site VPN, Remote VPN."}
{"text": "Configuring STP for switching loop prevention and VLANs for data and voice along with Configuring port security for users connecting to the switches."}
{"text": "Working on Network design and support, implementation related internal projects for establishing connectivity between the various field offices and data centers."}
{"text": "Ensure Network, system and data availability and integrity through preventive maintenance and upgrade."}
{"text": "Involved in L2/L3 Switching Technology Administration including creating and managing VLANs, Port security, Trunking, STP, Inter-Vlan routing, LAN security."}
{"text": "Worked on the security levels with RADIUS, TACACS+."}
{"text": "Worked on commissioning and decommissioning of the MPLS circuits for various field offices."}
{"text": "Managed fast Layer 3 switched/routed LAN/WAN infrastructure as a part of Network team. The LAN consisted of Cisco campus model of Cisco 3550 at access layer, Cisco 6513 at distribution/core layer. "}
{"text": "Worked with telecom vendors in regards to network fault isolation."}
{"text": "Updated the HP open view map to reflect and changes made to any existing node/object."}
{"text": "Handled SRST and implemented and configured the Gateways, Voice Gateways."}
{"text": "Worked on a broad range of topics such as routing and switching, dedicated voice access, planning and implementation, large-scale high-visibility outages, change management coordination, proactive monitoring and maintenance, disaster recovery exercises, and core network repairs."}
{"text": "Network Cabling, dressing, labeling and troubleshooting various network drops onsite."}
{"text": "Environment: Cisco 7200/3845/3600/2800 routers, Flow, TACACS, EIGRP, RIP, OSPF, BGP, VPN, MPLS, CSM, SUP720, Ether Channels, Fluke and Sniffer."}
{"text": ""}
{"text": ""}
{"text": "Logica Pvt Ltd, Bangalore, INDIA.    \t\tJan 2008 – Feb 2009"}
{"text": "Network Engineer"}
{"text": "Key Responsibilities "}
{"text": "Designed and Configured Layer 2 / 3 networking features such as VLAN, ISL, STP, VTP, 802.1X, Port Security, L2PT and SPAN."}
{"text": "Configured security policies including NAT, PAT, and VPN, Route-maps, Prefix lists and Access Control Lists."}
{"text": "Expert knowledge of cable connectors and replacement as RJ-11, RJ-45, V.35, RS-449."}
{"text": "Well experienced in configuring HSRP, GLBP, IGMP, ICMP, PPP, SNMP, VLSM, ARP and authentication Protocols (PAP and CHAP)."}
{"text": "Worked on various networking concepts and routing protocols like BGP, EIGRP, OSPF and other LAN/WAN technologies."}
{"text": "Establishing VPN Tunnels using IPSec encryption standards and also configuring and implementing site-to-site VPN, Remote VPN."}
{"text": "Responsible for day-to-day   management of Cisco Devices, Traffic management and monitoring."}
{"text": "Adding and removing checkpoint firewall policies based on the requirements of various project requirements."}
{"text": "Experience in working with application layer protocols such as Telnet, FTP, SMTP, POP3, HTTP/HTTPS, SSH, SSL and DNS. "}
{"text": "Used Wireshark and its filters to capture the traffic of TCP based protocols such as SMTP, POP3, IMAP, FTP, HTTP/HTTPSand DNS protocols."}
{"text": "Gained good knowledge about using Cookies and Sessions. "}
{"text": "Configuring, Installing and troubleshooting on Check Point Devices."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "REFERENCES"}
{"text": "Available on Request."}
{"text": ""}