{"text": "Name: helen helen"}
{"text": "E-Mail: helen.helen@gmail.com"}
{"text": "Address: Nanyang, China"}
{"text": "Github: https://github.com/helen"}
{"text": "LinkedIn: https://linkedin.com/helen"}
{"text": "Phone No. 337396094177"}
{"text": "PROFESSIONAL SUMMARY: "}
{"text": "Over 7+ years of experience in design, development, maintenance and support of Java/J2EE applications."}
{"text": "Extensive Experience in design and development of multi-tier applications using Java, J2EE, Spring, Struts, and Hibernate, JavaScript, JSF frameworks."}
{"text": "Strong Experience on AWS platform and its dimensions of scalability including VPC, EC2, ELB, S3."}
{"text": "Worked on Amazon Web Services (AWS) infrastructure with automation and configuration management tools such as Chef and Puppet."}
{"text": "Hands-on experience with JavaScript, JSF, Oracle, DB2 SQL, Hibernate frameworks"}
{"text": "Expertise in full Software Development Life Cycle (SDLC) including Software Architecture, Object Oriented programming, Designing & Prototyping."}
{"text": "Hands on experience with the AWS CLI and SDKs/API tools."}
{"text": "Expert in JS, JavaScript frameworks like Angular JS, React JS, server side JavaScript that is NodeJS."}
{"text": "Experienced in developing applications using Apache Tomcat, Web Logic, and JBoss."}
{"text": "Resuming from Broken Connection using SFTP and FTP protocals."}
{"text": "Experienced in developing UML diagrams like use cases, class diagrams and sequence diagrams using Rational Rose."}
{"text": "Extensive experience in web application design using open source MVC, Struts, Spring Frameworks, Java, J2EE design patterns."}
{"text": "Thorough knowledge in core Java concepts like OOP, JDBC, Multi-Threading, Java Concurrency utilities etc., and advanced Java concepts like JSP, Servlets, Hibernate, Struts, Spring, Spring Annotations and WebServices."}
{"text": "Experience coding responsive websites using HTML5, CSS3, and JavaScript / jQuery, including the use of frameworks such as Bootstrap and Flexbox, as well as CSS pre-processer SASS."}
{"text": "Developed UI and Single Page Applications using Mongo DB, Express, Angular JS and Node.js."}
{"text": "Strong understanding of Spring framework features and expertise in Hibernate ORM tool."}
{"text": "IT Strategy Risk Management Cloud Computing / PaaS / SaaS / IaaS Infrastructure Architecture Disaster Recovery"}
{"text": "Storedprocedures, functions, triggers etc. using SQL and PL/SQL."}
{"text": "Developed different Web components such as JSPs, Servlets, Custom Tag Handlers and business components such as Web Services."}
{"text": "Experience is developing data visualization graphs using D3.js and Angular Fusion Charts."}
{"text": "Expertise in web services technologies such as SOAP, Restful."}
{"text": "Worked on debugging using Logging Frameworks such as Apache Log4j."}
{"text": "Expertise in build automation tools like Maven, ANT."}
{"text": "Experienced in web development using HTML, HTML5,CSS3, JavaScript and AJAX technologies."}
{"text": "Design, code, and maintain highly scalable and reliable enterprise applications using current Web technologies such as JavaScript, JQuery, Java, Spring, Jenkins, Bootstrap and AJAX."}
{"text": "IT Strategy Risk Management Cloud Computing / PaaS / SaaS  / IaaS Infrastructure Architecture Disaster Recovery BYOD Cyber Security Security Wrappers Program / Project Management Budgeting / Expense Control / Cost Reduction Negotiations"}
{"text": "Good knowledge on IOC, Dependency Injection concepts, hands on experience working with Spring IOC, Spring Web, Spring AOP, Spring Sockets, Spring Security, Spring MVC, Spring JDBC, Spring-Hibernate, Spring Struts and Spring-JSF Modules, REST Services."}
{"text": "Good Experience in developing User interfaces using JSP, HTML, DHTML, CSS, Java Script, AJAX, JQuery and Angular JS, Backbone.JS"}
{"text": "Hands-on knowledge on dependency Injection concepts with Spring Web Sockets."}
{"text": "Experience using JavaScript, jQuery, Java, CSS, AJAX, HTML5, JBoss/WebSphere Application Server."}
{"text": "Strong Experience in JSP, Servlets, Struts, Spring, Hibernate, JDBC, JMS, XML, XQuery, EJB3.0, Axis2, Java Swing."}
{"text": "Expertise in developing web based GUIs using Java Applets, Java Servlets, JSP, HTML, DHTML XML, XSL JavaScript, and Java Swing."}
{"text": "Deep Dive into Spring Web Sockets, Spring Security using Spring MVC, JSF, Hibernate frameworks."}
{"text": "Experienced with Java Multithreaded programming to develop multithreaded modules and applications."}
{"text": "Proficient in Java Multi Threading, Socket programming, Swing programming."}
{"text": "Experience with JavaEE, including JSPs, Servlets, Web Services (SOAP and REST), and Tomcat."}
{"text": "Development experience on SQL databases (Oracle or Teradata)."}
{"text": "Used Spring Security framework to focuse on providing both authentication and authorization to Java."}
{"text": "Extensive experience in code re-factoring, developing standards and mentoring the team."}
{"text": "\t"}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "Programming Languages \t: C, C++, Java, SQL, and PLSQL."}
{"text": "Java/JEE Technologies \t: JSP, Servlets, Java Swing, PaaS, IaaS, EJB, JDBC, JMS."}
{"text": "Enterprise Frameworks   \t: Spring, Struts, JSF, Hibernate, Spring Security, AngularJS, "}
{"text": "                                                            Angular-Bootstrap3.0, D3.js     "}
{"text": "Web/Application Server  \t: Tomcat, WebLogic, WebSphere."}
{"text": "Web Technologies             \t: HTML, DHTML, XML, XSLT, JavaScript, CSS, GWT."}
{"text": "Databases                          \t: Oracle, DB2, Sybase, SQL Server, Teradata, AWS."}
{"text": "IDEs                                \t\t: Eclipse, RAD, WASD, Net Beans."}
{"text": "Other Tools &packages    \t: CVS, SVN, Jenkins, JUnit, Maven, ANT, Github, Jasmine"}
{"text": "Modeling Tools                \t: IBM Rational Rose, Visual Paradigm."}
{"text": "SDLC Methodology        \t\t: Agile, RUP, Waterfall model."}
{"text": "XML/Web Services\t: SOAP, WSDL, JAX-WS, JAX-RS, Jersey, Apache CXF, JSON, XML, XSTL, RESTful web services, FTP."}
{"text": "User Interface\t: HTML, DHTML, CSS, Java Script, AJAX, JQuery, Angular JS 1.0/2.0."}
{"text": ""}
{"text": "Professional Experience:"}
{"text": ""}
{"text": "Client: Wyndham Boca Raton– Boca Raton, FL                                                               Sep 2016 – Apr 2018"}
{"text": "Role: Front End/UI Developer"}
{"text": " "}
{"text": "Responsibilities: "}
{"text": "Designed dynamic Multi-Browser compatible web pages using HTML5, CSS3, JavaScript, Bootstrap, React.js, Redux and Flux."}
{"text": "Developed all the UI pages using HTML5, DOM, CSS3, JSON, JavaScript, AJAX, Bootstrap, React JS and Node JS. "}
{"text": "Developed the front-end components using Angular JS framework to leverage the MVC architecture."}
{"text": "Making changes to the existing web applications and creative new components using React JS."}
{"text": "Implemented client side Interface using React JS. "}
{"text": "Responsible for React UI and architecture. Built components library, including Tree, Slide-View, Table Grid. "}
{"text": "Utilized SCSS and Backbone JS to develop a client dashboard and website editor "}
{"text": "Maintained company UI Kit (fonts, icons, global CSS, SCSS variables/mixins, etc.)"}
{"text": "Used AJAX and Angular services to update the user information region."}
{"text": "Involved in developing the UI, layout and front-end programming for web application that matches requirements of the client. "}
{"text": "Design roles and groups for users and resources using AWS Identity Access Management (IAM)."}
{"text": "Used to write a small chat application using Spring Web Sockets with the Spring framework."}
{"text": "Converted the mock-ups into hand-written HTML, CSS (2.1/3), XHTML, JavaScript. "}
{"text": "Used various screens for the front end using React.js and used various predefined components from NPM (Node Package Manager) and redux library.  "}
{"text": "Used Jenkins for Unit Testing."}
{"text": "Created Selenium automated tests for use in smoke, integration, and regression testing."}
{"text": "Involved in creation of GUI. "}
{"text": "Developed UI Layer for the application using HTML5, CSS3."}
{"text": "Worked to build a layered Knockout.js binding system to support partial views. This allowed the partial views to contain the JavaScript functionality that was associated with them, making them both reusable and much more maintainable compared to a pure JQuery system"}
{"text": "Developed API for using AWS Lambda to manage the servers and run the code in the AWS."}
{"text": "Proficient in developing SOAP and RESTful Web Services."}
{"text": "Responsible for consumption of RESTful web services using Jersey and Jackson API’s."}
{"text": "Implemented Service Oriented Architecture (SOA) using JMS for sending and receiving messages while creating web services."}
{"text": "Achieved form-function and validation using Redux-Form."}
{"text": "Used the Node.js with Flux Frameworks in the development of the web applications."}
{"text": "Implemented a Node.js server to manage authentication."}
{"text": "Created Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop."}
{"text": "Consumed Spring MVC based RESTful web services and processed JSON using Angular services calls."}
{"text": "Created proof-of-concept using responsive web design, Node.js, React.JS, HTML5 and CSS3."}
{"text": "Re-Branding and Re-Design of the web applications using HTML5, LESS, CSS3, JavaScript."}
{"text": "Involved in Agile process, weekly Sprints, weekly workshops, demo’s, reviews, retro’s and daily Scrums to discuss the development of the application."}
{"text": "Extended CSS as needed to accommodate new data and display types. "}
{"text": "Environment: React.JS, Node.Js, Coffee Script, JavaScript, ES6, Typescript, Dynamo DB, PostgreSQL, AWS, Jenkins, Knockout Js, React JS, IntelliJ IDEA, pgAdmin4, GitKraken, Atom, Source Tree, Neo4j, GitHub, JIRA, Swagger, HTML5, CSS, LESS, SASS, SOA, Redux, Mocha, NPM, Web pack, jade, Apache Tomcat, bootstrap, Rest, Flux Framework, Angular JS 1.5."}
{"text": ""}
{"text": "Client: Intermountain Health Care, Salt Lake City, UT                                                  Nov 2015 – Aug 2016"}
{"text": "Role: Web/UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in the full life cycle of the software design process including, requirements definition, "}
{"text": "prototyping, and proof of concept, design, interface implementation, unit testing and maintenance."}
{"text": "Developed all the UI pages using HTML5, DHTML, XSL/XSLT, XHTML, DOM, CSS3, JSON, "}
{"text": "JavaScript, JQuery, Ajax."}
{"text": "Utilized the HTML5 DOM local storage features to store data locally client side processing. "}
{"text": "Wrote custom JQuery plugins and developed JavaScript functions to build a bleeding-edge, AJAX-driven user interface."}
{"text": "Maintained and extended custom CSS/SCSS framework."}
{"text": "Using React, Redux, React Router, Thunk, React+Foundation, and Sass to build web applications."}
{"text": "Developed and implemented robust client-side solutions using AngularJS1.4."}
{"text": "Developed certain features of the application functionality i.e. CRUD (Create, read, update, delete) "}
{"text": "features using Responsive Design. "}
{"text": "Designed and Developed JavaScript frame work which is wrapper on top of JQUERY frame work and "}
{"text": "AJAX based UI frame work for UI Configuration widgets."}
{"text": "Created modular web components using Scss, Javascript and Foundation."}
{"text": "Involved in developing XML, HTML, and JavaScript for client side presentation and, data validation on the client side with in the forms. "}
{"text": "Developed a web-based reporting for credit monitoring system with HTML, XHTML, JSTL, Custom tags using Struts."}
{"text": "Developed multiple web-based chat demos using React, Redux, ES6/Babel, Webpack, and Mocha."}
{"text": "Involved in redesigning the entire site with CSS styles for consistent look and feel across all browsers and all pages."}
{"text": "Dynamic UI using Knockout JS and Developed web services, SOAP message envelopes and headers using WSDL, UDDI, XML and JAXP."}
{"text": "Used Git Subversion to implement version control System."}
{"text": "Experienced implementing SOA Suite technology adapters (DB, JMS, File, BAM, B2B) to integrate with external systems."}
{"text": "Followed Agile methodology for developing the application."}
{"text": "Worked with the team of architects and back-end Developers to gather requirements and enhance the "}
{"text": "application functionality and add new features. "}
{"text": "Used AngularUI Bootstrap directive to design the progress bar and checklist"}
{"text": "Participated in the status meetings and status updating to the management team."}
{"text": ""}
{"text": "Environment: Java/J2EE, HTML, CSS, Bootstrap, Angular.js, Jenkins, JUnit, Eclipse, SVN, JavaScript, maven, Spring, React, Redux, Hibernate, SOAP-UI, Restful, SOA, XML, Json, AWS."}
{"text": ""}
{"text": ""}
{"text": "Client: Marriott Hotels Group, Somerset, NJ \t                                                       Mar 2014 – Oct 2015 "}
{"text": "Role: UI Developer"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Involved in designing and developing the Web pages using HTML (4/5), CSS (2.1/3)."}
{"text": "Involved in developing the UI, layout and front-end programming for web application that matches requirements of the client. "}
{"text": "Used File Transfer Protocol (FTP) to transfer computer files from one host to another host over a TCP-based network."}
{"text": "Configured AWS IAM and Security Group in Public and Private Subnets in VPC."}
{"text": "Tuned Teradata stored procedures to meet standard."}
{"text": "Parallely used File Transfer Protocol (FTP) to communicate path between the USER-PI and SERVER-PI for exchange of commands and replies."}
{"text": "Used to write a small chat application using Spring Web Sockets with the Spring framework."}
{"text": "Converted the mock-ups into hand-written HTML, CSS (2.1/3), XHTML, JavaScript, jQuery."}
{"text": "Used Jenkins for Unit Testing."}
{"text": "Involved in creation of GUI using Java Swing."}
{"text": "Developing the web pages using responsive design."}
{"text": "Developed business applications using web technologies like HTML5, XHTML, CSS based on W3C Standards."}
{"text": "Developed various helper classes needed following Core Java multi-threaded programming and Collection classes."}
{"text": "Used multithreading in programming to improve overall performance."}
{"text": "Deployed the applications on Web logic, Apache Tomcat, JBoss and proxy webserver."}
{"text": "Used Spring Security to Domain Object Security support for application."}
{"text": "Made use of the Spring MVC framework, along with Hibernate for object-relational mapping."}
{"text": "Worked on a code generation framework that generated Java Swing code from XML."}
{"text": "Used Data Power for user Authentication and Authorization."}
{"text": "Working within SOA based enterprise framework to build web services for Middle Tier processing."}
{"text": "Analyzed current legacy infrastructure, established business case, and built consensus for virtualized IaaS / PaaS near term strategy with SaaS mobile cloud services end state."}
{"text": "Demonstrated ability to learn and apply new technologies quickly"}
{"text": "Design and development of nightly reconciliation/settlement process "}
{"text": "Fix defects identified during SIT and UAT."}
{"text": "Created Images, Logos and Icons that are used across the web pages using Adobe Flash and Photoshop."}
{"text": "Actively involved in mock screens development and project start-up phase."}
{"text": "Developed UI Layer for the application using AngularJS, HTML5, CSS3, Bootstrap."}
{"text": "Involved in building a single page and cross browser compatible web application using AngularJS (Angular routing) and bootstrap."}
{"text": "Route53, EBS, SQL, ELB, Cloud watch, Cloud Formation, Docker, AWS CLI, AWS Auto Scaling, Unix/Linux."}
{"text": "Worked with advanced MVC framework such as Spring Boot, JSF, Hibernate & JavaScript which is used for implementing backend functionality."}
{"text": "Proficient in developing SOAP and RESTful Web Services."}
{"text": "Responsible for consumption of RESTful web services using Jersey and Jackson API’s."}
{"text": "Worked with GIT which is used  as a version control tool in the project"}
{"text": "Efficiently managed in the fast paced agile environment."}
{"text": ""}
{"text": "Environment: Java, J2EE, Servlets, Spring, Hibernate, Eclipse, Spring Sockets, AngularJS, CSS3, HTML5, Web logic Server, Spring MVC, Apache CXF, Apache Tomcat, Jersey, Jackson, Oracle 11g, SQL Developer, PaaS, GIT, JIRA, IBM Rational Application Developer 8, Java Swing, FTP, SFTP, Jenkins, Teradata, AWS."}
{"text": ""}
{"text": "Client: Target Corporation, Minneapolis, MN \t             \t                                           Jan 2013 – Feb 2014"}
{"text": "Role: UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed client side validations using jQuery and JavaScript and developed composite components using JSF facets."}
{"text": "Uses Rational Rose for model driven development and UML modelling."}
{"text": "Extensively used JSTL tags and Struts tag libraries. Used Struts tiles as well in the presentation tier."}
{"text": "A reverence for clean, simple, elegant coding solutions with proven ability to release deliverables and applications on-time."}
{"text": "Used Java Message Service (JMS) for reliable and asynchronous exchange of important information such as loan status report."}
{"text": "Involved in the JMS Connection Pool and the implementation of publish and subscribe using Spring JMS. Used JMS Template to consume messages from the JMS provider."}
{"text": "Used Hibernate, object/relational-mapping (ORM) solution, technique of mapping data representation from MVC model to Oracle Relational data model with SQL-based schema."}
{"text": "Deployed the application on Web Sphere Application Server."}
{"text": "Used JUnit framework for unit testing of application and Log4j to capture the log that includes runtime exceptions."}
{"text": "Participated in coding Spring AOP components for the Transactional Model to handle many requests. Involved in writing JSP and Servlet components."}
{"text": "Developed JSP pages and client side validation by java script tags. "}
{"text": "Developed Web services for sending and getting data from different applications using SOAP messages, such as Loan Applications, to transfer data from Branch Server to Head Office Server, then used SAX and DOM XML parsers for data retrieval."}
{"text": " "}
{"text": "Environment: Java 6.0, J2EE Servlet, JSF 2, XML, XSLT, JSON, Tiles, AngularJS, HTML, CSS, JQuery, Spring 3.0, Spring Sockets, Log4j, Git, Maven, CXF, Eclipse, Apache Tomcat 6, and Oracle."}
{"text": ""}
{"text": ""}
{"text": "Client: Param Solutions, Bangalore, India\t\t\t\t               Feb 2011 - Dec 2012"}
{"text": "Role: Web Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Built the admin module using Struts framework for the master configuration."}
{"text": "Developed server-side common utilities for the application and the front-end dynamic web pages using JSP, JavaScript and HTML/DHTML, Developed EJB components encapsulating business logic."}
{"text": "Used Struts-config.xml file for defining Mapping Definitions and Action Forward Definitions."}
{"text": "Spring Security for program based applications."}
{"text": "Creating XML based configuration, property files for application and developing parsers using JAXP, SAX, DOM technologies."}
{"text": "Design and Development of business objects, data objects, view objects and helper classes."}
{"text": "Developed Log4j logs to record the application events to provide the debugging, monitoring and auditing capabilities to the application. "}
{"text": "Struts MVC framework for developing J2EE based web application. "}
{"text": "Extensively worked on presentation layer and simulators developed with Struts. "}
{"text": ""}
{"text": "Environment: Java 6.0, J2EE, Servlet, JSP, Struts EJB, XML, Log4J, Web Services, Windows, ANT, UML."}
{"text": ""}
{"text": ""}
{"text": ""}