{"text": "Name: esther esther"}
{"text": "E-Mail: esther.esther@gmail.com"}
{"text": "Address: Weifang, China"}
{"text": "Github: https://github.com/esther"}
{"text": "LinkedIn: https://linkedin.com/esther"}
{"text": "Phone No. 248975127891"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "8+ years of extensive experience in Requirement Gathering & Analysis, Design, Development, Implementation, Testing and Deployment of Client/Server and Web-based using Microsoft Technologies."}
{"text": "Experience in working with clients on-site, analyzing software requirements and developing solutions and procedures."}
{"text": "Experience in programming with .NET Framework using C#, ADO.NET, ASP.NET, Visual Studio.NET 2005/2008/2010/2012, Sql server 2005/2008/2010/2012R2"}
{"text": "Extensive experience in web-based page and site designs using HTML4.0/5, XHTML, DHTML, CSS2/3, Themes, Master Pages, JavaScript, KnockoutJS, JSON, AJAX, JQuery. Involved in Full stack development. "}
{"text": "Strong Hold on Object Oriented Programming concepts in .NET."}
{"text": "Experience with Data Accessing using Data Adapter, Data Reader and Dataset in ADO.NET and LINQ Providers for data manipulation."}
{"text": "Designed multiple CGI programs in Visual C++ to handle inbound http request from different trading partners. Maintained and updated quite a few UML, C++, Java, C#. CGI programs to work properly on multiple servers. "}
{"text": "Excellent working knowledge in Developing Windows Services, RESTful WebServices, WebForms, SOAP, XML, XSD, XPATH and IIS."}
{"text": "Experience in using the Data Access Components i.e. ADO.Net, ODBC and the SQL Server, Oracle coupled with good understanding of RDBMS concepts. "}
{"text": "Experience in upgrading and migrating various versions of Mongo database on different platforms and provide solutions related to the migration to MongoDB. "}
{"text": "Experience developing Android and iOS apps using the Xamarin framework and toolset (XamarinStudio and/or Xamarin for Visual Studio) and experience with Xamarin Forms "}
{"text": "Experience in implementing several Design Patterns (MVVM and MVC) to standardize the application architecture."}
{"text": "Involved in Analysis, Design, and Development of web based application using VB 6.0. Designed screens with HTML, JavaScript, CSS, code in ASP using Server Controls, backend connectivity with ADO objects. "}
{"text": "Experience in developing applications using WCF and WPF."}
{"text": "Extensive experience in working with ASP.NET MVC 3/4, Web Forms, User Controls and Custom Controls."}
{"text": "Overcame numerous technical difficulties by creative ideas, proficient algorithm and data structure knowledge."}
{"text": "Experience in manipulating XML, Converting Data between ADO.NET and XML."}
{"text": "Knowledge in DTD, Schema, XSL and LINQ to query XML documents."}
{"text": "Experience in building Web Services using WSDL and SOAP."}
{"text": "Proficient in creating the WCF services to implement SOA architecture."}
{"text": "Implement GUI front-end for users to design report layouts on Windows with Oracle parallel server for automated line-control for a manufacturing execution systems (MES). "}
{"text": "Used Angular JS and Node JS to structure JavaScript code in an MVC (Model, View, and Controller). Implemented a Node.js server to manage authentication."}
{"text": "Experience in design and development of PL/SQL stored Packages and Procedures, Functions, Triggers, Synonym, Scheduler Jobs, Performance Tuning. "}
{"text": "Experience with XamarinTest Cloud using XamarinUI testing. "}
{"text": "Development of mobile app as well as Android and iOS Development. "}
{"text": "Proficiency in writing and optimizing complex Queries, stored procedures, functions and triggers using Sql server."}
{"text": "Good work experience with SQL Server Reporting Services (SSRS) and SQL Server Integration Services (SSIS) 2008."}
{"text": "Create Packages in Sitecore for all the content changes related to our team."}
{"text": "3+ years’ experience in development from scratch and Maintenance inSitecore. Worked on content management development using theSitecore. Experience on version control tools VSS, SVN and TFS."}
{"text": "Experience in using SSIS Packages to export or import the data for other applications. "}
{"text": "Experienced in using various methodologies in Software Development Life Cycle (SDLC) like SCRUM/AGILE, Waterfall."}
{"text": "Strong knowledge on working with AWS environments and deployments for production applications. "}
{"text": "Technical Skills:"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": "Client: Emory Healthcare, Atlanta, GA\t\t\t\t\t\tJune 2016 – Present"}
{"text": "Role: Full Stack .Net Developer"}
{"text": "Responsibilities:"}
{"text": "Developed the user interface using VB.NET, C# .NET and designed UI using CSS, HTML, and JavaScript."}
{"text": "Creating cross-browser compatible and standards-compliant CSS-based page layouts. "}
{"text": "Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built. "}
{"text": "Developed web based applications using ColdFusion, DHTML, CSS."}
{"text": "Developed and consumed WebServices using XML/SOAP and REST. "}
{"text": "Installed application on AWS EC2 instances and also configured the storage on S3 buckets."}
{"text": "Maintain, enhance, and recommend solutions that best suit business and technology needs from UI standpoint."}
{"text": "Involved in enhancing already existed applications which were written inVB.NET."}
{"text": "Involved in development of the front end part of the web application using HTML, Java Script&CSS based on client customization. "}
{"text": "Using MongoDB database for the backend. "}
{"text": "Used localization techniques in Xamarin for data translation."}
{"text": "Involved in creating rich and interactive UI using CSS, Java Script, Ajax, & WPF."}
{"text": "Developed web pages and used applications that meet business and user goals through a positive user experience."}
{"text": "Integrated backend services using REST API's (web API) with identity Database."}
{"text": "Development of Business as well as Data Access Layer using Entity Framework."}
{"text": "Developed certain features of the application functionality i.e. CRUD (Create, read, update, delete) features using AngularJS and Responsive Design."}
{"text": "Designing and developing dynamic web pages using XHTML, CSS and JavaScript, JQUERY, Angular 2.0. "}
{"text": "Used AngularJs and JQuery for validation part and generated dynamic controls using jQuery and form submission. "}
{"text": "Worked with Microsoft Type Script 1.8 for handling null able types in JavaScript and control flow analysis. "}
{"text": "Worked Extensively on migrating Win form controls to WPF controls. "}
{"text": "Involved in Design of Data Templates and Branches for Sitecore."}
{"text": "Developed & maintained Web Forms with ASP.NET, Silverlight and C#."}
{"text": "Involved in creating Stored Procedures, Functions ad Triggers using SQL Server and PLSQL, Transact SQL.  "}
{"text": "Used Delegates and Events to establish communication between the Winforms."}
{"text": "Written test cases for each module in the development using NUnit testing of visual studio. "}
{"text": "Created and consumed web services and WCF services. Used Tortoise GIT for version control. "}
{"text": "Used Unified Modeling Language (UML) technologies for design and develop application include class diagrams, sequence diagrams, activity diagrams using VISIO 2012 and UI Wireframes. "}
{"text": "Developed and implemented web applicationinto Sitecore 8 using SCRUM Agile methods."}
{"text": "UsedSSIS (Sql Server Import and Export Wizard) to Import and Export data. "}
{"text": "Well versed with Continuous integration tools with Database such as Rabbit MQ."}
{"text": "Developing complex Stored procedures, User Defined Function and Triggers in SQL Server."}
{"text": "Actively involved in data modeling and contributed in the designing and creation of SQL Server databases. "}
{"text": "Developed the application using C# using SQL Server and Visual Studio 2013 and TFS. "}
{"text": "Environment: HTML 5, Java script, CSS 3, VB.NET, JQuery, REST API's, JSON, C#, Sql Server, Angular 2, SSIS, SSRS, WCF, TFS, Bootstrap, Linq, Entity Framework, Mongo DB, Backbone.js, Sybase,Tortoise GIT.."}
{"text": ""}
{"text": "Client: Adesa, Carmel, IN\t\t\t\t\t\t\t\tFeb 2016 – June 2016"}
{"text": "Role: Full Stack .NetDeveloper"}
{"text": "Responsibilities:"}
{"text": "Developed the user interface using ASP.NET, C# .NET and designed UI using CSS, HTML, and JavaScript."}
{"text": "Creating cross-browser compatible and standards-compliant CSS-based page layouts.  "}
{"text": "Worked on KendoUI controls like Grid, Listview and fix the bugs pertaining to various browsers. "}
{"text": "Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built. "}
{"text": "Developed and consumed WebServices using XML/SOAP and REST. "}
{"text": "Maintain, enhance, and recommend solutions that best suit business and technology needs from UI standpoint."}
{"text": "Involved in development of the front end part of the web application using HTML, Java Script&CSS based on client customization. "}
{"text": "Documentation of customer specific business rules and practices, user requirements, preparing specifications in the area of environment migration. "}
{"text": "Implemented and maintained the monitoring and alerting of production and corporate servers/storage using AWS Cloud watch."}
{"text": "Responsible for the designing and developing the Web based API using VB.NET, ASP. NET, web pages, ADO. NET and PL/SQL language to retrieve data."}
{"text": "Managed servers on the Amazon Web Services (AWS) platform instances using Chef Configuration management. "}
{"text": "Working with Glass mapper to maintain source control of Sitecore items and creating Sitecore items as class objects. "}
{"text": "Involved in creating rich and interactive UI using CSS, Java Script, Ajax, WPF."}
{"text": "Developed web pages and used applications that meet business and user goals through a positive user experience."}
{"text": "Worked on Agile Methodology (Scrum Framework) to meet timelines with quality deliverables. "}
{"text": "Integrated backend services using REST API's (web API) with identity Database."}
{"text": "Developed test cases and performed Unit Testing and Integration Testing of the system. "}
{"text": "Development of Business as well as Data Access Layer using Entity Framework."}
{"text": "Used Bootstrap carousel to do sliding of the images on the screen. "}
{"text": "Used TortoiseSVN for Version Control; performed thorough unit testing using Unit Framework tools. "}
{"text": "Create Cache Memory on Windows Azure to improve the performance of data transfer between SQL Azure and WCF services. "}
{"text": "Created the reusable common User Interface using Xamarin.Forms elements."}
{"text": "Worked with Storyboard using Xamarin and Xcode, And Layouts using Xamarin for the UI interfaces."}
{"text": "Worked with Xamarin.iOS for creating User Interfaces and using its UI controllers. "}
{"text": "Developed solutions in C#, ASP.NET MVC, ADO.NET , JavaScript/ JQuery/ Angular JS, CSS3, PLSQL."}
{"text": "Developed Restful service using WCF framework and used Angular Js for getting data "}
{"text": "Used Asp.net MVC 5 and Backbone.js for creating Single Page Application."}
{"text": "Deploying applications to cloud services using Microsoft AZURE and Amazon Web Services(AWS). "}
{"text": "Created WCF services, deployed them in SharePoint farm and invoked this service as REST calls."}
{"text": "Generated customized reports using SSRS. Employed Team Foundation Server as the version control tool. "}
{"text": "Created and consumed web services and WCF services."}
{"text": "Actively involved in coding and designing using C#, XML, ADO.NET, JavaScript, HTML, and Cascading style sheets (CSS3). Well versed with Continuous integration tools with Database such as Jenkins and Rabbit MQ."}
{"text": "Performed configuration, deployment and support of cloud services including Amazon Web Services(AWS)."}
{"text": "Used Unified Modeling Language (UML) technologies for design and develop application include class diagrams, sequence diagrams, activity diagrams using VISIO 2012 and UI Wireframes. "}
{"text": "Developed and implemented web application from scratch into Sitecore."}
{"text": "UsedSSIS (Sql Server Import and Export Wizard) to Import and Export data. "}
{"text": "Developing complex Stored procedures, User Defined Function and Triggers in SQL Server."}
{"text": "Developed the application using C# using SQL Server and Visual Studio 2013 and TFS. "}
{"text": "Environment: HTML 5, Java script, CSS 3, JQuery, REST API's, JSON, C#, Sql Server, SSIS, SSRS, WCF, TFS, Azure, Bootstrap, Linq, Entity Framework,PL/SQL, Angular JS, Backbone.js."}
{"text": ""}
{"text": "Client: JPMorgan chase, College station, TX\t\t\t\t\t\tJuly 2015 – Dec 2015"}
{"text": "Role: Full Stack .Net Developer"}
{"text": "Responsibilities:"}
{"text": "Involved in creating Front end screens using HTML 5, CSS 3, JavaScript, jQuery, Kendo UI for MVC."}
{"text": "Creating cross-browser compatible and standards-compliant CSS-based page layouts.  "}
{"text": "Worked on Kendo UI controls like Grid, Listview and fix the bugs pertaining to various browsers. "}
{"text": "Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built. "}
{"text": "Worked on React Jsviews, rendering using components which contains additional components called custom HTML tags. "}
{"text": "Worked on cross platform Xamarin forms for developing web application on mobile. "}
{"text": "Knowledge on creating IOS and Android screens in Xamarin IDE. "}
{"text": "Experience in working Client side MVC frameworks (Kendo UI), Single Page Application developments."}
{"text": "Maintain, enhance, and recommend solutions that best suit business and technology needs from UI standpoint."}
{"text": "Involved in development of the front end part of the web application using HTML, Java Script&CSS based on client customization."}
{"text": "Involved in Design of Data Templates and Branches for Sitecore."}
{"text": "Design and developing  Sitecore Templates, Layouts, Controller Rendering, View Rendering, Sub Layouts for both Sitecore MVC and Webforms."}
{"text": "Creating and managing web parts, page layout and customization of sites using SharePoint."}
{"text": "Worked with Composite Views, Layout Views and Item Views in Backbone.js. "}
{"text": "Used Amazon web service AWS to store and retrieve data from Amazon S3 cloud. "}
{"text": "Used structure map for Dependency Injection for improved testability and decoupling. "}
{"text": "Using Model Object Notation for validation of the client side validations. "}
{"text": "Developed web pages and used applications that meet business and user goals through a positive user experience."}
{"text": "Worked on Agile Methodology (Scrum Framework) to meet timelines with quality deliverables. "}
{"text": "Integrated backend services using REST API's (web API) with identity Database."}
{"text": "Development of Business as well as Data Access Layer using Entity Framework."}
{"text": "Written complex Linq and lambda express to meet the business requirements."}
{"text": "Used Kendo UI and bootstrap to style the pages."}
{"text": "Developed custom features to the sites using HTML, SharePoint Designer, JQuery, CSS, and JavaScript. "}
{"text": "Worked with cloud services like Amazon Web Services (AWS) and involved in ETL Data Integration and Migration."}
{"text": "Working on building the Views using Kendo UI followed various patterns and implemented the MVVM methodologies. "}
{"text": "Reverse Engineering redesign from ASP.NET web site to ASP.NET MVC with Razor. "}
{"text": "Used Bootstrap carousel to do sliding of the images on the screen. "}
{"text": "Used SAML as a open standard data format for exchanging authentication and authorization data between parties, in particular, between an identity provider and a service provider. "}
{"text": "Analyzed and fixed various existing bugs using JIRA defect Tracking tool. "}
{"text": "Responsible for maintaining versions of source code in TFS."}
{"text": "Performed migration of project from older to newer versions. Created and consumed web services and WCF services."}
{"text": "Developed the application using C# using SQL Server and Visual Studio 2013 and TFS. "}
{"text": "Environment: HTML 5, Java script, CSS 3, JQuery, Kendo UI, SSIS, SSRS, REST API's, JSON, C#, Sql Server, WCF, TFS, Bootstrap, Linq, Entity Framework, PL/SQL, Silverlight, Expression Blend, Sitecore 8.1."}
{"text": ""}
{"text": "Client: Capital Bank, Brentwood, TN \t\t\t\t\t\t\tAug 2013 – May 2015"}
{"text": "Role: Sr. .Net Developer "}
{"text": "Responsibilities: "}
{"text": "Designed the service order repair module of the application in .NET framework."}
{"text": "The proto-type built using leveraging the Model-View-Controller (MVC) design pattern. All controls were bound using data binding to the View Model."}
{"text": "Developed the user interface using ASP.NET, C# .NET and designed UI using CSS, HTML, and JavaScript."}
{"text": "Wrote new complex stored procedures and triggers in Sybase and optimized the existing code. "}
{"text": "Design and development of user interface using ASP.NET, VB.Net, HTML, and JavaScript."}
{"text": "Used Telerik Controls like date control, auto complete text boxes, file upload controls, Radgrids for rich user experience."}
{"text": "Designed and implemented Data access layer using ADO.NET to connect and retrieve or manipulate database information."}
{"text": "Worked with SQL Server, Windows Server and other technologies related to SharePoint platform. "}
{"text": "Created User input validation for new & existing users."}
{"text": "Used data grid sorting and paging features for Item and Service List."}
{"text": "Designed and implemented Data access layers using LINQ for XML Data."}
{"text": "Utilized XAML, WCF, WPF based Event Handlers."}
{"text": "Developed the application as Mobile First and Responsive Design."}
{"text": "Used WPF in creating different animated scenes using the combination of transforms, animation controls (storyboard, double animation) and color effects."}
{"text": "Created dynamic place holders, Sitecore web controls movable and reusable components."}
{"text": " Extensively used for creating deleting and modifying the content items in Master and Web databases."}
{"text": "Implemented the extra level of security using the Web-seal on top the windows authentication based on Sitecore custom groups."}
{"text": "Wrote web services and its helper classes to store and retrieve data using ODBCfor all the operations. "}
{"text": "Created Winforms and Web Forms for developing the applications."}
{"text": "The server is written in C#, using a mixture of NHibernate and SQL/stored procedure for persistence. The communication between the server and the client is using WCF."}
{"text": "Used Bootstrap framework, glyph icons, font awesome icons, across all the applications to have a common look and feel for all the controls."}
{"text": "Fixed bugs and problems for design, CSS, HTML, XHTML, and JavaScript."}
{"text": "Extensively worked with web parts and web controls."}
{"text": "Involved in building a single page and cross browser compatible web application using AngularJS (Angular routing) and Bootstrap."}
{"text": "Worked closely with DevOps team to configure Active Directory entries. "}
{"text": "Used SSRS to generate reports and integrated with asp.net web page."}
{"text": "TSQL query optimization and creating stored procedures to retrieve data. "}
{"text": "Source control TFS is used for version history and packaging. Created TFS build definition and WIX."}
{"text": "Created test plans and performed unit and regression testing on the application."}
{"text": "Involved in Build, Debug and deployment of the Components. Used Visual Source Safe (VSS) for source control."}
{"text": "Environment: Sitecore7.5, ASP.NET 4.5, ADO.NET, C#, MVC 4.0, WCF, WPF, Web services, Crystal Reports, XML, XAML, HTML, DHTML, Java Script, Telerik, JQuery, NUnit, Bootstrap, NHibernate."}
{"text": ""}
{"text": "Client: Ameriprise Financials, Minneapolis, MN\t\t\t\t\tJuly 2012 – July 2013"}
{"text": "Role: Sr. .Net Developer"}
{"text": "Responsibilities:"}
{"text": "Worked on Agile Methodology (Scrum Framework) to meet timelines with quality deliverables. "}
{"text": "Involved in gathering and preparing the requirements from clients for product design and enhancements. "}
{"text": "Involved in developing applications in C# and .NetFramework 4.5/4.0 to meet the business requirements using VisualStudio.NET 2012/2010. "}
{"text": "Designed and developed various abstract classes, interfaces, classes to construct the business logic using C#.NET. "}
{"text": "Used Telerik Controls for rich user experience."}
{"text": "Used C# in the code behind to form a 3 Tier Architecture."}
{"text": "Extensively used CSS 3.0 for page layout and display of graphics. "}
{"text": "Implemented Asp.net MVC Web Api with AngularJS, jQuery and JSON also used JQuery-Ajax to make asynchronous calls. "}
{"text": "Developed a bulk mail application in Visual FoxPro. The application imports text files and allows selection of records to be print on labels. "}
{"text": "Used ASP.NETMVC Page Controller pattern to add functionality to individual pages such that to accept input from the page request, invoke the requested actions on the mode. "}
{"text": "Worked on View State to maintain data between the pages of the application. "}
{"text": "Developed and Used User Controls using C# and ASP.NET."}
{"text": "Worked on upgrading .NET versions 2.0 to 4.0."}
{"text": "Involved in designing desktop module using WPF 3.5. "}
{"text": "Created new SSIS packages for populating data into MS SQL database. "}
{"text": "Created Indexes, Views and Stored Procedures for quick and efficient retrieval of data using Sql server 2008. "}
{"text": "Used type-safe SQL Parameters for data access in order to avoid SQL Injections. "}
{"text": "Used Team Foundation Server (TFS) to maintain the version control history during development. "}
{"text": "Assisted in quality assurance measures such as code reviews, test case creation and unit testing for different modules."}
{"text": "Designed and developed user interfaces using Winforms and C#."}
{"text": "Used Hibernate extensively for data retrieving, querying, storage and manipulation.  "}
{"text": "Worked on content management development using the Sitecore 6.5."}
{"text": "Used T-SQL to write queries in SQL Server database. Created Stored Procedures in SQL Server."}
{"text": "Utilization of content management systems (Sitecore) APIS and controls for different parts of the web site."}
{"text": "Worked with a team to define requirements and provide technical advice and troubleshooting. Update technical documentation. "}
{"text": ""}
{"text": "Environment: C#,  MVC 4.0, .NET Framework 4.5/4.0,  HTML5, CSS3, JSON, Ajax, JavaScript, CSS3.0, ADO.NET, Web Services, Sql server 2008, Windows XP, IIS, Visual Studio 2010, Telerik , TFS and SSIS."}
{"text": ""}
{"text": "Client: UBS, Connecticut, CT\t\t\t\t\t\t\t\tOct 2011 – July 2012"}
{"text": "Role:  .NET Developer"}
{"text": "Responsibilities:"}
{"text": "Developed the application using C# and Sql server database. "}
{"text": "Used Excel documents, XML documents, VisualStudio 2008, Sql server 2008."}
{"text": "Involved in the code enhancement for version 4 models using c# 3.5. "}
{"text": "Created web service as per the business requirement."}
{"text": "Consumed the SOAPWebService methods and WCF Services. "}
{"text": "Developed the independent WCF (Windows Communication Foundation) services and defined Service Contracts."}
{"text": "Design and develop server-side code for desktop/web using ASP.NET and Winforms applications. "}
{"text": "Implemented Sitecore for better content management solutions."}
{"text": "Development of screens for capturing, retrieving and manipulating of data using Sitecore (CMS). "}
{"text": "Used HTML, CSS, JavaScript, web forms (for testing purpose). "}
{"text": "Validations were handled using c# coding and JavaScript. "}
{"text": "Used C# in the code behind to form a 3 Tier Architecture."}
{"text": "Develop applications using C#, design patterns, OO methods, stored procedures, and TSQL."}
{"text": "Involved in scheduling job using SQL Server Agent for SSIS Packages and Store Procedure as per requirement.  "}
{"text": "Generated scripts for the queries, stored procedures and views that are used for the latest version 4 Model. "}
{"text": "Used Team Foundation Server for source control and Lotus Notes for communication."}
{"text": "Used ADO.NET objects such as Data Adapter, Data Reader, Dataset and Data View for reading/updating records in the database."}
{"text": "Version control for the source code and scripts are managed using TFS."}
{"text": "Environment: C# 3.5, ADO.NET, Sql server 2008/2005, Java Scripts, Visual Studio.NET 2008, WCF, Web Services, Team Foundation Server."}
{"text": ""}
{"text": "Client: BNY Mellon, Lake Mary, FL\t\t\t\t\t\t\tOct 2010 – Aug 2011"}
{"text": "Role:  .NET Developer"}
{"text": "Responsibilities:"}
{"text": "Develop, test and deploy the custom C#.NET thick client applications in an Agile/SCRUM environment."}
{"text": "Developed WPF application using Control Templates, Data Templates, Bindings, Converters, Routed Events, Command bindings, Commands and new features like LINQ and lambda expressions. "}
{"text": "Develop applications using C#, design patterns, OO methods, stored procedures, and TSQL."}
{"text": "Participated in Test Driven Development (TDD) in developing a WPF application in Agile (SCRUM) environment strictly following the MVVM pattern. "}
{"text": "Communicate with project manager, team lead, and team members over technical issues and change requests."}
{"text": "Worked in conjunction with the Tech lead and in identifying and solving issues."}
{"text": "Used Team Explorer in Visual Studio 2010 to keep track of bugs.  "}
{"text": "Involved in improving the performance of the application, by identifying the performance bottle necks using Visual Profiler."}
{"text": "Involved in Database design and development using triggers, UDFs, views, indexes,T-SQL in SQL Server. "}
{"text": "Generated Unit Test Cases using Visual Studio 2010."}
{"text": "Followed change management system and version management using TFS."}
{"text": "Developing data access components in ADO.NET Entity Framework."}
{"text": "Data Access Layer for the Application is implemented for data input, query, retrieve and management."}
{"text": ""}
{"text": "Environment: WPF 3.5, C#.NET 4.0, ADO.NET, .NET Framework 4.0, Visual Studio 2010, Sql server 2008, Visual Profiler, TFS."}
{"text": ""}
{"text": "Client: MakeMyTrip, India(Intern)\t\t\t\t\t\t\tSep 2008  – Sep 2010"}
{"text": "Role:  .NET Developer"}
{"text": "Responsibilities:"}
{"text": "Responsible for Analysis, Design and Development. "}
{"text": "Worked closely with requirements and business users."}
{"text": "Database design, preparing entity relations diagrams, UML case diagrams using Visio tool."}
{"text": "Designed and Developed C# .NET code for the project."}
{"text": "Designed and developed front-end windows applications using C#."}
{"text": "Developed the Applications Using Winforms."}
{"text": "Created classes and core modules in C# for implementing business layer."}
{"text": "Implemented object oriented programming concepts in C#."}
{"text": "Used data grid to view the data on the front end UI."}
{"text": "Used Form Based Authentication for the Application as a .NET Security measure by providing a login page."}
{"text": "Developed application and worked with Ado.net, Data Grid, and Data Set."}
{"text": "Fixed bugs in the application at the business logic level and created Unit Test cases for the same."}
{"text": ""}
{"text": "Environment: ASP.NET, C#.NET, Visual SourceSafe 6.0, Winforms, OOAD, ADO.NET, COM/COM+, JavaScript, VB, IIS, Sql server2000, SOAP, Crystal Reports 9.0, Web Services, XML, XSL, Visual Interdev 6.0, Windows 2000."}
{"text": ""}
{"text": "EDUCATIONAL QUALIFICATIONS:"}
{"text": "Bachelor Degree in “Computer Science” at Jawaharlal Nehru Technology University, Hyderabad, INDIA."}
{"text": ""}
{"text": ""}
{"text": ""}