{"text": "Name: mildred mildred"}
{"text": "E-Mail: mildred.mildred@gmail.com"}
{"text": "Address: Ganzhou, China"}
{"text": "Github: https://github.com/mildred"}
{"text": "LinkedIn: https://linkedin.com/mildred"}
{"text": "Phone No. 662176112065"}
{"text": "\nPROFESSIONAL SUMMARY"}
{"text": "Strong experience in developing professional mobile and web applications which includes front-end designing and hand coding with solid proficiency in usability, web and client/server applications using HTML5, CSS3, JavaScript, AngularJS/Angular 2, JQuery, React JS, Ajax, Bootstrap, Node JS, JSON, XHTML and XML."}
{"text": "Worked with Spring MVC, Spring Boot, Spring JDBC, Spring Core, Struts."}
{"text": "Worked with Maven and Gradle."}
{"text": "Advanced level skills in using Web Services technologies like REST and SOAP."}
{"text": "Good Understanding of Document Object Model (DOM) and DOM Functions."}
{"text": "Extensive use of Node JS and Mongo DB to create server side applications."}
{"text": "Experience in using both Java and J2EE design patterns."}
{"text": "Experienced in creating Restful Services with Spring MVC Framework and using HIBERNATE."}
{"text": "Expert level skills in Java Multi-threaded/Concurrent Programming, Exception Handling, Servlets, JSP, PHP, Custom Tag Libraries, Java Script, AJAX, CSS, HTML, Struts, Spring, JSF, JPA, Enterprise Java Beans(EJB), JDBC, RMI, JNDI, XML, XSLT, JAXB, ORACLE 10g/11g/12c."}
{"text": "Proficiency in web service applications both producing and consuming REST (JAX-RS) API. Strong understanding of SOAP (JAX-WS) based web services and WSDL."}
{"text": "Experience in using Hibernate, MyBATIS as ORM frameworks for XML mappings and Java Objects."}
{"text": "Experience in Oracle supplied packages, Dynamic SQL, Records and PL/SQL Tables."}
{"text": "Highly exposed to various databases like Oracle, My SQL, SQL Server, MongoDB, and PostgreSQL."}
{"text": "Experience with JavaScript testing frameworks Jasmine, Karma, Qunit Mocha and Jest."}
{"text": "Experience in test-driven development (TDD), CI/CD and Simple Design Concepts."}
{"text": "Extensive experience in writing JUnit test cases using selenium Web driver and experience in implementing data driven and keyword driven frameworks."}
{"text": "Hands on experience using the version controls SVN, GIT and used JIRA for project management."}
{"text": "Experience in Creating Store procedures and functions in Sql server to import data in to Elastic Search and converting relational data in to documents."}
{"text": "Experience in creating Docker containers leveraging existing Linux Containers and AMI's in addition to creating Docker containers from scratch."}
{"text": "Worked on AWS for continuous integration of files to the UI and worked for the backend development using Node.js and Mongo DB."}
{"text": "Use of Amazon web services SNS, EC2, S3, Cloud Watch and Dynamo DB."}
{"text": "Experience in Software Development Life-Cycle (SDLC) preparing Requirement Specification documents, design documents, Test cases and Analysis, User Training documents and Technical Help documents."}
{"text": "Participate in Agile delivery teams, conduct application analysis, development and modification, and provided design recommendations for developing and integrating programs per written specifications."}
{"text": "Excellent interpersonal, communication and presentation skills. Self-starter, detail oriented, Research-oriented and customer focused."}
{"text": "\nTECHNICAL SKILLS"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE"}
{"text": ""}
{"text": "BlueCross BlueShield, Birmingham, AL\t\t                                                                 Aug 2018 – Present"}
{"text": "Java Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Defining site objectives by analyzing requirements in diverse business and technical environment; envisioning system features and functionality."}
{"text": "Design and develop user interfaces to internet/intranet applications by setting expectations and features priorities throughout development life cycle; determining design methodologies and tool sets; completing programming using java language and software products; designing and conducting tests."}
{"text": "Migrating the web applications using spring MVC and LDAP for authentication."}
{"text": "Collaborating with team to understand Java 1.8 code base migration objectives, key dependencies, code priorities, and integration points."}
{"text": "Implementing Java software programming services from struts and spring MVC."}
{"text": "Working on coding for DAOs, Controllers and developing user interfaces using JSP, JavaScript and HTML."}
{"text": "Developing controller for request, response paradigm by spring controllers using Spring-MVC."}
{"text": "Working on validated user input using regular expressions and maven to clean, compile, deploy and generate configuration files using jar, war files."}
{"text": "Working and using JDBC to connect to the database and performing the operations on the database."}
{"text": "Working on Jboss developer studio for development and Jboss server for deployment. Using Git for repository."}
{"text": "Complete applications development by coordinating requirements, schedules and activities; contributing to team meetings; troubleshooting development and production problems across multiple environments and operating platforms."}
{"text": "Designing, coding and debugging applications in Java software language. "}
{"text": "Collaborating with the team to define, design and ship features."}
{"text": "Working on bug fixing and improving application performance."}
{"text": "Identifying, fixing issues and help maintain code quality, organization and automatization."}
{"text": "Report Daily/Weekly/Monthly project status metrics and team performance metrics to different levels of management in a timely fashion."}
{"text": "Environment: HTML5, CSS2/3, JavaScript, Java, JQUERY, JSF, JSON, Eclipse and JIRA, JSON, DB2, Struts, Spring 4.x, Oracle, GIT, Node.js, Ajax, Twitter Bootstrap, Agile."}
{"text": "\nNike, Inc Hillsboro, OR\t\t\t\t\t\t                                   Oct 2017 – Jul 2018"}
{"text": "Java developer"}
{"text": "Responsibilities:"}
{"text": "Defining site objectives by analyzing requirements in diverse business and technical environment, envisioning system features and functionality."}
{"text": "Designing and developing user interfaces to internet applications by setting expectations and features priorities throughout development life cycle; determining design methodologies and tool sets, completing programming using Java language and software products; designing and conducting tests."}
{"text": "Designed and deployed XML files for Dispatcher Servlets, Application Context and Controllers to implement the Inversion of Control (IOC) module in spring. "}
{"text": "Configuring set of security policies which helps in identifying categorizing and protecting the assets on AWS, managing access to AWS resource using accounts, users and groups."}
{"text": "Involved in implementing the MVC architecture integrating spring framework and Hibernate ORM framework."}
{"text": "Experienced with developing applications with Java script, HTML, CSS3, HTML5, responsive web design, micro services based architecture, AWS, Java and REST based web services"}
{"text": "Worked on the implementation of RESTFULL web services for real-time transaction with the agile methodology."}
{"text": "Used the Node.js and AngularJS MVC Frameworks in the development of the web applications."}
{"text": "Maintain and expand AWS (Cloud Services) infrastructure using AWS Stack especially with database setup and maintenance on AWS EC2."}
{"text": "Define AWS Security Groups which acts as virtual firewalls that controlled the traffic allowed reaching one or more AWS EC2 instances. Create alarms and notifications for EC2 instances using Cloud Watch."}
{"text": "Maintaining the monitoring and alerting of production and corporate servers/storage using AWS Cloud Watch."}
{"text": "Installing the application on AWS EC2 instances and configure the storage on S3 buckets."}
{"text": "Configure of Virtual Private Cloud (VPC) with networking of subnets containing servers. "}
{"text": "Creating REST APIs using JAXRS. Used Circle CI and Git for continuous integration and delivery."}
{"text": "Implementing the Spring Boot Micro services to download and read the Customer requirement files from S3, and process those files to create the Pricing Model based by applying business logic and formulae using the Collections & Java Beans and upload the pricing models back to S3."}
{"text": "Writing in-application SQL statements and Integrate applications by designing database architecture and server scripting; "}
{"text": "Complete applications development by coordinating requirements, schedules, and activities; contributing to team meetings; troubleshooting development and production problems across multiple environments and operating platforms."}
{"text": "Worked on creating the Docker containers and Docker consoles for managing the application life cycle."}
{"text": "Perform functional, regression, and Performance Testing tests on defects to ensure resolution. "}
{"text": "Supports users by developing documentation and assistance tools."}
{"text": "Report daily/Weekly/Monthly project status metrics and team performance metrics to different levels of management in a timely fashion"}
{"text": "Environment: HTML5, CSS2/3, SASS, JavaScript, Java, JQUERY, JSF, JSON, Eclipse and Intellij, JIRA, JSON, Dynamo DB, Spring 4.x, Oracle, GIT, Node.js, Ajax, AWS, Twitter Bootstrap, Web services, Agile."}
{"text": ""}
{"text": "Catholic Health Initiatives - Lincoln, NE\t\t\t\t\t\t           Jan 2017 – Sep 2017"}
{"text": "Java Full Stack developer"}
{"text": "\nResponsibilities:"}
{"text": "Worked on basic front-end prototype and page design with HTML5/HTML, CSS3/CSS, JavaScript, JQuery, Ajax, JSON, Angular JS, and Angular 2."}
{"text": "Extensively worked with JavaScript development on both client and server side."}
{"text": "Creating cross-browser compatible and standards-compliant using AngularJS, ReactJS."}
{"text": "Used AngularJS for building web-apps and is highly efficient with PHP framework as well as using Restful services."}
{"text": "Implemented Action classes using Struts."}
{"text": "Used Angular 2 Boilerplate Arrow Functions to make code constructs easier to read."}
{"text": "Worked on token-based authentication (via JSON Web Tokens) with Angular 4 and Flask."}
{"text": "Used Circle CI and Git for continuous integration and delivery."}
{"text": "Involved in writing unit tests for the angular JS code using Mocha and Chai and written Jest cases for React code."}
{"text": "Designed and developed Node.js Application using Single Page Application Architecture."}
{"text": "Integrated with the back-end code (JSP) using JQUERY, JSON and AJAX to get and post the data to backend servers."}
{"text": "Created Typescript reusable components and services to consume REST API's using modular based architecture provided by Angular 2"}
{"text": "Used NodeJS to translate and combine all necessary JS, JSX, SASS and CSS."}
{"text": "Written application level code to interact with APIs, Web Services using AngularJS, JSON and XML."}
{"text": "Used JSF framework in developing user interfaces using JSF UI Components, Validator."}
{"text": "Used Test driven approach for developing the application and implemented the unit tests using Python Unit test framework."}
{"text": "Integrated the front-end UI to the back end using Spring MVC framework."}
{"text": "Designed and developed PL/SQL batches using JAVA with connectivity to Oracle for data maintenance and handling."}
{"text": "Wrote and executed various MYSQL database queries from python using Python MySQL connector and MySQL DB package."}
{"text": "Involved in complex JIRA workflows including project workflows, screen schemes, permission scheme and notification schemes in JIRA."}
{"text": "Designed & implemented Automation Frameworks including TDD, BDD, data driven, keyword driven, and hybrid using C# and JavaScript."}
{"text": "Leverage AWS cloud based technologies allowing for centralized and remote data access."}
{"text": "Utilized Agile Methodologies (Scrum) to manage full life-cycle development of the project."}
{"text": "Environment: HTML5, CSS2/3, SASS, JavaScript, Java, QUERY, JSF, JSON, Eclipse and Dreamweaver, JIRA, JSON, Angular.JS1.5, Angular 2, Angular 4, MongoDB, JSX, Dynamo DB, Elastic Search, Circle CI, PyCharm, Spring 4.x, Struts 2.x, Oracle, GIT, Node.js, Ajax, AWS, Web services, Jasmine, Agile."}
{"text": "\nCA-One Tech Cloud Inc, CA\t\t\t\t\t\t                                    May 2016 – Dec 2016"}
{"text": "UI Developer "}
{"text": "\nResponsibilities:"}
{"text": "Designed layouts on the front-end and developed web pages for smart phones, tablets and personal desktops using HTML5, CSS3, Bootstrap, JQuery, AngularJS, JavaScript"}
{"text": "Making sure that all components of web-page are Mobile-First and delivers the same performance and functionality across all devices and operating systems (Android, IOS and Windows)."}
{"text": "Worked with backend programmers to troubleshoot Java Script related issues with front-end connectivity"}
{"text": "Implemented JQuery to improve the overall usability of the website interface."}
{"text": "Developed multiple POCs to create an interface between Backend to Frontend by using MongoDB, AngularJS and Node.js."}
{"text": "Wrote a combination of JQuery plugins, as well as completely custom JavaScript to build AJAX-driven user interface."}
{"text": "Implemented and tested the enterprise application with JQuery, Spring MVC."}
{"text": "Created and maintained the framework and layout of each portal with Cascading Style Sheets."}
{"text": "Made the Node.js EXPRESS Server consolidated with Socket.io to construct MVC framework from front-end side AngularJS to back-end MongoDB, so as to give broadcast service as well as chatting service."}
{"text": "Created and Implemented Restful Web services to provide the interface to the various clients running on both Java and Non Java applications"}
{"text": "Performed troubleshooting, fixed and deployed many Python bug fixes of the two main applications that were a main source of data for both customers and internal customer service team."}
{"text": "Developed various screens for the front end using ReactJS and used various predefined components from NPM and Redux."}
{"text": "Configure and monitor numerous MongoDB and NoSQL instances. MongoDB Schema Design using DB Ref, Manual Ref, Embedded Data Model Design."}
{"text": "Involved in the development of backend Logics or data access logic using Oracle DB & JDBC."}
{"text": "Used Ajax, JSON with JQuery for request data and response processing. Developed programs to port the XML data to database to make the website XML driven."}
{"text": "Designed the email blasts using Adobe software and then implemented them using HTML and JS."}
{"text": "Involved in configuring the GIT repository and maintain the version control using GIT."}
{"text": "Used Firebug to debug JavaScript, to analyze DOM objects of the page and to change the page layout."}
{"text": "Environment: HTML5, CSS3, SASS, LESS, AWS, JavaScript, JQuery, Backbone JS, AngularJS, React.js, Redux, Node.js, Twitter Bootstrap, Grunt, Gulp, Adobe, MongoDB, MS Office, IE 8 9 10, Firefox, Chrome, Oracle ATG, GIT, Spring AOP, Web Services."}
{"text": "Quench Soft Solutions Ltd Hyderabad, India\t\t\t\t\t                        Sep 2012 – Nov 2015"}
{"text": "Java Full Stack developer"}
{"text": "\nResponsibilities:"}
{"text": "Involved in analysis, design and development and testing phases of the application development using Agile Scrum methodology."}
{"text": "Implemented entire application using Core java, java Collections and Spring MVC design framework. "}
{"text": "Designed and deployed XML files for Dispatcher Servlets, Application Context and Controllers to implement the Inversion of Control (IOC) module in spring. "}
{"text": "Designed and developed queries using SQL and named queries, criterion API’s and also Created one-to-one and one-to many relationship using Hibernate and created hibernate mapping files."}
{"text": "Extremely used plain JavaScript and jQuery to do the client side validations."}
{"text": "Used RAD as the IDE and deployed the application on Web Sphere application server 8.0 version."}
{"text": "Building and compiling the existing source code on the new environment. Analyzing the migration flexibility of existing source code on the new environment."}
{"text": "Designed and developed Application based on Struts Framework using MVC design pattern. "}
{"text": "Used Log4j to provide central logging facility. "}
{"text": "Used Serena Dimensions for Source code version control."}
{"text": "Design and Implemented SOAP Web Services to provide the interface to the various clients running on both Java and Non Java applications."}
{"text": "Developed service layer under the guidance of Service Oriented Architecture SOA, published service as web services."}
{"text": "Used Test driven methods to improve the code and find defects in the code. "}
{"text": "Involved in creating, modifying and updating database tables in DB2 using the tools like DB Visualizer."}
{"text": "Involved in discussions with the testing teams to see the tasks accomplished meets the Acceptance Criteria of the product owners."}
{"text": "Used TDD to run the tests and refactor code to pass the test."}
{"text": "Participated in Retrospective meetings after every sprint to discuss about the overall ranking of the pervious sprint and to discuss about the drawbacks and scope for development."}
{"text": "Used Lync notes to communicate with the team mates, schedule meeting, and share the workstation for same time screen sharing."}
{"text": "Environment: Java 1.6, DB2, JSP, Servlet, Rapid Application Developer, WebSphere Application Server 8.0, Spring 2.5 MVC, Hibernate, Struts 1.x, SOA, JUnit, TDD, DB Visualizer, SOAPUI 4.0."}
{"text": "\nCrane Global Solutions Ltd Hyderabad, India\t\t\t\t\t          Jun 2010 – Aug 2012"}
{"text": "Java developer"}
{"text": "\nResponsibilities:"}
{"text": "Involved in developing a new tool using java servlets in Eclipse. This would help me out in creating all the respective options wherein we can connect from one functionality to another functionality that is inter servlet calls."}
{"text": "The functionalities of this tool involved adding, deleting, updating, bulk updating and bulk deleting of the users. All of these functionalities have been done using java servlets."}
{"text": "Involved in the designing of Java Server Pages (JSP) required for the application."}
{"text": "Involved in the unit testing of the application."}
{"text": "Developed web pages with functionalities like login, register, forget password, Email, Filters using Java Script, JQuery and HTML."}
{"text": "Used JavaScript and XML to update a portion of a web page thus reducing bandwidth usage and load time and add modal dialog in web pages to get user input and requests."}
{"text": "Test Cross Browser compatibility."}
{"text": "Implemented Action classes using Struts."}
{"text": "Fetch data using AJAX."}
{"text": "Coded JavaScript for page functionality and Pop up Screens and used DHTML to make dropdown menus on web pages and display part of a web page upon user request."}
{"text": "Implementing the business logic required for the application."}
{"text": "Developed JSPs and Servlets to dynamically generate HTML and display the data to the client side. Extensively used JSP tag libraries."}
{"text": "Involved in implementing the MVC architecture integrating spring framework and Hibernate ORM framework."}
{"text": "Developed the code according to the functional specifications, detailed design, and coding and efficiency standards. Execute the unit test cases"}
{"text": "Developed Ant builds script and ant task classes to clean compile, copy, run, and doc, deploy, jar, war and ear files, and develop web services."}
{"text": "Environment: HTML, JavaScript, CSS, JSP, API, MVC"}
{"text": ""}