{"text": "Name: dorothy dorothy"}
{"text": "E-Mail: dorothy.dorothy@gmail.com"}
{"text": "Address: Hanoi, Vietnam"}
{"text": "Github: https://github.com/dorothy"}
{"text": "LinkedIn: https://linkedin.com/dorothy"}
{"text": "Phone No. 626185069203"}
{"text": "SUMMARY"}
{"text": "Over 7+ years of Experienced  Sr. Business Analyst/ Data Analyst   and functional design, coordination, testing, reporting, acceptance, and Agile Scrum methodology strong knowledge of System Development Life Cycle (SDLC) using Waterfall "}
{"text": "Extensive knowledge of Object Oriented Analysis and Design (OOAD) using UML and Rational Unified Process (RUP).  "}
{"text": "Thorough Knowledge of implementing RUP in all the phases Inception, Elaboration, Construction and Transition of a project. "}
{"text": "Proficient in identifying, documenting and analyzing business requirements specifications (BRS), System Design Specifications (SDS) and Software Requirement Specification (SRS). "}
{"text": "Three years of payer healthcare with healthcare mandate implementation 4010 to 5010 & ICD9 to ICD10, Medicare, Medicaid, PBM and Affordable Care Act 2010/Obama Care areas."}
{"text": "Expertise in B2B standards, Implementation of Integrated EDI and XML applications and Enterprise Application Integration (EAI) for business processes across applications."}
{"text": "Strong understanding of various SDLC methodologies such as RUP, Waterfall and Agile with hands on experience in all of them"}
{"text": "Work collaboratively across geography with business stakeholders and cross-functional team to deliver projects as per Scrum’s Rules, Roles, Artifacts and Events. "}
{"text": "Experienced in documenting requirement using Unified Modeling Language (Use Case and Activity Diagrams). Also building business Process Flow, Context Diagrams, Sequence Diagram, Activity Diagrams, Class Diagrams using Rational tools and Microsoft Visio"}
{"text": "Knowledge in the ETL (Extract, Transform and Load) of data into a data ware house/date mart and Business Intelligence (BI) tools like Business Objects Modules (Reporter, Supervisor, Designer, and Web Intelligence)."}
{"text": "Extensive exposure in business and systems analysis roles identifying problems and/or opportunities and defining solutions through direct involvement in all facets of the software development project lifecycle and thorough experience in client interaction"}
{"text": "Sound knowledge of Patient Protection and Affordable Care Act (PPACA), HIX (Health Insurance Exchange), Sarbanes-Oxley Act (SOX), ACORD, SOPs (Standard operating Procedures) and forms, GMP’s terms and Practices"}
{"text": "Proficient in creating UML diagrams including Use Case Diagrams, Behavioral Diagrams (Sequence Diagrams, Collaboration Diagrams, Activity Diagrams and State Chart Diagrams), Class Diagrams and Data Flow Diagrams (DFD)."}
{"text": "Hands on experience in business analysis, eliciting requirements, translating, simplifying requirements and producing project feasibility reports."}
{"text": "Detail oriented and strong project management skills coupled with excellent knowledge of SDLC, Agile Processes and SCRUM."}
{"text": "Managed multiple projects concurrently by effective liaising with the functional, technical, infrastructure teams and end users in delivering project in agreed upon time schedules and within budgets.  "}
{"text": "TECHNICAL SKILLS"}
{"text": "Business Skills: Business Process Analysis & Design, Gap Analysis, Impact Analysis, JAD/JRP Sessions Requirement Gathering, and Use Case Modeling"}
{"text": "Scrum Master / Agile Project Manager, UML, Visio, RUP, Waterfall, Data flows, SDLC"}
{"text": "Languages: C, C++, SQL, PL/SQL, HTML and XML"}
{"text": "Management Tools: Clear Quest, Clear Case, MS Visio, Rational Rose, and Requisite Pro"}
{"text": "Testing Tools: HP Quality Center, Win Runner , Clear Quest Rally, SSIS"}
{"text": "Database: DB2, MS SQL Server, My SQL, MS-Access, ETL & Data Warehousing"}
{"text": "Operating Systems: Windows Vista, Windows 95/2000/XP/7, and MS-DOS"}
{"text": "Microsoft tools: MS Office Suite (Word, Excel, Power Point, Outlook), MS SharePoint, MS Visio, MS Project, and MS FrontPage"}
{"text": "PROFESSIONAL PROFILE"}
{"text": ""}
{"text": "The Health Markets group of Insurance Companies is one of America’s leading providers of affordable health insurance for the self-employed, individuals and families, as well as small businesses. develop an ODS/Data Warehouse to support its institutional equities research department. The data warehouse was being designed. This project implemented ETL process using Informatica... Reviewed and analyzed the business environment and identified process improvements."}
{"text": "\nResponsibilities"}
{"text": "Involved in requirements gathering, Analysis, Design and Develop and maintenance Phases."}
{"text": "Wrote advanced SQL queries to extract, manipulate, and/or calculate information to fulfill data and reporting requirements including identifying the tables and columns from which data is extracted. "}
{"text": "Analyzed and documented the changes in the compliance rules for adverse action redesign."}
{"text": "Used Data warehousing for Data Profiling to examine the data available (Data Analysis) in an existing database"}
{"text": "Coordinated activities with project manager and various other teams using MS Project."}
{"text": "Interacted with other Business Analysts for designing and implementation of Use Cases and Test Plans."}
{"text": "Developed a file of ACORD Forms used as the standards in all Property and Casualty markets, for both Personal and Commercial Lines of Business"}
{"text": "Involved in implementation of Business Intelligence Applications using Cogon’s and Business Objects, building Data Marts and enterprise wide Data Warehousing."}
{"text": "As Agile Scrum coordinated Sprints, from Iteration Planning thru daily scrum, and Iteration Reviews and Retrospectives.."}
{"text": "Responsible for gathering Marketing reporting requirements and functional specifications for diverse marketing tools. (Customer Segmentation, Lead scoring, Campaign performance)"}
{"text": "Responsible of the UAT process and global users support for the Multifactor Authentication application. "}
{"text": "Expertise in developing Business Intelligence and Data Warehouse applications. Creating Universes for Adhoc reporting and also for Dashboards. Creating Full Clients and Web Intelligence Reports."}
{"text": "Conducted root cause analysis and implemented new business processes by defining data flows."}
{"text": "Made rapid deployment and continuous process improvement using Open Text Business Process Management"}
{"text": "Created ICD-9-CM/ICD-10-PCS comparison document and dealt with Diagnosis Related Groups (DRGs). "}
{"text": "Involved in creating flow charts and record layouts for 271 transaction sets."}
{"text": "Designed and developed eligibility (270/271), claim status (276/277), service review and response (278), enrollment (834), and claim submission (837)."}
{"text": "Tested HIPAA regulations in Facets HIPAA privacy module."}
{"text": "Worked with FACETS Team for HIPAA Claims Validation and Verification Process (Pre-Adjudication)."}
{"text": "Worked intensively on FACETS for audit trails made on the used account and check and store information related to the HIPAA authorizations"}
{"text": "Preparation of data warehouse requirements document detailing the facts, dimensions, measures & workflow schedule so that data flows continuously through all the integrated systems."}
{"text": "Run EDI Reconciliation reports daily and document in MS Excel."}
{"text": "Utilized SQL server’s reporting services SSRS and SSIS to support reporting requirements. "}
{"text": "Used SQL tools like TOAD to run SQL queries to view and validate the data loaded into the warehouse."}
{"text": "Collaborated with technical experts and business units to determine best possible reporting mechanisms for competitive analysis of the current system to the proposed New Claim Processing System."}
{"text": "Developed Test Plans, Test Cases, Test Scripts, Test Scenarios, Test Beds and Traceability Matrix."}
{"text": "Worked with OLAP tools such as ETL, Data warehousing and Modeling."}
{"text": "Work with business representatives to understand data marts requirements, data models, data flows, Facets on-line, priorities and ensure that IT works is appropriately aligned."}
{"text": "Wide-ranging experience in using methodologies such as UML (Unified Modeling Language), Agile, RUP (Rational Unified Process) & Waterfall using rational tools and Microsoft Suite."}
{"text": "Transfer projects from Waterfall to Scrum are major responsibility."}
{"text": "Experience with data migration (ETL development), document data manipulation processes and scripts. "}
{"text": "Environment: UML, Agile Scrum, Rally, SSIS, ETL Testing Rational Requisite Pro, Rational Clear Quest, MS Office Toad, Data warehousing, MS SharePoint, MS Project, MS Visio, SQL, Oracle, HTML, Business Objects, Business Intelligence, Report"}
{"text": "Business Analyst of EDI migration Project from HIPAA 4010 version to HIPAA 5010 version. Reform, and Patient Protection and Affordable Care Act (PPACA)As, this portal was developed for Providers to perform Claim Status Inquiry transactions, Member Eligibility transactions and Pre-registration submission. The project followed Agile Scrum methodology."}
{"text": "Responsibilities"}
{"text": "Conducted user interviews, gathered requirements, and analyzed the requirements for the new health insurance product."}
{"text": "Involved in writing Test plans, Test cases and responsible for executing the Test Scripts."}
{"text": "Performed Smoke, Integration, functional, Regression, and system testing."}
{"text": "Involved in testing HIPAA EDI Transactions and mainly focused on eligibility Transactions (270,271, 834, 835, and 837). "}
{"text": "Worked extensively with Inbound 837 I and 837 P, 835 S(Out bounds) claims processing systems."}
{"text": "Mapped ICD9 to ICD10 and tested 270/271, 837 I/P/D and 835R transactions to migrate to 5010."}
{"text": "Manage and mentor offshore testing team on Agile Testing best practices"}
{"text": "Created and executed test cases for testing HIPAA compliancy using Spec Builder "}
{"text": "Established new requirements for administrative transactions with implementation in compliance with Patient protection and affordable care act (ACA).  "}
{"text": "Good knowledge about the Patient Protection and Affordable Care Act (PPACA)."}
{"text": "Validated X-12 files sent by external vendors to ensure that they are passing EDI Gateway level using Spec Builder."}
{"text": "Worked closely on 834 transaction code for Benefit Enrollment and was involved in Validation of HIPAA for 837, 270/271, 276/277,835, 834 EDI transactions for Medicaid members (MMIS)."}
{"text": "Identified Claims management Data flows, business rules and developed flow charts and activity diagrams"}
{"text": "Gathered business requirements, definition and design of the data sourcing and data flows, data quality analysis, working in conjunction with the data warehouse architect on the development of logical data models."}
{"text": "Mentored other processors on FACETS and other systems to maximize production and quality. "}
{"text": "Worked collaboratively with BI and ETL resources to design and develop effective solution.."}
{"text": "Prepared and Created Test Cases /Test Data according to 5010 Business requirements."}
{"text": "Configured Member Data via EAI tools for ID card and HIPAA Gateway for claims EDI files."}
{"text": "Tested all HIPAA transactions for multi version support (4010 and 5010) and validated the database to file elements."}
{"text": "Involved in the development of web platform for online transactions through e-commerce."}
{"text": "Implemented Data ware house strategies to build the enterprise architecture."}
{"text": "Worked with other data analysts in creating and maintaining Data functional design documents."}
{"text": "Documented a detailed Gap analysis for Financial Management Systems (FMS) "}
{"text": "Environment: EDI X12N 4010, EDI X12N 5010, ICD, MS Outlook, .Net, UNIX, Windows95/98/NT/2000/XP and Internet Explorer."}
{"text": "Business Analyst Data Analyst   ETL Processes Data Warehouse Testing, .Company deployed a new intranet site based, ETL Processes Data Warehouse Testing Mapping, Technical Specs documentation, and ETL"}
{"text": " Responsibilities"}
{"text": "Used Rally for Agile project management Helped department to improve online database of records, administration, analytics and payment systems across the boundaries of multiple institutions.  "}
{"text": "Facilitating Scrum Events (Daily scrum meetings, spring planning, spring review, and spring retrospective). "}
{"text": "Worked on Pages and themes, accordingly developed customized pages to meet the project requirements."}
{"text": " Worked With HIPAA compliant ANSI X12 837 formats for both professional claims and institutional claims."}
{"text": "Experience in calling a Web Service, through SSIS Package through the transformation, and wherein you declare a variable with its URL link "}
{"text": "Analyzed the mainframe reports for member/eligibility/claims and mapped the fields with FACETS batch jobs and reports."}
{"text": "Implemented Agile Scrum methodology for the project life cycle and scrum framework for team management."}
{"text": "Dealt with the EDI transaction 835 claims payments and remittance advice, which deals the payment from payer to provider. "}
{"text": "Checked inbound/outbound HIPPA regulated EDI transactions facets"}
{"text": "Conducting business validations, covering the following deliverables FACETS Providers, Facets Claims and Facets Membership and Operational reports"}
{"text": "Expertise in broad range of technologies, including business process tools such as Microsoft Project, Primavera, MS Access, MS Visio, technical assessment tools, Data Warehousing concepts and web design and development."}
{"text": "Tested the ETL Informatics mappings and other ETL Processes (Data Warehouse Testing).."}
{"text": "Created ensuing use cases, report requirements/templates, scope documents, issue tracking and project plans in an Agile environment"}
{"text": "Developed SQL scripts and wrote stored procedures to validate the flow of data from Legacy source to target application database and ability to perform data validation (of ETL processes, schema and DDL check, data flow from data warehouse to application databases, data marts, return marts, referential data, repositories)."}
{"text": "Taking daily SCRUM and progress meetings with all the teams and update the MS- Projects."}
{"text": "Excellent knowledge on Data warehousing concepts - Star schema, Snow-flake Schema and worked on both OLAP and OLTP databases. "}
{"text": "Used Agile’s scrum framework, for managing the software application development project."}
{"text": "Environment:, Waterfall, Agile (Scrum)framework J2EE, MS Visio, Microsoft Project, GUI, Excel, SOA, Word, HP Quality Center. IBM Mainframe, ETL"}
{"text": "provides customers with employee benefits and services that improve the health, well-being and productivity of their employees, Responsible for the project management activities of a web application including"}
{"text": "Responsibilities"}
{"text": "Performed analysis, review, and estimation of client requests; prepared and reviewed system requirements and client documentation."}
{"text": "Aided management in standardizing Web applications by preparing GUI standards and recommending alternatives for incorporation in phased, iterative manner."}
{"text": "Produced functional specifications and led weekly meetings with developers and business units to discuss outstanding technical issues and deadlines that had to be met."}
{"text": "Structured the Database and Wrote requirements for designing Data Marts that were used as the source for the various reporting systems in the company."}
{"text": "Responsible for the project management activities of a web application including call center application, data warehousing, customer relationship management,"}
{"text": "Involved in mentoring specific projects in application of the new SDLC based on the Agile Scrum and Rational Unified Process, especially from the project management, requirements and architecture perspectives."}
{"text": "Prepared interview questionnaires for the users and gathered requirements to writing specifications and shaping the software development process."}
{"text": "Prepared and maintained Requirement Traceability Matrix (RTM) including both functional and non-functional requirement "}
{"text": "Ensure that the ICD-9-CM diagnosis and procedure codes & CPT codes requirements are appropriately incorporated in the COB systems."}
{"text": "Used FACETS Analytics for fast and easy retrieval, display and grouping of"}
{"text": "Using Shared Containers and creating reusable components for local and shared use in the ETL process."}
{"text": "Worked with FACETS, Facets are extended enterprise of Trizetto's solution to assist payer organizations in staying ahead of trends in the employer benefits market. "}
{"text": "Coordinated with all stakeholders of the projects to update them about the progress of the project, reviewed the developments, discuss change requests, and obtained approvals"}
{"text": "Environment: MS Projects, MS Visio, MS Word, MS Excel, MS PowerPoint, MS Outlook, UML, Windows , SQL, Rational Rose"}
{"text": ""}
{"text": "The web based application is related to bending the cost of care curve while improving the health and wellbeing of the people. This allows its clients to meet the requirements of Affordable Care Act mandates, to implement member engagement and retention strategies, customized benefit packages  as per to the needs of groups and individuals. T"}
{"text": "Responsibilities:  "}
{"text": "Involved in all aspects of project deliverables starting from Strategy & Process defining to Design Documentation followed by SAP HCM Configuration, Unit Testing, Integration, Regression Testing, User acceptance testing (UAT), Legacy Data conversion/Data Migration, end/Power User Training."}
{"text": "Primary liaison between Business users, the Technology group during the redesign of the processing for sales, resulting in process understanding and cooperation during testing and approval stages."}
{"text": "Analyze business rules to develop wireframes for pages in HTML to assist in UI design."}
{"text": "Conducted  Onsite-Offshore Status Meetings on regular basis  and co-ordinate to perform BRD related activities"}
{"text": "Documented the Use Cases and Activity diagrams using MS Visio to understand the requirements and communicate them to the development team. "}
{"text": "Implemented an integrated RUP solution with complete line of traceability for all the artifacts of web development projects. "}
{"text": "Involved in the creation and maintenance of the Workflow plans and artifacts."}
{"text": "Designed workflows for the new corporate tool (COTS product) based on the capability project for the initial release and to see that the minimum business requirements were met"}
{"text": "Performed Data Analysis and design development using SAS/ Stat procedures and MS Excel. "}
{"text": "Involved in reviewing complex SQL queries, views, functions and stored procedures and spotting issues before/during code migration. "}
{"text": "Worked with the UI team to create the User Interface screenshots to be presented to the Business. "}
{"text": "Reviewed, analyzed and modeled Test plans and Test procedures based on RUP methodology. "}
{"text": "Performed Gap analysis for the modules in production, conducted feasibility study and performed impact analysis for proposed enhancements. "}
{"text": "Used Rational Rose to visually determine the proper structure, key elements and optimal design for the database and to aid efficient creation of tables and storing procedures. "}
{"text": "Performed User Acceptance Testing (UAT) to test the functionality of the application."}
{"text": "Environment: Windows, MS Access, UML, Quality Center Use Case Analysis, SAS MS Visio, Rational Rose, MS Office  Suites, MS Excel, "}