{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Fuyang, China"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 892472870274"}
{"text": "Summary"}
{"text": "Over All 7 years of experience as a Business Analyst and consulting background with in-depth knowledge in HealthCare  and IVR domain and with expertise in technology-oriented projects in a fast paced dynamic environment with exceptional skills in risk management, conflict resolution, team building, business process analysis, and staff management."}
{"text": "Proven Project Management and Business Analysis experience of software development life cycle (SDLC) – Rational Unified Process (RUP), Waterfall and Agile."}
{"text": "Knowledge of quality management initiatives such as Lean Six Sigma and CMM and project management methodologies such as Prince2 (Projects in a Controlled Environments) and PMBOK.  "}
{"text": " Documentation, General System Design and Detailed System Design Documentation, conducting JAD and JAR sessions of project life cycle"}
{"text": "Planned, organized & implemented three HIPAA NPI (National Provider Identifier) projects "}
{"text": "Good knowledge of Health Insurance Plans and experienced in determining the membership eligibility, billing experience within life and disability in health plans with thorough understanding of CPT coding, CMS-1500 claim forms and reimbursement forms."}
{"text": "Proficient in writing Project Charter, Project Plan, Quality Assurance and Release Management Plan."}
{"text": "Conducted numerous Project Kick-off meeting and Project Close Retrospectives."}
{"text": "Excellent understanding and experiences in Agile Methodology – SCRUM creating user stories"}
{"text": "Expert in Tracking and Managing the Requirements using Requirement Traceability Matrix (RTM) that controls numerous artifacts produced by the teams across the deliverables for a project."}
{"text": "Strong expertise in conducting Joint Application Development / Requirements (JAD/JAR) sessions for requirements gathering, analysis, design and Rapid Application Development (RAD) sessions to"}
{"text": "Thorough understanding on the reporting tools such as Business Intelligence (BI), Business Objects (BO), Data warehousing concepts, Data Modeling techniques such as Entity-Relationship modeling, Unified Modeling Language (UML) and Dimensional Modeling."}
{"text": "Provided data modeling support for numerous strategic application development projects."}
{"text": "Managed Work Breakdown Structure (WBS), project size and resource allocation optimization."}
{"text": ""}
{"text": "Technical Skills"}
{"text": "Operating System: Windows 8/7/Vista, AIX, Sun Solaris, Linux, UNIX"}
{"text": "Database: MS-Access, My SQL, DB2, Teradata, Oracle Applications, SYBASE, SQL Server  "}
{"text": "Methodologies: SDLC-Waterfall Model, Object Oriented Analysis and Design (OOAD), Agile/ Scrum, Rational Unified Process (RUP), V-Model, Rapid Application Development (RAD), Joint Application Development (JAD)"}
{"text": "UML Diagrams: Structure Diagram- Class amp; Object Diagram; Behavior Diagram- Use Case, Activity, Sequence. "}
{"text": "Requirement and Test: Rational Requisite pro, RSA (Rational software Architect, Rational Case Test Manager and Quality Centre) "}
{"text": "Testing tools:  Mercury interactive tools- Win Runner, Test Director, Load Runner Quick Test pro."}
{"text": " Web technologies: HTML, DHTML, XML, ASP.Net, JSP, J2EE, VB.Net, Macromedia Dream Weaver, MS-Front Page"}
{"text": "MS Office Suite: MS Word, MS Excel, MS PowerPoint, MS Project"}
{"text": "Modeling tools: MS-Visio, Rational Rose, MS-share point, ERwin"}
{"text": "Reporting tools: Business objects (Reporter, Designer, Supervisor/CMC, Info View, Broad cast Agent, Application Foundation, Performance Manager) and Crystal Reports, SQL Server, XML Spy"}
{"text": "Professional Experience"}
{"text": ""}
{"text": "H & R Block, Kansas City, MO\t Sr. Business Analyst - IVR  Apr-2014-Sep-2015"}
{"text": "This project dealt with the development of a Customer contact Center system develops in NORTEL Interactive voice response (IVR). Involve in documenting and testing the functionalities for Speech recognition application includes voice dialing and call routing to make the process easy for switch translators. The main purpose for this development is designed an application to match the customer experience of the web interface, service high call volumes, reduce cost and improve the customer experience over this technology.  "}
{"text": "Responsibilities:"}
{"text": "Interviewed SME (Subject Matter Experts) and asked detailed questions and carefully recorded the requirements for Interactive voice response (IVR) application which can be review and understood by both Business People and Technical People."}
{"text": "Managed installation of the Field IVR."}
{"text": "HRB completely renovated their existing IVR and invoked the new Field IVR application into it to assist in their agents taking 30-40% less calls during tax season."}
{"text": "Accountable for project initiation and planning, and for overseeing development, testing, implementation, and closeout. This includes initial project planning efforts such as developing the project scope, defining project guidelines, obtaining business and IT sponsor approvals, and coordinating the resources necessary to successfully complete the project."}
{"text": "Responsible for communicating major milestones, identifying potential project risks, providing continuing direction to the project team, and conduct regular status meetings to review project activities."}
{"text": "Prioritized procedures for changing scope and project acceptance procedures."}
{"text": "Assured that project efforts met customer expectations for agreed upon schedule, cost and objectives."}
{"text": "This consisted of two daily conference calls with AT&T Voice Tone Team, and the HRB project team to ensure that telecommunication needs were met."}
{"text": "Spearheaded adding a SCRUM room for projects so that everything could be tracked on the wall as it took place and was all readily available for anyone on management team to review it quickly for the status."}
{"text": "Desktop Terminal server solution in an upgraded data center where we added 20 additional"}
{"text": "Provided daily status reports sent out to management/AT&T for the following day(s) meeting as well as make a presentation once/month to management on the progress of the project. This would include any risk factors associated with the project that could cause it to fall behind. This included managing the testing of IVR phase roll-outs and testing of the application."}
{"text": "Managed testing CTI (Computer Telephony Interface) and IVR functionality."}
{"text": "Managed setting up all processes for TFN`s change order management, validating all TFN`s, and all routing was correct for this project."}
{"text": "Managed validation of 2000+ TFN`s for HRB to validate carrier, usage, billing, location, etc."}
{"text": "Performed regression testing on different builds deployed on a weekly basis"}
{"text": "Worked closely with development and other testing groups"}
{"text": "Reported the defects and documented the defects"}
{"text": "Implemented and Tested IVR scripts on different systems"}
{"text": "Created scripts in quality center for VRU testing based on business requirements"}
{"text": "Performed manual testing of VRU which included Call routing, Call monitoring"}
{"text": "Positive and Negative testing of VRU based on business requirements"}
{"text": "Managed (Trifecta) management of call center groups (Supportability, Reporting, WFM, Forecasting, & Vendor Management) the operational impacts they have experienced in detail over the past year of utilizing a Vendor controlled call center vs. an HRB on-site call center. (Avaya, Vendor Switch or Hosted ACD)"}
{"text": "Environments: data center UML,RUP, Rational Requisite Pro, Rational Rose, Rational Clear Quest, Excel, SQL, DB2, Crystal report, HP Quality Center"}
{"text": "Dell Financial Services, Austin, TX \tBusiness Analyst – May-2012-Mar-2014\nCall Center Management System The project involved the implementing an ACD system. Distributing calls to the appropriate individuals and groups is a critical function of the phone system. The aim was to integrate the ACD system with the IVR system to provide a very sophisticated call distribution process. \nThe existing ACD systems channels incoming phone calls on a first come / first serve basis. The new intelligent ACD can route calls based upon caller identification, dialed number, time of day, and custom defined parameters established in the IVR (Interactive Voice Response) program script. "}
{"text": "Responsibilities:"}
{"text": "Involved in all phases of software development life cycle (SDLC) in AGILE framework. "}
{"text": "Analyzed and collected business requirements, identified system interfaces and created the requirements specification document. "}
{"text": "Applied Unified Modeling Language (UML) methodologies to design Communication Diagram, Use Case Diagrams, Activity Diagrams, Sequence Diagram and ER diagrams. "}
{"text": "Extensively interacted with both user group and development team. "}
{"text": "I worked on a level one helpdesk for Intuit doing call center tech support for QuickBooks."}
{"text": "Managed and tracked change control process of requirements and design changes. Documented the changes, issues and their impact on the system design and delivery. "}
{"text": "Involved in the formulation of Business Requirements Document (BRD) for IVR."}
{"text": "Documented the server farm requirements and requirements related to security within Share Point and using Windows Active Directory. "}
{"text": "Provided documentation such as requirements management plans, functional requirements, test plans and test cases. "}
{"text": "Incorporated the best practice methodologies as advocated by the Rational Unified Process. "}
{"text": "Designed custom VUI, IVR, CTI, middleware, and Web applications."}
{"text": "Designed and analyzed Business Process Model, Use Case model and test procedures based on AGILE methodology. "}
{"text": "Performed requirement analysis by gathering both functional and non-functional requirements based on interactions with the process owners & stake holders and document analysis. Performed user interviews. "}
{"text": "Worked extensively with MS Project for resource management and allocation "}
{"text": "Worked with MS Power Point for presentations "}
{"text": "Used Rational Clear Quest and Clear Case for Change Management and Configuration Management. "}
{"text": "Wrote user requirements specification (URS) and Functional requirements specification (FRS) Documents as per the Business requirements and process flow. "}
{"text": "Performed Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data within the Oracle database "}
{"text": "Extensive use of MS Office tools like MS Access, MS Word, MS Excel, MS PowerPoint MS Project for data migration in to the CI System Knowledge Data Base in MS Share Point. "}
{"text": "Design and Implement Enterprise, End User and Data Center Automation. "}
{"text": "Involved in Quality Assurance maintaining Software quality standards and Software quality Matrices "}
{"text": "Designed and developed project templates based on AGILE Methodology "}
{"text": "Developed UML Use Cases for the application and prepared the detailed Work flow diagram based on the proposed enhancement for the system. "}
{"text": "Developed modules in the HR department for educating and training the user about the new system. "}
{"text": "Acted as User Acceptance Testing coordinator and monitored business testing and interfaced with the development team regarding defect status and fixes on daily basis."}
{"text": "Environment:  MS Visio, SDLC, data center, UML, Rational Clear Quest, Rational Clear Case, Rational Tools Suite, AGILE methodology, Windows, XML, HTML"}
{"text": ""}
{"text": "Aetna Inc., Hartford, CT        \t\tBusiness Analyst – IVR   Jul-2010-Apr-2012"}
{"text": "Aetna has developed Next Generation Service Node (NGSN) for providing advanced Interactive Voice Response (IVR) services within a telecommunications network. The service execution environment functions within next generation service node (NGSN) IVR platform in telecommunications network."}
{"text": "Responsibilities:"}
{"text": "Completed multiple business service requests to correct or expand functionality within the IVR.  Understood business problems and translate them into requirements which lead to a higher closure rate."}
{"text": "Worked directly with technical team to ensure changes can be made to meet the requirements."}
{"text": "Lead BA on compliance (CORE) requirements.  Ensured data was presented to front end systems consistently based rules and on multiple benefit design structures."}
{"text": "Participated in multiple areas of testing: performance, integration, QA, UAT and production.  Contributed in daily defect meetings to triaged and help resolved open issues."}
{"text": "Created business workflows on the claims module for the client to get a better understanding of the software and prepared a detailed BRD including all functional and non-functional requirements."}
{"text": "Performed the Gap analyses of the earlier systems, generated a detailed Requirements document describing new system architecture through Use Cases and Activity diagrams. Specifications, Documentation and Construction of systems heavily relied on UML."}
{"text": "Wrote standard and complex SQL queries using MS SQL Server and also in Mainframe for data validation process."}
{"text": "Coordinated Usability testing for a new application of IVR. Worked with third party to synchronize test scenarios, test participants and meetings minutes."}
{"text": "Tackled daily production items that needed to be addressed immediately.  Researched and documented where the failure occurred and worked with the development team to resolve the open issue and bring it to closure."}
{"text": "Implemented Rational Unified Process (RUP) as the software development methodology."}
{"text": "Served as a day-to-day mentor to provide guidance and training as an IVR application and subject matter expert."}
{"text": "Environment: MS Project, MS Office, Rational Requisite Pro, Clear Case, Clear Quest, "}
{"text": ""}
{"text": "Mutual of Omaha, Omaha, NE                                             Business Analyst        Sep-2008-Jun- 2010  \nProject: Founded in 1909, Mutual of Omaha is a solid, family-oriented company that is reliable, trustworthy, and knowledgeable. It is a full-service, multi-line provider of insurance and financial services products for individuals, businesses and groups throughout the United States. The project was about implementation of a new processing system for Benefit Enrollment files (834) and Payer and Claims (837) along with review, design and reconfigure of the following FACETS functional areas: Enrollment, Claim, Billing, Provider and Member Information."}
{"text": "Responsibilities: "}
{"text": "Participated in creating Facets data model."}
{"text": "Worked on the EDI 834-file load to Facets through MMS (Membership Maintenance Sub-system)"}
{"text": "Performed requirement gathering by interacting with business users and documented the requirements"}
{"text": "Worked with business users and solution engineers to solve the capture defects in the MMS system and to effectively solve them."}
{"text": "Performed Data Mapping to map the EDI 834 data to XML."}
{"text": "Worked on solving the errors of EDI 834 load to Facets through MMS."}
{"text": "Conducted JAD Sessions, Peer Review sessions with the SMEs, Solution Engineers, developers, Business users."}
{"text": "Analyzed  the  scope  of  the  project  to  review  it  with  the  customers  for  different  review  sessions  of  the application."}
{"text": "Experienced in X12 transactions 835/837/834/820/271 of medical claims/underwriting for support and point of reference for the vendor in business issues."}
{"text": "Intensively involved in project testing efforts by helping testers perform System Integration Testing, Regression Testing and by helping UAT team in User Acceptance Testing (UAT)"}
{"text": "Used to execute test cases for several transactions such as 837, 835, 820, 834, 277, 278, 270/271"}
{"text": "Created SQL queries to read data from databases."}
{"text": "Performed GAP analysis for EDI transactions such as 837, 834 to support state specified X12 5010 file formats."}
{"text": "Executed Test cases manually by composing 270, 276,837 EDI files and dropped inbound and check response 271,277,835 using interleaves and outbound."}
{"text": "Performed Data Mapping to map the EDI 834 data to XML."}
{"text": "Worked on EDI 834, 835,837 as per HIPPA guidelines."}
{"text": "Requirements Gathering & Analysis always ensured HIPAA  Compliance Auditing"}
{"text": "Worked with the Testing team to test the system extensively and log defects."}
{"text": "Defined the maps from the existing BizTalk solution and validated it with the client for any changes."}
{"text": "Performed data mapping and tracing data from system to system in order to solve a given business or system problem."}
{"text": "Environment: Ms Office Tools, MS Project, MS-PowerPoint, SQL Server 2005, XML, Mercury Quality Center, Agile framework."}