{"text": "Name: katherine katherine"}
{"text": "E-Mail: katherine.katherine@gmail.com"}
{"text": "Address: Jinan, China"}
{"text": "Github: https://github.com/katherine"}
{"text": "LinkedIn: https://linkedin.com/katherine"}
{"text": "Phone No. 437224564579"}
{"text": "                 "}
{"text": "                                                                                          "}
{"text": "Business Analyst/ Business System Analyst with over 8 years of experience, primarily in Capital Market, Retail Banking, Insurance industries. Experience in co-coordinating with business and IT across all phases of software development life cycle. "}
{"text": "Strong knowledge of Software Development Life Cycle (SDLC) methodologies like Agile, Waterfall & Rational Unified Process (RUP), "}
{"text": "Expertise in gathering, analyzing and documenting business requirements and developing Business Requirement Documents(BRD), Functional Requirement Documents(FRD), Technical Requirement Documents(TRD), System Specification Documents( SSD), UAT Documents & Non Functional Requirement Documents"}
{"text": "Expertise in UML ( Use case Diagrams, Activity Diagrams, Sequence Diagrams )"}
{"text": "Hands on Experience with Rational Rose, Rational Requisite Pro, Rational Clear quest and MS Visio"}
{"text": "Hands on experience in writing Use Cases, User Stories"}
{"text": "Skilled in the implementation of business practices like Project management, Business Process Re-engineering (BPR), Business process streamlining, Process optimization, Process mapping etc"}
{"text": "Experience facilitating JAD sessions and walkthrough sessions"}
{"text": "Hands on experience in change management process"}
{"text": "Extensive experience in Functional Requirement Gathering and Gap Analysis( As Is, To Be) in various projects at the client’s site"}
{"text": "Served as a liaison between business sponsors and technical staff while taking on the key responsibilities of managing expectations of business users"}
{"text": "Extensive hands on SQL Query skills using different databases"}
{"text": "Extensive experience in data mapping, data modeling, data analysis artifacts and documentations"}
{"text": "Expertise in writing and implementing Test scenarios, Test cases, Integration System testing and maintaining Requirement Traceability Matrices (RTM) for baseline documents. Performed User Acceptance Test (UAT) by working with internal and external users/customers and obtained delivery approval of the project"}
{"text": "Experience in Capital Market pertains to Risk Management & Reference Data with in depth knowledge in Stocks, Bonds, Options, Futures, Forwards, Swaps, Etfs, Mortgage Backed Securities, CDS and CDO’s & pricing of all financial instrument"}
{"text": "Experience in Retail Banking domain pertains to Credit Card offers, Debit Card offers & Other  LOB’s offers"}
{"text": "Experience in Insurance domain pertains to policy issuance"}
{"text": "Exceptional presentation skills including verbal and written skills, and flexibility in adapting to new relevant information and changes"}
{"text": "Highly organized with the ability to multitask and great time management skills to meet deadlines"}
{"text": ""}
{"text": "                                                                                                                   .                                                                                                                                                                                                                                                                                                                                                        "}
{"text": ""}
{"text": "Tools"}
{"text": "      "}
{"text": ""}
{"text": "Role: Business System Analyst "}
{"text": "Client: Nomura Holdings Inc, Charlotte, NC                                                                 \t\t\t Jan 2014- Present"}
{"text": "Nomura Holdings, Inc is a Japanese financial holding company, and a principal member of the Nomura Group. Project Profile: The project is about INHOUSE eRISK software protocol meant to automate the process for decision-making , review of their financial services to keep track of historical data, Statistics, Market Data, Evaluation on Investments, Fixed Income, Derivates and also to make enhancements in the credit risk management system to prepare detailed analysis by utilizing sophisticated modeling and statistical techniques to predict, evaluate and manage the credit risk in the Bank's various loan portfolios. This application is both for front-end as well as back-end users and even web based."}
{"text": ""}
{"text": " Responsibilities:"}
{"text": "Responsible for Gathering Requirements from the Quantitative Risk Analysts and Portfolio Managers to produce Business and Functional Requirements for Risk Management Application"}
{"text": "Responsible for regular interaction with the Equities, Fixed Income & Foreign Exchange Division to gather Market Data to base the Market Risk Analysis"}
{"text": "Defined the functions and features of the application by designing the functional behavior of the system from the business perspective to simplify the purpose of the system"}
{"text": "Created analytical models that estimate future credit risk and losses at the account level for all existing and prospective loan products"}
{"text": "Managed requirement activities using an iterative and incremental Agile methodology."}
{"text": "Developed and reviewed strategies using the various risk scores such as credit bureau, application, behavior, bankruptcy and USAA relationship scores"}
{"text": "Developed risk tracking analysis and risk performance measures, such as custom score cards, for all Bank loan products"}
{"text": "Elicited, analyzed, documented and communicated requirements for implementation and build outs of SharePoint"}
{"text": "Hands on experience with Basel II "}
{"text": "Handled various SQL queries for data manipulations"}
{"text": "Responsible for assisting the Quality Assurance team to create the test plan, testing scenarios and test cases for functional, non-functional and UAT testing"}
{"text": "Facilitated the off-site development team with eMeetings to clarify requirements"}
{"text": "Interaction with stakeholders to gather functional and non-functional requirements and represent them in Requirement Traceability Matrix"}
{"text": "Performed Feasibility Analysis for the proposal of the new system"}
{"text": "Conducted Gap Analysis to show the current and proposed functionalities of the system"}
{"text": "Use of Active Directory to assign policies, deploy software, and apply critical updates to the organization"}
{"text": "Wrote test plans and test cases of the business process or application"}
{"text": "Analyzed the strategies of Fixed Income and Derivatives in the investment division and conducted Portfolio Performance measurement: return, calculation, attribution"}
{"text": "Environment: Windows XP, Oracle 10g/11g, SQL Server, Toad, Agile, Microsoft Office Suite 2003, MS Visio"}
{"text": ""}
{"text": "Role: Business Analyst"}
{"text": "Client: Countrywide Financial Corporation, Calabasas, CA                                     \t\t\t July 2012 – Dec 2013 "}
{"text": ""}
{"text": "Founded in 1969, Countrywide Financial Corporation is a leading provider of consumer and business-to-business financial services. Countrywide is one of the nation's leading retail mortgage banking companies. They are in the business of making, servicing and selling non-prime loans. "}
{"text": "The client objective was up gradation and maintenance of its Mortgage Application System. The Mortgage product is fully integrated, Web-centric, real-time mortgage servicing solution that automates all mortgage servicing processes from loan origination, credit appraisal, credit enhancement, Escrow management, Foreclosure and payment processing. Our team worked with all the concerned business areas and was responsible for successfully provisioning the project from inception until transition to the bank."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Extensive experience in Conducting Market Research, Feasibility Studies, Data Analyses, System Analyses, Gap Analyses, and Risks Analyses."}
{"text": "Gathering market data including real time and historical price data, financial data, and trading news using financial data source named Bloomberg."}
{"text": "Responsible for documentation of the Functional/Technical Specifications. Intense use of Microsoft Word and Excel."}
{"text": "Developed test plans with QA team and helped test every scenario using Mercury  Test Director Tool for system testing"}
{"text": "Worked on documenting Business partner's requirements for UI and batch interfaces for the Merchandising and financial planning tool using Agile Methodologies along with Use Case and traceability matrix. "}
{"text": "Evaluation of vendor components for accounting engine (Geneva accounting engine for position management & tax lots, also exposure to FTI accounting engine/database) & data repository (Eagle Pace financial data warehouse) to ensure technical fit with targeted application and enterprise standards. Deep understanding of Structured System Development Methodologies"}
{"text": "Collaborated with External Auditors and documented SOX compliance requirements"}
{"text": "Assisted Project Management in developing Scope/ Vision Documentation and Project Plan, tracking project process, and developed Risk Mitigation Plan."}
{"text": "Performed root cause analysis on defects found through system, user acceptance and regression testing."}
{"text": "Developed functional Requirements document, design specification document and Testing strategy document"}
{"text": "Worked extensively in Data Analysis, Data Reconciliation and Data Mapping for ETL process"}
{"text": "Gained in-depth knowledge and experience in pricing, inventory, procurement, time & attendance, barcode, EFT, credit cards, and handheld wireless technology in mainframe, client/server and web based environments."}
{"text": "Used Soft-Test software with pseudo code to ensure test cases covered all branches of project's code impacting the system. (The system is an IBM mainframe based system that contains the master set of customer information used to bill customers.)"}
{"text": "Established a RUP (Rational Unified Process) centric business analysis methodology. "}
{"text": "Designed and developed Project document templates based on SDLC methodology."}
{"text": "Helped with data modeling and defining the conceptual and logical model of the data warehouse. "}
{"text": "Expertise in development of High level design, Conceptual design, Logical and Physical design for Database, Data warehousing and many Distributed IT systems"}
{"text": "Assisted business users in identifying functional gaps, and developed detailed FSD for the gap"}
{"text": "Conducted UAT to confirm that all derivative products can successfully process during the trade life cycle.  "}
{"text": ""}
{"text": "Environment: IBM Rational Requisite Pro 7.1, MS Visio, MS Project, Agile, MS SharePoint Server, SQL Server 2008,."}
{"text": ""}
{"text": "Role: Business Analyst"}
{"text": "Client: Travel Guard Worldwide, Jersey City, NJ                                                          \t\t\tMar 2010 – June 2012\t "}
{"text": ""}
{"text": ""}
{"text": "Travel Guard is a North American travel insurance provider. It specializes in providing travel insurance, assistance and emergency travel service plans. Project profile: Travel Data Continuum - Travel Liberty Assistance Travel Data Continuum is a concept that proposes flow of information from end-to-end in the business process, allowing real time re-action to detected trends within each process as well an increased customer experience and lower overall operational costs."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Interviewed the stakeholders and thoroughly Documented the requirements(BRD & FRD)"}
{"text": "Extrapolated and interpreted business requirements and rules into technical requirements and defined architectural components"}
{"text": "Involved in preparing Process Flow Diagram & other UML Diagrams for functional specs using MS Visio"}
{"text": "Identified use cases for many different components and created use case summary and detailed use cases"}
{"text": "Resolved gaps identified by communicating efficiently between Web services team and Liberty system team located geographically and in different time zones"}
{"text": "Managed requirement activities using an iterative and incremental Agile methodology."}
{"text": "Helped the technical teams in mapping the data between WAATS and Liberty"}
{"text": "Clarified issues with developers during efforts to validate designs and functional specifications"}
{"text": "Involved in various technical evaluation meetings for optimizing the Business Process Flow between WAATS and Liberty application"}
{"text": "Conducted the project meetings successfully by coordinating all users, technical staff and support personnel"}
{"text": "Efficiently handled Change management by interacting with Business & IT"}
{"text": "Supported in QA testing and implementation of business solutions throughout the Software Development Life cycle"}
{"text": ""}
{"text": "Environment: Windows, Java , Web services, Sybase, XML, MS Office, Share Point, SOA, MS Visio"}
{"text": ""}
{"text": "Role: Business Analyst"}
{"text": "Client: Thomson Financial, Boston, MA                                                                     \t\t Nov 2008 – Feb 2010\t "}
{"text": " "}
{"text": "Thomson Financial was an arm of The Thomson Corporation, which was one of the world's leading information companies, focused on providing integrated information solutions to business and professional customers. Project Profile:  This Project entailed the development of a full-fledged front-end system to manage the various kinds of risks associated in maintaining the portfolio of assets. The portfolio comprised of fixed income securities, equities and derivatives (Equity and fixed Income Derivative-options). The risk analysis engine accounts for various risks such as Market Risk and Credit Risk for the held portfolios. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Applied RUP methodology and conducted brainstorming sessions to understand the client specifications and requirements"}
{"text": "Identified and analyzed issues and risks, and recommended solutions to minimize impacts by risk tracking"}
{"text": "Documented the business process through Business Requirement Document and Functional Requirement Document"}
{"text": "Conducted weekly meetings with the clients to review functional specifications and resolve open issue "}
{"text": "Involved in Gap analysis around the identification of business rules, business and system process flows, user administration, requirements and assumptions"}
{"text": "Analyzed the various parameters that had to be accounted such as for Market Risk (1 day VaR, 10 day holding period VaR, etc) and for Credit risk (PoD, EAD, LGD, Credit Migration, Regulatory Capital etc)"}
{"text": "Extensively created Use cases and Activity Diagrams using Rational Rose"}
{"text": "Hands on experience with Change Management process"}
{"text": "Developed prototypes using Dream Weaver for various screens such as Portfolio Selection, Securities Details , Rating, Performance etc"}
{"text": "Modeled the risks in Excel spreadsheet and performed sensitivity analysis and shared this document with the Traders and the technical team to facilitate more efficient communication"}
{"text": "Managed requirements & defects through  Rational Requisite Pro & Clear Quest respectively"}
{"text": "Used SQL Queries for validating VAR results from reporting data and for validating performance calculations in Risk Engine"}
{"text": "Prepared reports by using Cognos( Framework Manager, Report Studio) Reporting tool"}
{"text": "Helped in developing QA test plans for Functional, Integration & System Testing"}
{"text": ""}
{"text": "Environment: Windows, Java, Sybase, SQL, Requisite Pro, Clear Quest, Dream Weaver, MS office, Cognos, Advanced Excel"}
{"text": ""}
{"text": "Role: Business System Analyst"}
{"text": "Client: Travelers Insurance Company, White Plains, NY                                                 May 2007 – Oct 2008"}
{"text": "The Travelers Companies is an American insurance company. It is the second largest writer of U.S. commercial property casualty insurance and the third largest writer of U.S. personal insurance through independent agents. Project Profile: AgentLink Integration: This project enables “shuttling” of travel insurance policy and related information automatically through all the existing TIC systems. This will allow each of the existing systems to perform the functionality they are best at, and transfer the information to the next system for other business processes needed to be applied."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Actively participated in gathering requirements from LAD Region Managers/ Business Stakeholders"}
{"text": "Responsible to conduct  meetings with various stakeholders and finalized the Business Requirement Document"}
{"text": "Prepared Functional Requirement Document"}
{"text": "Prepared Use case and UML diagrams by using MS visio"}
{"text": "Involved in various technical evaluation meetings for optimizing the process flow between TIC and AgentLink system"}
{"text": "Performed the mapping of schema structure from AgentLink database to TIC database  "}
{"text": "Involved in weekly status update to LAD regions and Business Program Managers"}
{"text": "Conducted the project meetings successfully by coordinating all users, technical staff and support personnel"}
{"text": "Resolved the data mapping related queries from technical teams "}
{"text": "Actively participated with QA team for testing"}
{"text": ""}
{"text": "Environment:"}
{"text": "Windows,  Unix Sun OS, Java , Websphere, Web services, Sybase, IBM MQ Series, MS Office, MS Visio"}