{"text": "Name: martha martha"}
{"text": "E-Mail: martha.martha@gmail.com"}
{"text": "Address: Pune, India"}
{"text": "Github: https://github.com/martha"}
{"text": "LinkedIn: https://linkedin.com/martha"}
{"text": "Phone No. 464267079081"}
{"text": ""}
{"text": "SUMMARY "}
{"text": "Over ALL  7  Business Analyst with extensive experience in leading development and implementation of a company’s software products and services and web development."}
{"text": "Excellent experience in gathering business and technical requirements from SMEs and stakeholders through different sessions (i.e. JAD sessions, interviews)."}
{"text": "Mentor team members on agile methods and best practices and Conduct Agile planning meetings, daily stand-ups, reviews, and retrospectives."}
{"text": "Healthcare consultant specializing in analysis of Benefit Contracts and Certificates of Coverage for the configuration of claims processing systems. Extensive knowledge of Benefit configuration and Plan/Product data structure in systems, clinical code editing, claims configuration, claims adjudication processing."}
{"text": "CSM certified and highly trained and tremendous expertise in agile product life cycle (SCRUM) methodologies."}
{"text": "Proven track record to transform non-Agile teams to agile teams. "}
{"text": "Used Rational Team Concert (RTC), Rational Requesite Pro, Documentum, Version One, Mingle, DOORS, MS Project, Clarity, Plan View and Quality Center to manage successful delivery."}
{"text": "Good knowledge of FACETS, and Transaction Manager for 4010-5010 migration."}
{"text": "Detail understanding of ICD 9/ANSI/HL7 to ICD 10/ANSI/HL7 coding standards in Medicare and Medicaid domains of the healthcare industry."}
{"text": "Experienced in working with Business Impact Analysis Template (BIAT) to analyze and document the effect of proposed changes on the project schedule and costs. "}
{"text": "Worked on Power MHS built environment which includes various sub-systems like Claims (Claims Processing & Claims Loading), HIPAA/EDI transactions, Provider Enrollment, PA (Prior Authorization), Client, Common Components, COB/TPL, Rate Settings, Drug Rebate, Reference, Managed Care, Interfaces etc."}
{"text": "Implement HIPAA regulations while implementing EDI solutions."}
{"text": "Act as a liaison across business and technical team to provide solutions."}
{"text": "Extensive experience in developing and implementing a company’s software products and services."}
{"text": "Project management experience includes client management, customer interaction, scope definition, project planning, and change control, integration and release management."}
{"text": "Experienced in gathering user requirements using Telelogic Doors, analyzing and preparing project deliverables such as Project Charter, Business Requirement Document (BRD) and Functional Requirement Document (FSD)."}
{"text": "Skilled with Unified Modeling Language (UML), including Use Cases, Class, Activity, State and Sequence Diagrams."}
{"text": "Used Rally software to track project status, team collaboration, share ideas, set project hierarchies, organize, allocate, plan iterations, and create manageable user stories."}
{"text": "Skilled in Vision documents, Feasibility Studies, Scope Documents, Requests for Proposal and preparing end-user support documentation and training materials. "}
{"text": "Managed Risk Assessment, Risk Mitigation, Risk Log and Issue tracking."}
{"text": "Created and maintained Responsibility Assignment Matrix and Requirements Traceability Matrix (RTM)."}
{"text": "Highly motivated team player with ability to lead, manage and work in all environments to meet deadlines. "}
{"text": ""}
{"text": "TECHNICAL SKILLS"}
{"text": ""}
{"text": "Analysis Methodologies:  RUP, UML, Agile methodology, Waterfall methodology, CMM, SWOT, Cost-Benefit Analysis, Risk Analysis, Gap Analysis"}
{"text": "Operating Systems\t\t:  Win 95/98/NT/2000/XP, Linux, UNIX"}
{"text": "Defect Tracking Tools\t\t:  Rational Clear Quest, Test Director, JIRA, Rally, Quality Center"}
{"text": "Business Modeling Tools\t:  Rational Rose, Microsoft Visio, Share Point"}
{"text": "Requirement analysis &Mgmt.\t:  Rational Requisite PRO, Requisite Web Test Director"}
{"text": "Reporting \t\t\t:  Crystal Reports, MS Project, Power Builder, Actuate"}
{"text": "Project Management\t\t:  Microsoft Project, Microsoft Office Suite, Rally, At Task"}
{"text": "Programming Language\t:  HTML, XML, SQL, ORACLE, DB2., Java"}
{"text": "Testing Tools\t\t\t:  Rational Enterprise Suite, Test Director, Quick Test Pro"}
{"text": ""}
{"text": "EXPERIENCE"}
{"text": "Blue cross and Blue Shield NC       \tSr. Business Analyst     Nov-2013-Aug-2015"}
{"text": "Blue cross and Blue Shield NC of Access phase 2nd phase Power MHS upgrade.  MEDIGAP is the Medicare supplementary insurance provided by Blue Cross for all subscribers who has Medicare A & B primary. Under MEDIGAP LOB/product Blue Cross pays if primary pays depending the benefits limit."}
{"text": "Responsibilities:"}
{"text": "Analyzed MEDIGAP and Blue Care Access requirements."}
{"text": "Developed GAP analysis document for both MEDIGAP and Blue Care Access projects."}
{"text": "Performed setting up test data, triggering all Fulfillment and Handling Types using Power MHS"}
{"text": "Worked with providers and Medicare or Medicaid entities to validate EDI transaction sets.  This includes HIPAA 4010A1 to 5010 conversion, gap and impact and business rule"}
{"text": "Expertise in Agile methodology, Use Cases, Software Development Life cycle (SDLC) Processes."}
{"text": "Preparing test cases and test data as per requirements."}
{"text": "Testing both institutional and professional claims functionality in Power MHS application."}
{"text": "Worked with Power MHS for claims processing"}
{"text": "Verifying claim check, dupe check, pricing, Benefits for professional and institutional claims."}
{"text": "Performed adjustments (Void, VR) for all lines of business."}
{"text": "Initiated the Agile Scrum methodology for the project execution."}
{"text": ""}
{"text": "Responsible for smoke testing, system testing and regression testing"}
{"text": "As UAT specialist I deployed UAT process that consisted of Analyzing Business Requirements,"}
{"text": "Performed setting up test data, triggering all Fulfillment and Handling Types using Power MHS"}
{"text": "Proficient soliciting client Requirements through interviews, workshops, existing system documentation and organizing JAD sessions."}
{"text": "Maintained Requirement Traceability Matrix (RTM)."}
{"text": "Created use case models, use cases and UML diagrams with the help of business requirements document."}
{"text": "Extensively used quality center for plan, Prep and test (executing) system testing."}
{"text": "Environment: Power MHS , XML, SQL, XML, Quality center. Rational Rose, Rational Requisite Pro, Microsoft Visio, MS word, MS Excel, MS outlook, MS Access, Oracle, MS SQL Server, Agile Scrum, PowerPoint, Rational Requisite."}
{"text": ""}
{"text": "XL Health, Baltimore, MD                                                 \t Business Analyst   Apr-2012-Oct-2013"}
{"text": "The project was regarding the Electronic Medical Claim Software System that facilitates providers to send electronic claims in short time, and thereby ultimately increase the revenue cycle efficiency. The primary feature of the software included Electronic verification of insurance eligibility, Electronic claims status inquiry, Financial Ledger, Essential system reports and automated reminders. The system’s goals were to maximize the value of online health information; expand utilization of programs, services and products by updating the Data Warehouse solution for reporting."}
{"text": "Responsibilities:"}
{"text": "Writing the detailed user needs, Gathered business, functional requirements during inception phase, documented and delivered functional specification documents, and assisted architecture analysis and design using UML and Rational tools."}
{"text": "Worked on Data migration, FACETS version upgrades Reports Implementation, letters, Inbound/outbound Interfaces and FACETS Extensions. Implemented EDI transactions 837, 835, 270/271, 276/277 and 834."}
{"text": "Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, and OOD (Object Oriented Design) using UML and Visio."}
{"text": "Extensively worked with FACETS Implementation, FACETS Billing, Claim Processing and Subscriber/Member module. "}
{"text": "Identified, researched, investigated, analyzed, defined and documented business process and Use Case scenarios."}
{"text": "Conduct workflow, process diagram and GAP analysis to derive requirements for existing systems enhancements."}
{"text": "Led JAD sessions with stakeholders to analyze system needs and integrate requirement to develop a consistent navigation structure"}
{"text": "Worked on insurance data related to Medicare, Medicaid, and Insurance claims."}
{"text": "Analysis of inbound and outbound interfaces and extensions to FACETS claims processing system"}
{"text": "Worked on HL7 to provide framework to carry out transfer of electronic healthcare information."}
{"text": "Helped manage risk analysis and mitigation plans, status reports, and client presentations; prepared business process models, defined milestone deliverables, and established critical success factors."}
{"text": "Used gap analysis framework to identify AS-IS processes of claims transactions of HIPAA X12 4010/4010A standard and TO-BE processes (ICD-10-CM and ICD-10-PCS compliance requirements) of 5010 standard."}
{"text": "Write SQL queries to validate that actual test results match with expected results"}
{"text": "Prepared and maintained requirements traceability matrix (RTM) throughout the project lifecycle."}
{"text": "Functioned as the primary liaison between the business line, operations, and the technical areas throughout the project cycle."}
{"text": "Conducted GAP analysis assessment regarding ICD 9 to ICD 10 conversion and business work flows from legacy system to the detailed financial transaction interface"}
{"text": "Provided coaching on Agile values and practice to other teams within the company"}
{"text": "Configured facets modules such as Claims, Membership, Billing, Benefit and plan"}
{"text": "Used General equivalence Mappings (GEM) to convert ICD 9 to ICD 10."}
{"text": "Formulating the systems of project to parallel the business strategies. "}
{"text": "Conducted user training pertaining to old and new Affinity Provider ID appearing on documents providers receive from Affinity (mainly occur with EOPs, capitation rosters, PCP membership rosters, provider directory listings and some system generated letters)"}
{"text": "Wrote SQL queries in MS Access for data manipulations."}
{"text": "Assist with user testing of systems, developing and maintaining quality procedures, and ensuring that appropriate documentation is in place."}
{"text": "Develop the test plan, test conditions and test cases to be used in testing based on business requirements, technical specifications and/or product knowledge."}
{"text": "Developed SQL scripts and wrote stored procedures to validate the flow of data from Legacy source to target application database and ability to"}
{"text": "Interfaced with SME’s to prepare BPR documents for ongoing projects."}
{"text": "Environment: workflow ,RUP, Agile Scrum, MS Project, ANSI X12 – EDI, Rational Rose, Data Mapping, MS Visio, MS Word, MS Excel, Medicare, Medicaid, Rational Requisite Pro, ETL, Oracle , MS Access. PL/SQL"}
{"text": "Kaiser Permanente, Denver, CO\t Business Analyst        Jun-2010-Mar-2012"}
{"text": "I was handling two projects simultaneously: Integrated Video Visits (IVV) Provider sideand Community Provider Connect (CPC). IVV project constitutes creating and designing web and mobile applications for providers to allowlive video appointments with members/clients after scheduling.CPC is one of the successfully run web portal project over a couple of years which currently deals with adding and enhancing the CPC website targeted to assist providers in pulling up members’ EMRs, claims information, eligibility and benefits, and pharmacy formulary – a formulary system and evidence-based decision making for providers to determine medicationneeded for members."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Performed and coordinated the Scrum Ceremonies (Iteration Planning, Daily Scrum, Iteration Review/Demo, Retrospective, backlog grooming session and Release Planning)."}
{"text": "Executed Agile/Scrum as a project management methodology –Support and assist the software development team in their efforts to adopt advanced methods for the effective application of Agile/Scrum framework."}
{"text": "Kept close track of teams’ progress per sprint and release using Rally Agile SDLC software with sprint and release burn down and burn up charts, and planned velocity"}
{"text": "Generated RTM Reports in DOORS pulling the Test case information from Test manager using the interface Ring-Zero Adapter."}
{"text": "Generated DOORS Metrics for higher management on a weekly basis."}
{"text": "Facilitated project manager in initiating, planning, scheduling, estimating, forecasting, coordinating, controlling, managing and delivering all activities for projects and related release initiatives and certifications."}
{"text": "Responsible for maintenance of all Procedure Code and Benefit Tables enabling claims processing to become more automated along with Plan/Product applications."}
{"text": "Assisted in rigorous and continuous review of defects during release and sprint planning meetings. "}
{"text": "Implemented agile development best practices and moving to releases from point releases. "}
{"text": "Utilized rally to maintain the product backlog, defects, production issues, and test cases."}
{"text": "Contributed to software process-reengineering efforts aimed at evolving current software development practices to adopt Lean/Agile and Scrum practices."}
{"text": "Offered remedies on teams’ technical and non-technical issues by bringing necessary resources together and facilitating troubleshoot meetings."}
{"text": "Monitored the progress of the project status with respect to schedules and effort estimates."}
{"text": "Established and enhanced collaboration between all Scrum Team members."}
{"text": "Maintainedactive and strong communication flow among team members to create positive/healthy working environment"}
{"text": "Helped the Team define and excel at their chosen process for getting work done."}
{"text": "Assisted product owners in making requirement Scoping decisions and analyzing high priority criteria as needed."}
{"text": "Environment: Rally, AGILE/LEAN Scrum project framework, DOORS, WebEx, MS-Project, MS Office Suite, HP Quality Center, and Lotus Notes"}
{"text": ""}
{"text": "Group Health Insurance, Chicago, IL                   Business Analyst QA Analyst            Aug-2008-May-2010"}
{"text": "Description: GHI contracted with the Medicare Centers and Medicaid Services (CMS) to provide quick, easy, and affordable access to the health care service of their choice. Project involves integrating Market Prominence and the Claims processing System with the data warehouse to support the reporting requirements. My duties were included designing the model of ODS to automate and maintain the ETL process."}
{"text": "Responsibilities:"}
{"text": "Prepared the Business requirement Document (BRD) and functional requirement document (FRD), working with Requirements Traceability Matrices (RTM), re-engineering business processes for the enhancement of the existing services."}
{"text": "Used Rational Rose/MS Office Suite for creating use cases, workflows and sequence diagrams according to UML methodology thus defining the Data Process Models."}
{"text": "Assisted EDI team with the testing of maps for HIPAA transactions 835 and 837."}
{"text": "Conducted Business Process (As Is/To Be) sessions with various department directors and staff to ensure the Testing Plan and Test Approach would meet the identified Business Requirements, and the Training Program covered all identified new and changed processes."}
{"text": "Wrote Structured Query Language (SQL) statement against Claims, Claim Status and updating Personal Information modules by Joins, Unions and Aggregate Functions "}
{"text": " Reported defects using Clear Quest when defects were discovered during the test case execution. "}
{"text": "Assisted in identifying project scope, to conform to the regulatory compliance related to X12 837 (I/P) and 835."}
{"text": "Worked with Facets data models for Claims, Membership Eligibility etc."}
{"text": "Tracked stakeholder requested enhancements and changes using Requirement Traceability Matrix (RTM)."}
{"text": "Logged the errors, reported defects, determined repair priorities and tracked the defects until resolution using ALM."}
{"text": "Identified the bugs and kept track of the defect report using ALM Quality Center, and also analyzed the root cause for defects."}
{"text": "Responsible for creating UAT, SIT & Regression Test cases in the test plan module of Quality Center’"}
{"text": " Wrote test cases, executed them and Report defects In Clear Quest and manage UAT "}
{"text": "Implemented the entire Rational Unified Process (RUP) methodology of application development with its various workflows, artifacts and activities."}
{"text": "Logged defects in Quality Center and interacted with the developers to resolve technical issues."}
{"text": "Involved in HIPAA/EDI Medical Claims Analysis, Design, Implementation and Documentation."}
{"text": "Participated in various kinds of testing like (UAT) User Acceptance Testing, Functional Integration, System, Regression and Black Box."}
{"text": "Involved in writing extensive SQL Queries for back end testing oracle database."}
{"text": "Designed and implemented HIPAA 835 Payment Advice Transaction, 837 Health Care Claim Transaction."}
{"text": "Environment UNIX shell Scripting, HIPAA tool XML, Windows , Toad ,ALM,HP, Quality  Center. Agile, MS Project, SQL, Rational Requisite Pro, Rational Rose, Microsoft Visio"}
{"text": ""}