{"text": "Name: marie marie"}
{"text": "E-Mail: marie.marie@gmail.com"}
{"text": "Address: Tangshan, China"}
{"text": "Github: https://github.com/marie"}
{"text": "LinkedIn: https://linkedin.com/marie"}
{"text": "Phone No. 723281436810"}
{"text": "Professional Summary: "}
{"text": "A result oriented individual with over 6+ years of diversified experience in Finance industry especially in Mortgage Servicing."}
{"text": "Expertise in Project Planning, Project Design, creating functional specifications and data flow diagrams."}
{"text": "Expertise in translating user requirements into technical specifications and mapping the process design, work flows for SDLC with documenting and managing business requirements using waterfall and Agile methodology."}
{"text": "Possess excellent organizational, interpersonal, communication and documentation skills with good process management skills along with a remarkable ability to gather requirements to bring out quality product."}
{"text": "Strong financial product knowledge of Capital Markets, IPO, Fixed Income Securities, Fixed income derivatives such as swaps and Equity Markets."}
{"text": "Hands on experience in creating Test Plan and Test Cases using ALM based on the system/functional requirements"}
{"text": "Defining change control processes, risk management, Assets Management, wealth management, cash management processes."}
{"text": "Worked closely with Corporate Finance and Treasury to institute new wire transfer procedures and new expense and clearing accounts"}
{"text": "Possess strong analytical and problem solving skills with the ability to adapt to a new environment and meet stringent deadlines."}
{"text": "Experience in automation testing using industry standard testing tools HP ALM / Quality Center"}
{"text": "Ability to successfully manage multiple deadlines and multiple projects effectively through a combination of business and technical skills."}
{"text": "Facilitated JAD sessions with the management, vendors, users and other stakeholders for open and pending issues to develop specifications."}
{"text": "Professional expertise in MS Office, MS Access and MS Project."}
{"text": "Analyzed Enhancement requests and Modification requests."}
{"text": "Maintained the Requirements Traceability Matrix (RTM)."}
{"text": "Highly motivated worthy team player capable enough to work and lead within a team environment besides being capable to work independently."}
{"text": "Maintenance of Test Matrix and Traceability Matrix."}
{"text": "Analyzed Business requirement."}
{"text": "Experienced as a Business Analyst in a role of responsibility encompassing Requirement Gathering, Decomposition and Analysis besides Quality Assurance."}
{"text": "Ability to identify and document critical requirements through analysis."}
{"text": "Conducted User Acceptance Testing (UAT) after going through regression testing."}
{"text": "Strong business analysis skills and thorough understanding of software development life cycle."}
{"text": "Strong ability to understand and document critical data through effective data collection, data analysis and data."}
{"text": ""}
{"text": "TECHNICAL SKILLS"}
{"text": "Methodologies:\t\t\tScrum, Agile, Waterfall"}
{"text": "Testing tools: \t\t\t\tHP Quality Center, ALM"}
{"text": "Change Management Tools:\t\tRational Clear Quest"}
{"text": "Office Tools:  \t\t\t\tMS Project, MS Word, Excel, PowerPoint"}
{"text": "Operating Systems:\t\t\tUNIX, Windows 7/8/10"}
{"text": "Business Modeling Tools:\t\tMicrosoft Visio, PowerPoint"}
{"text": "Database:\t\t\t\tMS SQL Server, Oracle"}
{"text": "Business Modeling Tools:                 \tMicrosoft Visio, Rational Rose"}
{"text": ""}
{"text": "EXPERIENCE"}
{"text": "Wells Fargo Home Mortgage, Des Moines, IA\t\t\t\t\t "}
{"text": "May 2015 – Present "}
{"text": "Business Systems Analyst"}
{"text": "Wells Fargo Home Mortgage is the leading Home Mortgage providers in the US. The application was web based application CORE which provides a complete solution to HMC's and Borrower's Mortgage needs. The application covers all the phases of the Mortgage process. The application provides a more user friendly experience."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Organized JAD Sessions to resolve issues and conflicts, and to arrive at quick agreements regarding the system architecture design"}
{"text": "Involved in the review of requirements with functional manager and technical specialists of the application"}
{"text": "Designed and executed Test Plans and Test Cases and generated Test Scripts and Test scenarios."}
{"text": "Coordinated User Acceptance Testing with the UAT group to ensure the correct business logic."}
{"text": "Worked closely with end-users and developer to develop a detailed understanding of the opportunities for improvement, then gathered requirements and prepared a comprehensive set of documents to define the specifications and business value of the system"}
{"text": "Analyzed production issues and worked with the IT development team to determine root cause analysis, timeline of events and open HP Quality Central (HP ALM) tickets for releasing fixes in future maintenance releases."}
{"text": "Analyzed the Data flow and UML Diagrams."}
{"text": "Worked with Business Area Experts and Subject matter experts to understand the business requirements."}
{"text": "Monitored the Defect Tracking Process and generated customized graphs and reports for the client using ALM."}
{"text": "Analyzed operating procedures and policies on an ongoing basis and recommended and implemented improvement plans where appropriate."}
{"text": "Understood core processes of the departments to provide input on re-engineering or streamlining opportunities. "}
{"text": "Opened several high severity defects in HP ALM to track and managed the defect lifecycle. "}
{"text": "Worked with the development team to resolve all the defects and updated the results of re-testing of defects in HP ALM."}
{"text": "Met with client groups to determine user requirements and goals. "}
{"text": "Analyzed business requirements and segregated them into high level and low level Use Cases, activity diagrams / State Chart Diagrams and Robustness Diagram using MS Visio according to UML methodology, thus defining the Data Process Models."}
{"text": "Created different tables in MS Access for every module."}
{"text": "Prepared Test plans, Test Cases based on business requirements using Quality Center."}
{"text": "Environment: JAD, UML, Oracle/Unix, SQL Developer, SQL PLUS, HP Quality Center/ALM."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "JP Morgan Chase, Salem, NH\t\t\t\t\t\t\t\t "}
{"text": "Jan 2014 – Mar 2015"}
{"text": "Business Analyst "}
{"text": "JPMC is one of the oldest (200 years) and leading financial institution in the United States with assets of 2.4 trillion. It operates in 60 countries with 260,000 employees serving millions of consumer, small business, corporate, institutional and government clients.  "}
{"text": "The objective of the project was to automate and further enhance their mortgage origination. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for interacting with business stakeholders to better understand the project scope and related appendices."}
{"text": "Analyzed business needs, created and developed new functionality to meet real time data integration that facilitated decision making "}
{"text": "Analyzed and assessed the clients’ systems and business processes "}
{"text": "Conducted individual and group (JAD) sessions with business stakeholders and technical units "}
{"text": "Established a business Analysis methodology around the Rational Unified Procedure. "}
{"text": "Streamlined clerical work processes and mapped to the automated system. "}
{"text": "Developed project plans and managed project scope. "}
{"text": "Assisted in building a business analysis process model using Rational Rose and Visio. "}
{"text": "Performed requirement analysis, developed all the use cases and workflows. "}
{"text": "Designed and developed Use Cases, Activity Diagrams and Sequence Diagrams "}
{"text": "Played a key role in the planning, UAT, and implementation of system enhancements and conversions. "}
{"text": "Developed strategic partnerships with the business unit to prepare a solid knowledge base of the business line, including the business plan, products, and process and revenue streams aimed towards problem solving. "}
{"text": "Interacted closely with QA to finalize the Test strategies and maintained quality assurance using HP Quality Center / ALM"}
{"text": "Created policies and procedures document with client specified format requirements. "}
{"text": "Played a key role in the planning, testing, and implementation of system enhancements and conversions, especially the incorporation of data warehousing techniques in system. "}
{"text": "Assisted in presenting reports and analysis to help guide the management. "}
{"text": "Extensively used HP ALM to record Business Requirements."}
{"text": "Guided new members on the project on resources and material available and the goals for future. "}
{"text": "Analyzed research on operational procedures, methods, and recommend changes for improvement with an emphasis on automation and efficiency."}
{"text": "Responsible for interacting with Commercial Banking and Corporate Investment Banking Line of Businesses to create various versions of the Business Requirement Document (BRD) drafts to come up with the signed BRD."}
{"text": "Responsible for Preparing Functional Specific Document (FSD) by breaking the BRD requirements in the form of business rules, business logics, data mapping and mathematical formulas."}
{"text": "Designing the FSD focused on the implementation of MANTAS (DW application), mapped various business terms/KPIs with report data elements."}
{"text": "Assisting the developers to better understand the business logic, business process, data request/delivery mechanism. "}
{"text": "Performing the impact analysis during the modification/changes in the requirements by the business owner. "}
{"text": "Environment: MS Visio, MS Office Suite, MS SharePoint, SQL Developer, MS Project, Microsoft Lync"}
{"text": ""}
{"text": "United Bankshares, Charleston, WV\t\t\t\t\t\t\t"}
{"text": "Mar 2012 – Nov 2013"}
{"text": "Business/UAT Analyst"}
{"text": "United Bankshares is a United States bank holding company and provides commercial banking operations, credit card services, trust services, mortgage banking services, investment banking services, and investment advisory services. The scope of the project was to enhance the existing legacy “flexible home loans application” assist mortgage officers to provide home loan schemes to customer from various financial backgrounds.  The purpose of the Home Loan Origination Project (HLOP) is to replace the existing home loan origination applications and make the better user experience and improve efficiency."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Wrote test plans and test cases based on the business requirements which involved market risk analysis and risk management like continuous time finance & asset pricing, stochastic processes &simulations, credit derivatives, structured products, documentation, value at risk, risk & return optimization, mortgage rules and procedures, ACH methods and workflow."}
{"text": "Identified processes for developing and documenting detailed business requirements. Data was collected from end-users, and analysts."}
{"text": "Created Use-Cases and Requirements documents to document business needs."}
{"text": "Requirements were gathered through interactions and meetings and periodic walkthroughs with loan analysts, credit analysts and other potential users of the application."}
{"text": "Conducted Use-Case reviews and identified gaps, leading to improvements/enhancements in the same."}
{"text": "Supported Users in understanding the ALM Test Management Process during User Acceptance Testing (UAT)"}
{"text": "Was responsible for Business Process Management (BPM) for development of various projects."}
{"text": "Created and maintained the Requirements Traceability Matrix (RTM)."}
{"text": "Ensured Use-Cases were consistent and covered all aspects of the Requirements document."}
{"text": "Maintained the Business Impact Analysis Template (BIAT) to analyze and document the effect of proposed changes on the project schedule and costs."}
{"text": "Worked with Quality Assurance Analyst in HP Quality Center / ALM to track defects."}
{"text": "Used Rational Clear Quest for bug reporting."}
{"text": "Worked directly with software engineers to ensure clear communications on requirements and defect reports."}
{"text": "Designed and developed scenarios based on business requirements."}
{"text": "Developed requirements integrating E-R diagrams and designed the testing process flows."}
{"text": "Interacting with other teams through walkthroughs, teleconferences, meetings, etc. to resolve various issues.   "}
{"text": "Created Business Components in HP ALM for the reusable scenarios in reports testing."}
{"text": "Validated the scripts to make sure they have been executed correctly and meets the scenario description."}
{"text": "Environment: Windows, SQL, JAD, UML, Oracle, Microsoft Office Suite, UNIX, MS Access"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Citibank, New York, NY\t\t\t\t\t\t\t\t   "}
{"text": "Oct 2010 – Jan 2012"}
{"text": "Business Analyst"}
{"text": "I was Involved in business analysis of an online banking application that enables the bank’s customers to access their accounts through the Internet. Account holders enter their access ID and password to access their personal accounts, which includes checking, savings and money market account. The application provides the accounts lists, account summary, account transactions for various accounts and the ability to transfer funds between the various accounts using fund transfers."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "As a Business Analyst, prepared departmental reports, providing analytical framework related to the budget process"}
{"text": "Assisted with the gathering Business Requirements based on the user requirements and specifications."}
{"text": "Worked with the technical and business staff to produce Test Scripts, Configuration and Management Plan documents. "}
{"text": "Worked directly with developers, Project Managers and Business contacts to produce Test Scripts and Test Conditions."}
{"text": "Followed established formats and procedures, created new formats, as well as researched, created, edited technical and business data documents. "}
{"text": "Worked with the Senior Business Analyst to conduct (JAD) sessions with business and technical units."}
{"text": "Used UML diagrams to visually express the core functionality of the System Under Development (SUD). "}
{"text": "Exposed to Security Testing and Regression Testing using Win Runner."}
{"text": "Exposed Functionality Testing and GUI Testing using Win Runner"}
{"text": "Exposed Data Driven Testing to test the application with different sets of data from the test database. "}
{"text": "Raised defects and logged in the HP QC tool to manage the resolution of the defects."}
{"text": "Used Quality Center to run manual and automated tests, report execution results."}
{"text": "Interacted with the developers to report and track bugs using Quality Center."}
{"text": "Follow up with developers on defects status on a daily basis."}
{"text": "Worked with the BA / QA team to develop test plan and test cases for (UAT)."}
{"text": "Environment: Oracle, MS Windows, IIS Server, Quality Center, Test Cases, Test Plans."}
{"text": ""}
{"text": "EDUCATION"}
{"text": "Masters in Accounting"}