{"text": "Name: pauline pauline"}
{"text": "E-Mail: pauline.pauline@gmail.com"}
{"text": "Address: Dar es Salaam, Tanzania"}
{"text": "Github: https://github.com/pauline"}
{"text": "LinkedIn: https://linkedin.com/pauline"}
{"text": "Phone No. 823476306061"}
{"text": "CAREER SUMMARY"}
{"text": ""}
{"text": "7 years of Healthcare Industry experience as a Business Analyst with solid understanding of Business Requirements Gathering, Experience in elicitation, documentation and presentation of high level and detailed requirements, Experience in creation of test strategies, test plans, test cases and analyzing test results. Hands on experience on the entire SDLC methodology from Ideation to Implementation of a Project . "}
{"text": "Professional experience in Business Analysis, Software Development Life Cycle: System Analysis, Design, Development, Testing, and Implementation on Business Systems."}
{"text": "Extensive experience in analyzing and requirements gathering and writing functional specifications including use cases."}
{"text": "Good experience as a Business Analyst and Product owner with a customer relationship management (CRM using Salesforce) in early design and implementation phases."}
{"text": "Experience in Salesforce.com CRM - configuration, roll-out, administration, training, and support."}
{"text": "Experience in administering and customizing Sales Cloud, including Service Console, assignment rules, email-to-case, queues, escalation rules, record types, support processes and settings."}
{"text": "Experience using Salesforce for Outlook settings for managing cases."}
{"text": "Thorough BA methodologies, processes and tools knowledge"}
{"text": "Experience working with agile and waterfall project methodologies"}
{"text": "Experience in Developing and evaluating business process Models (BPM)."}
{"text": "Proven success as a business analyst through the years, providing a well-balanced understanding of business relationships, business requirements, and technical solutions."}
{"text": "Strong experience in RUP Business Modeling process."}
{"text": "Expertise in UML (class diagrams, object diagrams, GAP Analysis, use case diagrams, state diagrams, sequence diagrams, activity diagrams, and collaboration diagrams) as a business analysis methodology for application functionality designs."}
{"text": "Design and review of various documents including the Business requirements document (BRD), Software Requirement Specifications (SRS), Use Case Specifications, Functional Specifications (FSD), Systems Design Specification (SDS), Requirement Traceability Matrix (RTM) and testing documents"}
{"text": "Professional experience in business analysis, operations management and development, design, documentation and testing."}
{"text": "Adept in organizing/leading live meetings, eliciting, analyzing, documenting and in most cases finalizing the requirements through live meetings. "}
{"text": "Well versed in in-person as well as live meeting, Joint Application Requirements (JAR) and Joint Application Development (JAD) sessions.  "}
{"text": "Used MS Excel spread sheet, PowerPoint, MS Visio, and MS Projects."}
{"text": "Experience in creating and maintaining the Requirements Solution Summary Document (SSD)."}
{"text": "Working knowledge of health care industry Claims Processing, Medicare, Medicaid and Commercial Claims both from the Health Care Standpoint and the Pharmaceutical Standpoint (PBM)."}
{"text": "Sound knowledge in the HealthCare transactions: Eligibility Request/Response (270/271), Claim Status Request/Response (276/277), Benefit Enrollment (834), Health Care Services Request (278), Payment/Advise (835) and Health Care Claims (837)."}
{"text": "Well versed with SDLC methodologies like AGILE Scrum, RUP and Water fall"}
{"text": "Demonstrated ability to identify root causes of problems, consider both the long and short-term impact of proposed solutions and develop workable solutions. Ability to manage (Multiple) project tasks with changing priorities and tight deadlines. Ability to work well in a team. Open to Team related tasks, team meetings, team interaction and conference calls."}
{"text": "Demonstrated ability to work well with a wide variety of people at various levels, foster cooperation and collaboration among individuals in the work unit, help team resolve conflicts constructively and ability and willingness to communicate when help is needed. A Self-starter with a positive attitude, willingness to learn new concepts and to take and tackle challenges. "}
{"text": "Excellent command over Written and Spoken English Language, Medical Terminologies, Health Care Laws, Policies, Guidelines and Action Plans."}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "AGIA INC., CARPINTERIA, CA                                                                                                   Dec 2016 to Present"}
{"text": "Salesforce Business Analyst"}
{"text": "AGIA (Association Group Insurance Administrators) is a Third-Party company that works on product development for various Clients. The project was a migration of the Software platform they use for Policy Administration, Billing & Collections, Commissions and Claims. I was working as a BA to do Process Documentation of the ‘As-Is’ and ‘To-Be’ processes and worked to develop Use Cases and Test Cases. "}
{"text": ""}
{"text": "RESPONSIBILITIES:"}
{"text": "Worked closely with the Executive Sponsor, SMEs and stakeholders to define requirements for the various processes and to identify the enhancements and modifications for the To-be processes"}
{"text": "Assisted Project Manager and Lead BA in Project planning and setting the timelines for the project and updating Performance metrics spreadsheet as required."}
{"text": "Actively involved in the documentation of the Business Requirements, Functional Requirements and wrote BRDs for the various processes as required."}
{"text": "Worked extensively on CRM using Sales force for creating a cloud ready application that was tailored for the client’s needs. "}
{"text": "Created and deployed several Custom Reports using salesforce.com platform  "}
{"text": "Involved in Accounts Management - Account Creation process Sales force integration, Account Update process, Account Delete process . "}
{"text": "Involved in Sales force Contact Management - Contact Creation process, Contact Update process, Contact Delete process\n25in; line-height"}
{"text": "Monitored Medicaid Management Information System (MMIS) to make sure it can handle the HIPAA transactions such as 835, 837 (P, D, I) 276, 277, 278. And to make sure the Inbound and Outbound is run through job control language (JCL) in batch mode."}
{"text": "Executed test cases for several transactions such as 837, 835, 820, 834, 277, 278, and 270/271 ."}
{"text": "With help of SQL developers, Performed Data mapping, logical data modelling, created class diagrams, entity relation (ER) diagrams. "}
{"text": "Designed test cases and test scripts for the User Acceptance Testing (UAT) for the core data in Medicaid management information system (MMIS) Legacy system "}
{"text": "Created and documented Use Cases and Test Cases for the processes defined."}
{"text": "Worked closely with the Testing team to ensure successful execution of the Test Cases ."}
{"text": "Used SQL to execute queries to the database for Data mining and to verify integrity of the data ."}
{"text": "Actively involved in obtaining approval for the documentation and BRDs from Executive Sponsors and Business Leaders ."}
{"text": "Worked closely with SMEs and end-users to define and outline the As-Is and To-Be procedures and training materials."}
{"text": "Conducted JAD sessions and peer review sessions with the SMEs, developers and business users ."}
{"text": "Analyzed the scope of the project for different review sessions of the application ."}
{"text": "Operated project testing efforts by performing System Integration testing, Regression testing and by helping UAT team in User Acceptance testing."}
{"text": "Created SQL queries to find out the data in HIPPA compliance"}
{"text": ""}
{"text": ""}
{"text": "Department of Health and Human Services\t\t\t                                  Jan 2014 – Nov 2016"}
{"text": "State of Nebraska, Lincoln, NE                                                                                 "}
{"text": "(BUSINESS ANALYST)"}
{"text": "The Department of Health and Human Services provides important and, oftentimes, life-sustaining services to Nebraskans. MMIS Project includes remediation of the legacy MMIS to meet the minimal functionality necessary to electronically send, receive and process the HIPAA compliant standard transactions, and fully implement all components of NPI Compliance. "}
{"text": "RESPONSIBILITIES:"}
{"text": ""}
{"text": "Identified high-level requirements for developing and documenting detailed business requirements."}
{"text": "Gathered requirements in compliance with HIPAA. "}
{"text": "Audited reports for duplications and made reports for the reasons of duplication of enrollment."}
{"text": "Verified the enrollments while checking for duplications."}
{"text": "Made sure the same ID is not used again or members enrolling in different packages do not make duplicate enrollments."}
{"text": "Analyzed transactions 837 (Claim for Institutional, Professional and Dental Claims), 835 (Claim Payment), 276-277 (Claim status), 834 (Enrollment), 270/271 (Member eligibility)."}
{"text": "Converted business requirements into functional requirements."}
{"text": "Worked on EDI Health Care Claim Payment/Advice Transaction Set (835)"}
{"text": "Developed and managed the formal Agile Methodology which includes Configuration Management, Requirements Management, Agile Manifesto, Lean Development."}
{"text": "Compiled, tabulated and coded statistical reports using pivot tables to produce spreadsheets, graphs and databases."}
{"text": "Involved in the meetings with Business process owners, SME (subject matter experts) and Marketing Team for Requirements gathering during the Definition Stage."}
{"text": "Gathered Business Requirements, wrote Business and User Requirement documents."}
{"text": "Utilized RUP (Rational Unified Process) to create use cases, activity, class diagrams and workflow process diagrams."}
{"text": "Worked on FACETS Pre-pricing process – Subscriber/member eligibility, Plan benefits, Check "}
{"text": "Worked on Coordination of Benefits – Calculations using Total charges, Facets allowed, "}
{"text": "Worked on Claims Payment and Adjustments – Claims inquiry, Remittance, Explanation of Benefits, Discounts, Interest calculations, Split payment etc"}
{"text": "Conducted business validations, covering the following deliverables: FACETS Providers, Facets Claims and Facets Membership and Operational reports."}
{"text": "Refined the requirements (use-cases) and Business Process Models to detailed level appropriate for technical analysis and system design. "}
{"text": "Attended all the training sessions on HIPAA and Transaction sets 837, 835, 834, 270/271, 276/277."}
{"text": "Wrote and execute test cases for User Acceptance Testing."}
{"text": ""}
{"text": ""}
{"text": "Kaiser Permanente, Washington DC \t\t\t\t                                  Dec 2012 – Dec 2014"}
{"text": "(BUSINESS ANALYST)"}
{"text": ""}
{"text": "Kaiser Permanente is a leading consumer health services and health insurance provider in North America. They are committed to assisting physicians and hospitals to their members to improve the extraordinary quality of healthcare. As a Business Analyst Worked on the Claims processing system within the company for scanning and capturing of data including working on UB-92 claims forms. Involved in using the technology to recognize, validate, and store claims and their attachments using HIPAA compliance interface."}
{"text": "RESPONSIBILITIES:"}
{"text": "Met with client groups to determine requirements and goals. Utilized Rational Unified Process (RUP) to configure and develop process, standards, and procedures and create a Business requirement Document."}
{"text": "Responsible for preparing Software Requirement Specification (SRS) and documenting them."}
{"text": "Created Process Work flows, Functional Specifications documents and documented system requirements."}
{"text": "Provide implementation assessment, strategy, and mentoring services for Rational Rose, UML and RUP."}
{"text": "Validated claims against the HIPAA Standard and processed through the Gateway."}
{"text": "Worked extensively on the EDI Transactions like; EDI 270, EDI 271, EDI 276 EDI 834, EDI 835, EDI 837"}
{"text": "Working with clients to better understand their needs and present solutions using structured SDLC approach."}
{"text": "Interaction with the developers to report and correct bugs."}
{"text": "Followed a structured approach to organize requirements into logical groupings of essential business processes, business rules, and information needs. Ensured that critical requirements are not missed."}
{"text": "Aided management in standardizing web applications by preparing GUI standards and recommending alternatives for incorporation in a phased, iterative manner."}
{"text": "Interacted with client and the Technical Team for requirement gathering and translation of Business Requirement to Technical specifications."}
{"text": "Identified and clearly defined functional issues and support IT development staff throughout the design, development, unit testing, and implementation phases of the software development life cycle."}
{"text": "Analyzed and translated business requirements into system specifications."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "VST Technologies,                                                                                                         April 2010-November 2012\t                                                                                                                                        Metro Park, New Jersey \t\t\t                         "}
{"text": "(BUSINESS ANALYST)"}
{"text": ""}
{"text": "Worked as Business Analyst in the internal projects in the IT Consulting Firm VST Technologies . VST is a New Jersey based IT consulting firm that supplies IT consultants and provides IT solutions to its classified clients. I was involved in some health care projects mainly in the claims processing ambit of Medicare, Medicaid and Commercial Claims. I had an excellent opportunity to educate myself in the healthcare domain, healthcare laws like HIPAA, ICD Standards, CMS Guidelines, knowing the terminologies, the operation of Healthcare Industry in the United States, exposure to Healthcare governance from both Health Plan Sellers standpoint as well as Drug Management perspective (PBM). I also had thorough understanding of the BA’s role in the Software Development Life Cycle."}
{"text": ""}
{"text": "RESPONSIBILITIES:"}
{"text": "Interacted with the SMEs (Subject Matter Experts) and stakeholders to get a better understanding of client business processes and gathered and analyzed business requirements. "}
{"text": "Analyzed the current business processes and the systems and designed the ‘To Be’ process models and workflow analysis."}
{"text": "Developed high level and detail level requirements documents, functional requirements documents and screen mock ups and other deliverables."}
{"text": "Facilitated JAD sessions to organize and understand Business requirements and Functional specifications. "}
{"text": "Dealt with the EDI transaction-835 claims payments and remittance advice, which deals the payment from payer to provider."}
{"text": "Worked closely with business team, and identified, analyzed the core requirements and key features of the ongoing project. Extracted, discussed, and refined business requirements and developed comprehensive business requirement document (BRD). Developed Software Requirement Specification (SRS) document using Visio and MS Office."}
{"text": "Extensively interacted with both business team and development team in coming up with a Sequence diagrams."}
{"text": "Developed internal algorithms, condition-action tables and decision trees and tables that incorporate member’s personal and medical information."}
{"text": "Actively involved in the creation of comprehensive resource center through collection, documentation and extensive editing of relevant medical literature."}
{"text": "Participated in agile process – planned iterations, created tasks, assigned tasks to quality assurance team based on the priorities and estimated capabilities of quality assurance team for every iterations"}
{"text": "Core member for conception, implementation of Business Intelligence initiatives"}
{"text": "Prepared high level business use case and developed it into multiple system use cases and Activity diagrams."}
{"text": "Used UML to perform Use-Case analysis to capture the dynamic aspect of the application."}
{"text": "Developed Use Cases and prepared Use Case specification document."}
{"text": "Involved in identifying the business rules and constraints and also responsible for assisting in project management functions."}
{"text": "Co-ordinated with the Business, Users, Developers and Testers in the SDLC process, coordinated with placeholders from On-Shore and Off-Shore to meet the intersecting deadlines. "}
{"text": ""}
{"text": ""}
{"text": "Education:"}
{"text": "Masters of Science in Healthcare Administration, Connecticut, USA."}
{"text": "Bachelor of Engineering in Biomedical from INDIA"}
{"text": ""}
{"text": ""}