{"text": "Name: elsie elsie"}
{"text": "E-Mail: elsie.elsie@gmail.com"}
{"text": "Address: Seoul, South Korea"}
{"text": "Github: https://github.com/elsie"}
{"text": "LinkedIn: https://linkedin.com/elsie"}
{"text": "Phone No. 225230414334"}
{"text": "\t\t"}
{"text": "Summary:"}
{"text": ""}
{"text": "Microsoft Dynamics CRM Techno-Functional consultant with more than 7 years of IT experience in MS CRM and ASP.NET technologies."}
{"text": ""}
{"text": "Involved in every phase of the life cycle gathering all the key requirements in the project from Design, Analysis, Development, Testing and Deployment of the solution in the MS Dynamic CRM."}
{"text": "Expertise in Microsoft CRM 4.0, 2011, 2013, 2015,2016 Implementation, Migration, Entity, Views, Web resources, Ribbon, Charts customization and Integration MSCRM web service with JavaScript, JQuery, C# and ASP.Net."}
{"text": "Strong knowledge in MS CRM installation, configuration, customization, Data migration, Sales, Services, Marketing, and System integration."}
{"text": "Expertise in working with MS Dynamics 365 Online and MS Dynamics 365 On-Premise."}
{"text": "Proficient in Designing and Deploying, Debugging Plug-in and Custom Workflows in CRM to meet business process flow requirements, including Sales, marketing, customer services support, using CRM SDK."}
{"text": "Expertise in developing and updating a web page quickly and effectively using HTML, CSS, JavaScript and jQuery with the webpage cross browser compatibility and Responsive design."}
{"text": "Prepared FRD, FDD, TDD and Gap fit documents."}
{"text": "Expertise in client side scripting languages which includes Java script, jQuery, HTML and CSS."}
{"text": "Having experience in creating Sitemaps for an organization using XRM toolbox."}
{"text": "Expertise in implementation of Sure step methodology."}
{"text": "Collaboration with Business, IT Team, Development Team and Test Team to fill any gaps."}
{"text": "Good experience in creating users, assigning roles and field level security to the users in the system."}
{"text": "Preparation of Functional as well as Technical design Documentation."}
{"text": "Demos/Presentation to Business/internal teams."}
{"text": "Experience in Lead Management, Case Management and Marketing modules within Microsoft Dynamics CRM."}
{"text": "Experience of industry trends and developments in MS CRM to improve service to the clients."}
{"text": "Experience in implementing the CRM outlook configuration for business users."}
{"text": "Experience in implementing CRM instance."}
{"text": "Experience performing Unit and Integration Testing in the Development, System Integration Testing (SIT), User Acceptance Testing (UAT) including Bug Reporting and Fixing."}
{"text": "Experience in project planning and resource allocation. "}
{"text": "Knowledge about CRM Portals and Adxstudio Portals."}
{"text": "Handling the end to end cycle of release management with respect to various projects. "}
{"text": "Expertise in Asp.Net application design and Technical support."}
{"text": "Experience in working with Business Analysts, Quality Analysts and Development manager."}
{"text": "Expertise in conducting meetings with upper management to ensure efficient project implementation."}
{"text": "Expertise in designing and setting Dynamics CRM Social Insights."}
{"text": "Worked extensively with Iterative Agile Methodologies, Waterfall methodologies."}
{"text": "Knowledge of Agile Methodologies in Software Engineering Processes."}
{"text": "Strong exposure in designing of Custom objects, Custom Fields, Page layouts and Custom Reports and Dashboards."}
{"text": "Create documentation for clients, including PowerPoint presentations and Visio workflows regarding functional and technical requirements, design, training, process engineering, etc."}
{"text": "Possess good communication skills, very patient, self-motivated, helpful, confident and optimistic. Can communicate with people effectively, adaptability, can work independently, good team player, fast learner, time management and organization skills."}
{"text": "Technical Skills"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Client: Dell, Austin, TX\t\t\t\t\t                                             Mar’17 – Nov’17"}
{"text": "Role: MS CRM Technical Consultant"}
{"text": "Project: Implementation of Dynamics CRM."}
{"text": "Responsibilities:"}
{"text": "Gather and understand client functional requirements. "}
{"text": "Perform gap analysis between a client& requirements and the functionality within Microsoft Dynamics CRM (online). "}
{"text": "Responsible for overseeing the company & requirements, development, testing and deployment of Microsoft CRM projects. "}
{"text": "Create a project plan including hourly estimates by task and milestones to serve as a guide throughout the project. "}
{"text": "Participate in the project meetings."}
{"text": "Integrated MS Dynamics apps with Mobility, Outlook Connector, Marketing Automation, Field Service, and third party apps."}
{"text": "Responsible for designing and setting Dynamics 365 CRM Social Insights."}
{"text": "Development of plugins, Custom Workflow using C#."}
{"text": "Integration with MS Dynamics CRM 2016 Online using Azure Logic Apps, Web Jobs."}
{"text": "Developed micro services to allow bidirectional integration using RESTful interface."}
{"text": "Design new Project Management Database in Microsoft CRM. Prepare, import and verify data integrity in new database. "}
{"text": "Create custom data entry interface, custom queries and design report templates in Microsoft CRM."}
{"text": "Conducting UAT sessions."}
{"text": "User adaptation/training by gamification. "}
{"text": "Configure the connection to Microsoft Social Engagement and add the Social Insights controls to the entity forms and system dashboards."}
{"text": "Portal development using Adx Studio."}
{"text": "Upgrading Microsoft Dynamic CRM 2013 to 2016. "}
{"text": "Customize and configure the application to meet client requirements using the Microsoft Dynamics CRM."}
{"text": "Responsible for controlling the portal authentication settings."}
{"text": "Created several client side extensions using JavaScript, CSS3 and HTML5."}
{"text": "Customization Tool, Workflow Tool, or SDK. "}
{"text": "Identify creative workarounds to meet requirements without the development of custom code. "}
{"text": "Understand the functional capabilities and limitations for out of the box functionality as well as custom code. Performed Data Migration CRM 2013 to 2016. "}
{"text": "Support B2B, B2C clients to determine business requirements to further develop the CRM. "}
{"text": "Involved in Dynamics CRM data capture, integration, auditing, data mapping, importing data and creation of interfaces."}
{"text": "Design and integrate business processes and data flows between CRM applications and other applications."}
{"text": "Create custom dashboards in Microsoft CRM. Deploy CRM configure, and customizations plus report and dashboard creation."}
{"text": "Configuration of MS Dynamics CRM with outlook."}
{"text": ""}
{"text": "Technology used :MS CRM 2016, ASP.NET, SQL server, Power BI, Adx Studio, SharePoint, Active Directory, Java Script, C#, HTML 5.1 and J Query Microsoft CRM Premise 2013/ online 2016, CRM SDK, CRM forms, screens, views, workflows, reports."}
{"text": ""}
{"text": "Client: Boston Scientific, St Paul, MN \t\t\t                                               Aug’16 – Mar’17"}
{"text": "Role: MS CRM Consultant"}
{"text": "Project: Implementation of MS Dynamics CRM and integration with AX ERP. "}
{"text": "Responsibilities:"}
{"text": "Involved in requirements gathering, analysis and project planning."}
{"text": "Customized MS Dynamics CRM 2015 application based on the business requirement "}
{"text": "Created organizations, business units, groups and their relationships "}
{"text": "Integration with connectors for Dynamics (CRM to AX bi directional). "}
{"text": "Maintain the Microsoft Dynamics CRM platform"}
{"text": "Support and extend Microsoft Dynamics CRM "}
{"text": "Performed CRM 2013 to 2015 migration "}
{"text": "Translate business needs into technical requirements "}
{"text": "Ensure CRM enhancements and modifications."}
{"text": " Integrating CRM with external systems (CTI)."}
{"text": "Created Custom Entities, Custom attributes for individual business units in MS Dynamics CRM 2013 and 2015, according to their business process."}
{"text": "Collected existing infrastructure information including Active Directory, SQL server, Reporting Server instance for implementation of MS Dynamics CRM2015 system."}
{"text": "Installed and configured MS Dynamics CRM 2015 system for development and testing, configured server instance, created organizations."}
{"text": "Manage the configuration of the deployment using Power shell."}
{"text": "Developed custom web pages to retrieve and update data in MS CRM."}
{"text": "Created several client-side extensions using JavaScript, CSS3and HTML5. "}
{"text": "Migration of data from Excel source to CRM using SSIS web services. "}
{"text": "Obtained information from functional areas of the company to complete ERM reports and presentations to the Board.  "}
{"text": "Worked with Microsoft on strategy for closing business."}
{"text": "Implemented the project with sure step methodology."}
{"text": ""}
{"text": "Technology used:  Microsoft Dynamics 2015, ASP.NET, SQL server, Power BI, Power shell, SharePoint, Active Directory, Java Script, C#, HTML 5.1 and J Query "}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "GGK Technologies, Hyderabad, India\t\t\t\t\t\t\t    Mar’14 – Dec’15"}
{"text": "Role: MS CRM Consultant "}
{"text": "Project: Implementation of MS Dynamics CRM for Real estate IP.                                                                                       "}
{"text": "Responsibilities: "}
{"text": "Analyzed the business requirements and advised feasible solutions to achieve business goals."}
{"text": "Used Scribe to Integrate the Customer details and Sales Information from Sound Bank to the MSCRM."}
{"text": "Customized various system entities and created custom forms, custom fields, custom views etc."}
{"text": "Created all the security roles and users and assign those roles to Users based on the Access Rights and Privileges."}
{"text": "Perform one to one requirements gathering session with Business users and prepared the Enhancements lists in Service Module."}
{"text": "Developed the WCF services, for getting the data from non-related entities."}
{"text": "Develop scribe integrations with other Applications and to pull data from Online MS Dynamics CRM to local database for analytics and reporting purpose."}
{"text": "Design and Develop Complex ERM to describe the relation between Different custom and system entities."}
{"text": "Worked with CRM SDK for customize the entities, fields forms etc."}
{"text": "Developed Both Synchronous and Asynchronous workflows to automate various business processes."}
{"text": "Developed Plug-ins in CRM to facilitate complex business rules and validate data, create events."}
{"text": "Responsible for Providing redundancy and backup support for other team members."}
{"text": "Responsible for preparing Functional Specification Documentation as well as Technical design documentation."}
{"text": "Design and development of Dynamics CRM end-to-end implementations."}
{"text": "Developed complex reports using SSRS and deployed into MS CRM."}
{"text": "Extensively work with MS Dynamics CRM reports; SSRS and Out of the box reports."}
{"text": "Developed Jscript libraries for various data validations and customizations."}
{"text": "Designed the Security Model for the production environment."}
{"text": "Created Dashboards, Views, Reports and Charts."}
{"text": "Agile Methodology was used as repeatable sprints of design, develop, test, evaluation of projects to ensure speed, Flexibility, Client involvement, to predict cost, to identify the issues early."}
{"text": "Worked on the initial setup for the Production environment created Business Units, Roles and users, imported accounts and assigned ownership."}
{"text": "Troubleshoot issues due to unstable servers."}
{"text": "Designed and created training material for the end-client."}
{"text": "Technology used: Microsoft Dynamics CRM 2013, CRM SDK, C#, Asp.net, Visual Studio 2013, .NET Framework 4.0, MS Outlook, IIS 7.0, JavaScript, Message queues (MQ), XML, HTML/CSS, SQL Server 2008, SSRS and SSIS, TFS2012, MVC, XRM Toolbox, XML, Agile Methodology."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Inflexion Technology solutions, Bangalore, India                          \t\t     Feb’13 – Mar’14"}
{"text": "Role: MS CRM Consultant"}
{"text": "Project: Implementation of MS CRM."}
{"text": "Responsibilities: "}
{"text": "Involved in analyzing the Business Process, Requirements gathering and Project Planning. "}
{"text": "Created Custom Entities, Custom attributes for individual Business Units in MS Dynamics CRM2011 as per the Business Process. Installed CRM in Network load balancing (NLB) mode."}
{"text": "Created Reusable Helpers for JavaScript and Plugins. "}
{"text": "Involved in Development, Unit Testing and Integration Testing of most of the critical modules in this Project. "}
{"text": "Customized Workflows and Plugins for automated processes based on the requirements from different departments to increase visibility and efficiency. "}
{"text": "Developed Custom Service to provide extended functionalities to the common methods of CRM using WCF and CRM Web Service. "}
{"text": "Consumed and Exposed Dynamics CRM APIs for Custom API development. "}
{"text": "Integrated Custom WCF Service with Legacy Applications. "}
{"text": "Worked on setting up relationship between System & Custom entities. "}
{"text": "Used Advanced Find feature of MS Dynamics CRM 2011 and created multiple views of System entities. "}
{"text": "Migrated CRM data from client’s legacy ERP and contact management applications to MS CRM 2011. "}
{"text": ""}
{"text": "Technology used: MS CRM 2011, C#.Net, XML, Microsoft SQL Server 2008 R2/2012,SSRS and SSIS, TFS2012, MVC, XRM Toolbox, XML, Agile Methodology."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Zensar Technologies, Bangalore, India      \t\t\t\t\t\t     Dec’11 – Feb‘13"}
{"text": "Role: MS CRM Consultant"}
{"text": "Project: MS Dynamics CRM Implementation"}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Identify the business requirements of the client and perform gap fit analysis."}
{"text": "Configured User Interface settings according to the Company Profile."}
{"text": "Involved in implementing Microsoft Dynamics CRM 4.0 (Configuration & Customization). "}
{"text": "Prepared effort estimation based on the customization of new CRM system. Prepared requirement, design documents and high-level project plan. "}
{"text": "Configured and customized CRM application, various system entities and created custom forms, custom fields, custom views etc. based on the customer plan. "}
{"text": "Designed the workflows, system modules as per the required specifications. "}
{"text": "Involved in data migration/synchronization of existing system data into MS Dynamics CRM 4.0. "}
{"text": "Customized user profiles, custom tabs, custom fields, worked with standard objects, business processes and field-level security access to the users."}
{"text": "Designed various HTML Email templates."}
{"text": "Configured and used custom reports, report types, dashboards and dashboard components."}
{"text": "Used MS CRM SDK toolkit including to develop custom business logic."}
{"text": ""}
{"text": "Technology used:"}
{"text": "Microsoft Dynamics 4.0, ASP.NET, HTML, CSS, C#, Visual Studio, Reports and Dashboards, SQL Server 2008, SSRS and SSIS, TFS2012, , XRM Toolbox, XML, Agile Methodology."}
{"text": ""}
{"text": "\t"}
{"text": ""}
{"text": "I2space web technologies, Hyderabad, India                    \t\t                         May’10 - Nov’11"}
{"text": "Jr .NET Developer                                                                                   \t\t"}
{"text": "Credit Card Application and Management System."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Played significant role in the design and development. "}
{"text": "Extensively developed User interfaces using ASP. NET Forms. "}
{"text": "Designed and developed complete front-end application using ASP Web Forms. "}
{"text": "Designed web forms by implementing CSS, HTML and JavaScript. "}
{"text": "Designed and developed the GUI to input and retrieve data in C#. "}
{"text": "Design and developed multiple master page, user controls for the ASP .Net pages"}
{"text": "And implemented them in various pages."}
{"text": "Extensively involved in Stored Procedures Optimization. "}
{"text": "Designed reports on screen for analyzing the performance."}
{"text": "Used Web-Services to host the application on internet."}
{"text": ""}
{"text": ""}
{"text": "Technology used:"}
{"text": "ASP.NET, C#, JavaScript, Visual studio, SQL Server 2008, CSS and HTML."}
{"text": "\t"}
{"text": "\t"}
{"text": ""}
{"text": "Certifications:"}
{"text": ""}
{"text": "Certified Microsoft Dynamics CRM Customization and Configuration (MB2-707)."}
{"text": ""}
{"text": "Education:"}
{"text": ""}
{"text": "Masters in Information Systems Technology from Wilmington University, DE, USA."}
{"text": "Bachelors in Information Technology from JNTUH, Hyderabad, TS, India."}
{"text": ""}
{"text": ""}