{"text": "Name: mary mary"}
{"text": "E-Mail: mary.mary@gmail.com"}
{"text": "Address: Hefei, China"}
{"text": "Github: https://github.com/mary"}
{"text": "LinkedIn: https://linkedin.com/mary"}
{"text": "Phone No. 770829210246"}
{"text": "7+ years of industry experience as Business Analyst, including a strong understanding of Business Process Flows, Case Tools, and Business Analysis."}
{"text": "Extensive experience in the development, implementation and integration of processes within a team oriented environment, utilizing quantitative and qualitative analytical skills."}
{"text": "Strong Knowledge of SDLC methodology, project life cycle, and project management."}
{"text": "Excellent communication and presentation skills. Experience working with business users as well as senior management."}
{"text": "Extensive experience to analyze and document business requirements and functional specifications."}
{"text": "Experience in writing queries/scripts for Data Analysis and Manipulation in MS Access and MySQL using SQL scripts."}
{"text": "Strong Knowledge of Agile methodology, UML, RUP, Rational Rose, Visio Pro etc."}
{"text": "Proficient in creating Use Cases, Sequence Diagrams, Collaboration Diagrams, Task Diagrams, Flow Charts, Activity Diagrams, Class Diagrams, Business Intelligence Tools etc."}
{"text": "Good knowledge of Business Process Flows/ Modeling, Case Tools, Business Re-Engineering, Business Intelligence and Data Warehousing. "}
{"text": "Experience in conducting GAP Analysis, User Acceptance Testing (UAT), SWOT Analysis, Cost Benefit Analysis and ROI Analysis, NPV, conducting feasibility studies, scope. "}
{"text": "Creative abilities and capable of forming and maintaining positive and productive team environments."}
{"text": "Excellent Analytical Skills in Data Mining, Performance Management and Project Management to support strategic planning, goal setting, strengthen accountability, enhance decision making, and improve customer service."}
{"text": "Strong Subject Matter expertise in Corporate Finance, Investment Banking, Financial Engineering, Risk Analysis, Asset Management- risks and returns, Financing Structures, Capital Management, Portfolio Analysis, Fund Services, Cost Accounting, Financial Accounting, Mutual Fund Administration. "}
{"text": "Strong Knowledge of Operations Management, Lean Management, Six Sigma and Capability Maturity Models (CMM). "}
{"text": "Experience in conducting Joint Application Development (JAD) sessions for requirement gatherings, analysis, design, SCRUM, and Rapid Application Development (RAD) sessions to converge early toward a design and blue print acceptance to the customer, and to limit a project’s exposure to the forces of change."}
{"text": "Expert in developing BRD (Business Requirement Document), TRD (Technical Requirement Document), URS (User Requirement Document) and FRS (Functional requirement Specifications) following Agile methodology."}
{"text": "Working Knowledge of Mortgage Loan Servicing, Loan Origination, Student Loan Origination, Credit Card, Mergers and Acquisitions and Banking Industry. "}
{"text": "Effective time management skills and the consistent ability to meet client deadlines."}
{"text": "Excellent project management skills and proficient in using MS Project. "}
{"text": "Experienced in writing complex and technical reports for a varied high caliber audience. "}
{"text": "Experienced in fixed income (Pricing factors, derivatives, Risks)."}
{"text": "Strong knowledge of Interest Rate Derivatives and Credit Derivatives."}
{"text": ""}
{"text": "\n\nEXPERTISE:"}
{"text": "Operating Systems:\t\t\t\tUNIX, DOS, Windows"}
{"text": "Databases:\t\t\t\t\tMS SQL Server, MS Access, Bloomberg"}
{"text": "Methodology: \t\t\t\t               SCRUM, UML, JAD, RAD, RUP, Waterfall, Agile"}
{"text": "Skills: \t\t\t\t\t\tData Analysis; SPSS, Financial Modeling, "}
{"text": "Project Mgmt, Design & Case tools: \t              MS Project, Visio Pro, Rational Rose"}
{"text": "Quality Management:\t\t\t              Six Sigma, CMM, TQM, Lean Management and \t\t\t\t\t\t\t              Operations Management"}
{"text": "General:                    \t\t\t\tMS Word, Excel, PowerPoint, Outlook, One Note, \t\t\t\t\t\t\tAccess, MS Project\t"}
{"text": "Professional Experience"}
{"text": "Charles Schwab Corporation, July 2016 to Present"}
{"text": "Sr. Business Analyst\t"}
{"text": "The Charles Schwab Corporation provides securities brokerage, banking through Schwab Bank, and related financial services to individual investors. The corporation provides custodial, trading and support services to independent investment advisors and company benefit plan sponsors. I am involved in project in Charles Schwab Banking segment and creating an e account for customers integrated with the brokerage operations of the corporation. The account provides all retail services on line with complete security by providing identity image and catch phrase. It will not only have retail banking features, but also industry differentiating benefits like domestic &international wire transfers, real time transfers. It will also provide trading platform for individual investors with features like auto trades, derivatives trading, and even perform non financial tasks like proxy-voting, etc. with complete online support by the bank. A single window of account will be created showing trade and banking functions. "}
{"text": ""}
{"text": "Responsibilities:         "}
{"text": "Investigate analyze and transform data into set knowledge, for better understanding of tasks for diverse functional teams.  "}
{"text": "Facilitate and manage meeting sessions with committee of SME from various business areas including E-commerce, Brokerage, Fixed Income, Derivatives, Mortgage Servicing, Loan Monitoring, Collateral Management, Credit Risk Management and Asset Management."}
{"text": "Facilitate and conduct joint sessions JAD with SMEs of front office, middle office, compliance, legal, operations, IT, and client services, to elicit the requirements and develop the business requirements. Additionally, act as liaison to elicit information and requirements with outsource providers, vendors, auditors. "}
{"text": "Establish a business Analysis methodology around the RUP (Rational Unified Process), and Six-Sigma. "}
{"text": ""}
{"text": "Produced and presented various Use Cases, Sequence Diagrams, Flow Chart activity Diagrams."}
{"text": "Perform document and data analysis, mapping, research and analyze documents in SPSS, MS Access and SQL for key information, and produce written analysis."}
{"text": "Provided critical Data Integration Support."}
{"text": "Perform Gap Analysis by identifying existing system, documenting the enhancements to meet the end state requirements."}
{"text": "Created and revised Business Requirement document (BRD) and Functional requirement Document (FRD) using the Scope and Interview with stakeholders."}
{"text": "Create and manage all levels of metric reporting"}
{"text": "Working in an ever changing multi-tasked environment with high priorities, varying workloads and strict deadlines."}
{"text": "Participate in systems development efforts and new initiatives including any testing, parallels and specification input."}
{"text": "Support the implementation of new business and strategic initiatives for the corporation."}
{"text": "Environment: MS Visio, Oracle, Test Director, MS SQL Server, MS Office, Load Runner, MS Office (Word, Excel, PowerPoint, Outlook, Visio, Share Point, Project, One Note), Bloomberg, SQL, Windows, Six Sigma, SCRUM, JAD, RUP, Agile, SPSS and SDLC"}
{"text": ""}
{"text": "East West Bank, Houston, TX                                                                                                          Jan 2014 to June 2016\t\t"}
{"text": "Business Analyst "}
{"text": ""}
{"text": "East West Bancorp is a publicly owned company with $21.7 billion in assets. East West Bank is its subsidiaries and one of the largest independent commercial banks headquartered in California with over 130 locations worldwide, including the U.S. markets of California, New York, Georgia, Massachusetts, Texas and Washington. In Greater China, East West’s presence includes a full service branch in Hong Kong and representative offices in Beijing, Shanghai, Shenzhen and Taipei. I was involved in improving the debit/credit card processing and authorization project and later it was implemented in North America and Greater China Regions.  The project was about implementing a centralized infrastructure to improve development time, and reengineer the debit card process in order to expand the company’s business and provide convenience to the ATM users. Also, security features were added for credit/debit cards to block unauthorized accesses. A project on Automatic Consumer Loan Processing was also generated. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Worked extensively with SMEs in understanding and documenting their requirements pertaining to Credit Card, Debit Card Processing, and Analysis of Credit Risk, Clearance and Authorization and mitigation of risks."}
{"text": "Created functional and system specifications for the Debit Card Processing system and Pre-Approval of Consumer Loans for the authorization and settlement phases. "}
{"text": "Collaborated with different teams on Content, Web Operations, Analytics, Web Development, Integrated Marketing, Creative Services, Corporate Communications, Legal Services, 3rd-party agencies and vendors, etc."}
{"text": "Designed complex user interfaces for virtual terminals. "}
{"text": "Worked with the Business users and tech lead in gathering their requirements and data transaction information.  "}
{"text": "Responsible for preparing Software Requirement Specifications (SRS), Functional Specification Document (FSD) and final Design Document as per SEI CMM standards."}
{"text": "Attended meetings with SMEs from asset Management, Mortgage servicing, Collateral Management to define strategies."}
{"text": "Developed and implemented processes and tools for requirements gathering, Analysis, planning, tracking and delivery using Rational Rose, requisite pro and RUP"}
{"text": "Extract & load data using MS Access and Excel. "}
{"text": "Analyzed user problems, including business processes and identified, researched, investigated, defined and documented business processes"}
{"text": "Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, and Collaboration Diagrams using UML."}
{"text": "Provided scenarios and cases on AS-IS and TO-BE Business Procedures."}
{"text": "Designed business models that served to identify requirements and communicate information between teams."}
{"text": "Ensured User Acceptance Testing completion by non-technical user."}
{"text": "Used use case diagrams during analysis to capture the requirements."}
{"text": "Regularly conducted SWOT analysis, and provided assessment and identification of key aspects for a sustainable system in respect to the competitors, enhanced brand value, and better customer interaction in the region."}
{"text": "Provided regular feedback to the senior management through daily briefs, weekly assignments, monthly, and quarterly reports, providing updated documents and progress. "}
{"text": ""}
{"text": "Environment: Rational Rose, Rational Requisite Pro, Windows, Unix, Java/J2EE, MS Office, Rational Clear Case, Rational Clear Quest, Oracle, XML, HTML, Microsoft SQL Server, Load Runner"}
{"text": ""}
{"text": "Farmers Insurance Group, New York, NY                                                                                               Aug 11 to Dec 13"}
{"text": "Business Analyst                                                                                                                         "}
{"text": "Farmers Insurance Group of Companies is the country's third-largest insurer, and provides a wide range of other insurance and financial services products. Farmers operate in United States through the efforts of approximately 20,000 employees. Farmers exclusive and independent agents, along with Farmers employees, are responsible for servicing more than 15 million customers. I was involved in project to build an online qualification &pre-approval of life insurance and   matching the users with right affordable insurance, and finally connecting users with the offices or agents. Second project was on buying, renewing, auto renewal of Car insurance on line. Users were also asked to build a profile and perform the functions and profile also got stored in corporate database, for future analysis. The process was streamlined and SDLC & Six-Sigma methodology was followed for smooth flow. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Analyzed business requirements and segregated them into Use Cases and activity diagrams using Rational Rose according to UML methodology thus defining Data Process Models."}
{"text": "Designed the business requirement collection approach based on the project scope and SDLC methodology. "}
{"text": "Co-authored business requirements document with project teams. Extracted, discussed, and refined business requirements from business users and team members. Carried out detailed and comprehensive business analysis with the RUP methodology."}
{"text": "Discussed with SME from Security, Accounts (Payable & receivable), Legal Cells."}
{"text": "Identified, researched, investigated, analyzed, defined and documented business processes through Use Cases, Sequence Diagrams, Flow Chart activity Diagrams, using MS Excel, PowerPoint and Visio. "}
{"text": "Performed GAP Analysis for existing systems enhancements, and to make process more user friendly. "}
{"text": "Used Data mapping for collecting the data."}
{"text": "Liaison with other corporate departments, including  Human Resources, Finance, Executive, Legal and Information Services as well as vendors, for sharing information and project flow, and collecting latest developments.  "}
{"text": "Researched and analyzed operational procedures and methods and recommended changes for improvement-with an emphasis on automation and efficiency."}
{"text": "Development of On- LineSupport and Information, for Third Party Vendors, and authorized dealers. "}
{"text": "Conducted UAT sessions for making process user friendly and provided training to users, associates on automated systems."}
{"text": ""}
{"text": "Environment: MS Office (Word, Excel, PowerPoint, Outlook, Visio, Share Point, Project, One Note), SCRUM, SQL, Six Sigma, SWOT, Gap Analysis, Lean Management, UML JAD, RUP, Agile, SDLC "}