{"text": "Name: dorothy dorothy"}
{"text": "E-Mail: dorothy.dorothy@gmail.com"}
{"text": "Address: Shaoyang, China"}
{"text": "Github: https://github.com/dorothy"}
{"text": "LinkedIn: https://linkedin.com/dorothy"}
{"text": "Phone No. 466732029160"}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "Over 7 years of extensive experience in designing User Interface (UI) applications and professional web applications using HTML, HTML5, XHTML, CSS, CSS3, JSP, JavaScript, jQuery, PHP, AJAX, JSON, XML, AngularJS, Backbone.js, Node.js, Bootstrap and Adobe Photoshop."}
{"text": "Experience in CSS pixel-level layout, Consistency with browsers, Version and Platform Independence."}
{"text": "Produced visually appealing designs focused on usability, utility, UX, cross-browser compatibility, followed W3C standards."}
{"text": "Extensive experience in jQuery, jQuery plugins, AJAX, dynamic HTML, JSON, AngularJS with Bootstrap and node.js."}
{"text": "Developed UI using jQuery and JavaScript Library for Web Application and Mobile Application. "}
{"text": "Extensively developed Rich Internet Applications and various UI widgets using jQuery. "}
{"text": "Designed new classes and functionalities using various JQUERY components for CRM application for customer service. "}
{"text": "Experience in using Infragistics, Telrik and Kendo-UI gird controls."}
{"text": "Good experience in working with the AngularJSfor heavy DOM applications."}
{"text": "Specialized in developing Web 2.0 Apps using core jQuery along with AJAX/JavaScript."}
{"text": "Worked extensively on API-driveninteractive applications that utilize the AJAX technology."}
{"text": "Proficient in developing Single Page Applications (SPA) using handlebars, backbone.js and node.js."}
{"text": "Experience in using version control tools such as SVN, CSV and GIT."}
{"text": "Good experience in developing web Applications using Spring MVC, Struts framework implementing Action Controllers, Action Forms, Spring Validation Framework and Spring Tag Libraries. "}
{"text": "Extensive knowledge of social networking integration via Facebook API, and Twitter REST API. "}
{"text": "Good Experience in working with Firebug for Mozilla and IE Developer Toolbar for Internet Explorer, Web Inspector for Safari, Developer Toolbar for Chrome."}
{"text": "Expertise in Providing both customer support and technical guidance with Section 508 Regulations. "}
{"text": "Excellent skills in relationship management with clients and effective in guiding team during the project development life cycle and deliver the product within time line, cost and quality. "}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": "Client :Micron, Boise, IDAHO\t\t\t\tMar 2014 - June 2015. Role: UI Web Developer"}
{"text": "Responsibilities:"}
{"text": "Developed user interface using HTML, CSS, JSON, JavaScript, jQuery, and jQuery UI. "}
{"text": "Worked on basic front end prototypes and page design with HTML, CSS,Java scripting, created prototypes based on static and approved wireframes using human factor designs and different layout techniques. "}
{"text": "Used jQuery to handle the client side validations. "}
{"text": "Worked extensively using CSS and Bootstrap for styling HTML elements."}
{"text": "Integrated Kendo framework controls to support HTML5 Controls."}
{"text": "Responsible for transforming designed mock-ups to web pages. "}
{"text": "Developed code for Responsive web design."}
{"text": "Expertise in Providing both customer support and technical guidance with Section 508 Regulations. "}
{"text": "Has worked in AngularJS for client side scripting and synchronizing java applications"}
{"text": "Used to update the HTML pages using jQuery, AJAX via JSON response."}
{"text": "Used MSTest for backend test cases and 'Jasmine' for angularJS test cases."}
{"text": "Oversaw the designing and development of Web pages using PHP, HTML, CSS including Ajax controls and XML."}
{"text": "Used Node.js for heavy DOM manipulation."}
{"text": "Responsible in making sure pattern is similar across all the pages. "}
{"text": "Applied jQuery scripts for basic animation and end user screen customization purposes. "}
{"text": "Used AJAX and JSON to make asynchronous calls to the project server to fetch data on the fly."}
{"text": ""}
{"text": "Environment: Photoshop, Dreamweaver, HTML5, Node.js, Bootstrap, AngularJS , Jasmine, GIT, JavaScript, Ajax, jQuery, CSS3,"}
{"text": ""}
{"text": "Client :Merck Research Labs\t, North Wales, PA\t\t  Feb 2013 – Feb 2014"}
{"text": "Role: UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Redesign and maintain existing internal web application utilizing HTML, CSS, JavaScript and JQUERY"}
{"text": "Wrote code to ensure that the application is cross browser compatibility (IE 7+ and Firefox) as per the requirements"}
{"text": "Responsible for design and development of the web pages from mock- ups."}
{"text": "Created HTML5 and CSS from Photoshop mockups. "}
{"text": "Experience in jQuery frameworks in AJAX-driven websites using proxy to get the data from the back-end in the form of JSON and XML to populate on the UI components."}
{"text": "Developed mockups and prototypes using HTML5 and CSS3. Designed new classes and functionalities using various jQuery components for CRM application for customer service. "}
{"text": "Developed cross browser and multi browser compatible web pages using HTML5, CSS3, and JavaScript."}
{"text": " Developed UI using HTML 5, Bootstrap, jQuery, and JSP for interactive cross browser functionality and complex user interface."}
{"text": "Defined and developed the application's presentation layer using HTML5, CSS3, JavaScript and jQuery Scripting."}
{"text": "Created section 508 compliant versions for PDF, MS Word, MS Excel, and MS PowerPoint documents."}
{"text": "Has worked on Jasmine that is especially used for testing javascripts."}
{"text": "Reviewing and revising day to day Section 508 Product Assessments."}
{"text": "Extensive experience of Object Oriented JavaScript design pattern and JavaScript MVC Patterns preferably AngularJS."}
{"text": "Performed unit testing using QUnit and Jasmine for consistently developing bug free code. "}
{"text": "Development of website GUI & functionality with jQuery and JavaScript."}
{"text": "Used AngularJS for heavy DOM manipulation."}
{"text": "Used GIT for source code repository and version controlling."}
{"text": "Created components like Grid, Panels, Toolbars, button and Combo-box etc."}
{"text": "Designed the application framework, selects the software and hardware platforms and determines the site navigation"}
{"text": "Perform code review with peers to ensure code optimization and web optimization techniques are followed."}
{"text": "Follow agile methodology and iteration planning."}
{"text": "Responsible for quality assurance of finished websites including the validation of web forms and links."}
{"text": ""}
{"text": "Environment:JavaScript, HTML5, CSS3, jQuery, JSON, AJAX, DHTML, XML, JSP, GIT, Jasmine, Servlets, AngularJS, Backbone.js, Bootstrap, CVS, MVC, PL/SQL, SQL"}
{"text": ""}
{"text": "Client: CVS Caremark, Chicago, IL\t\t\t\t\tMay 2012–Jan 2013"}
{"text": "Role: UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Designing and developing dynamic web pages using XHTML, CSS and JavaScript."}
{"text": "Coded extensively in jQuery with Bootstrap to make rich internet web pages and created custom date picker on the website."}
{"text": "Developed mockups and prototypes using HTML and CSS3."}
{"text": "Made AJAX calls using backbone.js for getting the data and parsing it for showing on the web page."}
{"text": "Design website and maintain the website content up to date."}
{"text": "Experience in cross browser compatibility check and thoroughly performed unit testing and integration testing."}
{"text": "Develop the online chat interface for the anonymous communication between mentors and clients."}
{"text": "Re-designing/ developing the main website to improve user experience and add new functionality."}
{"text": "Worked on the website from start to finish to give it a new look using HTML5/CSS/JavaScript."}
{"text": "Created UI designs using Web 2.0 standards."}
{"text": "Responsible for creating the screens with table-less designs meeting W3C standards."}
{"text": "Provided training, outreach and technical assistance support to a wide variety of customers on how to comply with the provisions of the Section 508 technical standards."}
{"text": "Created section 508 compliant versions for PDF, MS Word, MS Excel, and MS PowerPoint documents."}
{"text": "Reviewing and revising day to day Section 508 Product Assessments."}
{"text": "Developed CSS styles to maintain the uniformity of all the screens throughout the application and positioning of screen objects. "}
{"text": "Applied industry best practices and standards when project requirements are lagging. "}
{"text": "Implemented various Validation Controls for client-side validation and implemented custom validation controls.  "}
{"text": "Designed CSS based page layouts that are cross-browser compatible and standards-compliant."}
{"text": "Performing the different modules like login, search and download with tracking."}
{"text": "Did extensive JavaScript and jQuery programming to give AJAX functionality for the website."}
{"text": "Used agile method for requirements gathering."}
{"text": "Further tasks include management of all MySQL database and all the required tables to store different survey information related to the site."}
{"text": "Environment:HTML, CSS3, JavaScript, jQuery, Bootstrap, backbone.js, Ajax, JSON."}
{"text": ""}
{"text": "Client:\tInfotech Limited, India\t\t\t\t Oct 2010 – Dec 2011"}
{"text": "Role: UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built."}
{"text": "Identified the business requirements for the client."}
{"text": "Involved in documentation of the architecture and configuration details."}
{"text": "Developed Front end Applications to provide access to the database servers.Used XML Web services with SOAP protocol for transferring data between different applications."}
{"text": " Used JDBC to query, update and maintain Database Servers usngSQL queries."}
{"text": "Used HTML, DHTML, JSON, CSS3, JavaScript, jQuery, Ajax to create the front end applications."}
{"text": "Extensively used Javascript to make the web page more interactive."}
{"text": "Responsible for creating dynamic server side pages using JSP."}
{"text": "Updated UI as per changing needs and requirements. "}
{"text": "Bug fixes for existing software system and also software enhancement."}
{"text": "Used Firebug, Firebug Lite, IE Developer Toolbar, for debugging and browser compatibility."}
{"text": "Used jQuery for creating various widgets, data manipulation, data traversing, form validations, create the content on the fly depend on the user request, implementing Ajax features for the application."}
{"text": "Developing client side validation code using JavaScript and JQuery."}
{"text": "Creating pages in Site Core and validating the HTML code with W3C Validator."}
{"text": "Used best practices while creating the web pages."}
{"text": "Understood their existing code and made changes to adapt the new environment."}
{"text": ""}
{"text": "Environment:JDK, HTML, DHTML, CSS3, JavaScript, JSON, JSP, JDBC, JQuery."}
{"text": ""}
{"text": "Client: HCL Tech, Bangalore, Karnataka \t\t\t\tAug 2009- Oct 2010"}
{"text": "Role: Java UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Implemented GUI screens for viewing trade data using Servlets, JSP, HTML, CSS, jQuery, JavaScript and Spring MVC. "}
{"text": "Build, configured and deployed Web components on Web Logic application server."}
{"text": "Migrating code from C++ to java using the Object oriented concepts "}
{"text": "Implemented custom JSP tags for displaying trader data. "}
{"text": "Wrote the high performance multi-threaded Java code using singleton, mediator, visitor, facade, observer, template, factory, and delegate, publish and subscribe design pattern. "}
{"text": "Developed test cases using J Unit for functionality and unit testing. "}
{"text": "Wrote Java code for accessing trade data from Oracle and DB2 databases using JDBC API and SQL queries and accessed it from J2EE Web component. "}
{"text": "Environment:"}
{"text": "Java, C++, HTML, CSS, JavaScript, jQuery, J2EE, Oracle, Spring, UML, JSP, Servlets, Windows XP."}
{"text": ""}
{"text": "Citadel, India \tSep 2007 – Jul 2009"}
{"text": "Web Developer/UI Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Responsible for the overall layout design, color scheme of the web site using XHTML and CSS. Created detailed wire frames & process flows. "}
{"text": "Worked one-on-one with client to develop layout, color scheme for his website and implemented it into a final interface design with the HTML/CSS& JavaScript"}
{"text": "Implemented user interface guidelines and standards throughout the development and maintenance of the website using HTML, CSS, and JavaScript.  "}
{"text": "Developed GUI using JavaScript, HTML, CSS and JavaScript in ongoing projects"}
{"text": "Converted the mock-ups into hand-written HTML, CSS, JavaScript, XML"}
{"text": "Designed, created and implemented custom Interwoven Team Site modifications to fully automate such activities as publishing, deploying, and updating online content (HTML, JavaScript). "}
{"text": "Responsible for design and development of the Customer Relations Module"}
{"text": ""}
{"text": "Educational Skills:"}
{"text": "Master of Science , Northwestern Polytechnic University , California"}
{"text": "Bachelor of Technology ,JNTU,India"}
{"text": ""}
{"text": ""}