{"text": "Name: frances frances"}
{"text": "E-Mail: frances.frances@gmail.com"}
{"text": "Address: Zhanjiang, China"}
{"text": "Github: https://github.com/frances"}
{"text": "LinkedIn: https://linkedin.com/frances"}
{"text": "Phone No. 158441665855"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY"}
{"text": "BUSINESS ANALYST with 6+ years of hands on experience in business consulting in application development with excellent skills in client interfacing, requirement gathering, user support, quality assurance, problem solving, and documentation. "}
{"text": "Skilled in determining system requirements and specifications for complex application development projects. Past experiences of leading and interacting with business teams, programmers and technical staff at all levels. "}
{"text": "Extensive experience with Fixed Income: Treasury (Bonds, Notes, and Bill), Asset Backed Commercial Paper (ABCP), Corporate Bonds, Junk Bonds, American Depository Receipts (ADR) and Global Depository Receipts (GDR)."}
{"text": "Experienced in Financial Accounting Concepts like Journal Entries, General Ledger, Balance Sheet etc."}
{"text": "Experienced in Risk analysis, Securities and their valuation, Asset Management (risks and returns), Asset Allocations, Bond pricing, Financial Derivatives, Cash Management, financing structure, Portfolio Analysis and Management, etc."}
{"text": "In depth knowledge of the Systems Development Life Cycle (SDLC) models such as Water Fall, Spiral and RAD."}
{"text": "Experience in creating and maintaining the Requirements definition documents that included Business and Functional requirements."}
{"text": "Experienced in conducting JAD sessions, focus group and brainstorming sessions, reviews, and walkthroughs and customer interviews for various business processes."}
{"text": "Used Rational Requisite Pro for requirements management and to follow configuration management process."}
{"text": "Extensive knowledge of various SDLC methodologies: Scrum, Agile, Waterfall, RUP, Extreme Programming."}
{"text": "Skills in developing Use Case diagrams, Sequence diagrams, State Chart diagrams, and Class diagrams."}
{"text": "Exposure in creating and analyzing Data flow diagrams, and Entity Relationship diagrams."}
{"text": "Skills to track environment build release level at various point in the software building process."}
{"text": "Extensive use of UML/RUP for modeling views in Microsoft Visio."}
{"text": "Possess Project management skills such as time estimation, task identification, risk analysis and scope management and resource management."}
{"text": "Defining Test Cases, analyzing bugs, interaction with team members in fixing errors, Unit testing and User Acceptance Testing (UAT). "}
{"text": "TECHNICAL SKILLS"}
{"text": "PROFESSIONAL EXPERIENCE"}
{"text": ""}
{"text": "PNC Bank, Pittsburg - PA\t\t\t\t                  \t                      Nov 2015 – Present"}
{"text": "Business Analyst"}
{"text": ""}
{"text": "The project aimed at successfully implementing a system that would increase the efficiency of the compliance department by allowing for maintenance of a centralized database of the customers and flagging the accounts deemed high risk. The system was aimed to be able to detect fraud within banks legacy systems and applications. The system analyses and generates required information and presents them to dedicated user groups using advanced detection methodology. Multi-level fraud detection system enables multi group coordinated applications to detect and report any fraudulent activities."}
{"text": "Responsibilities:"}
{"text": "Interacted with stakeholders, development teams and end users to gather, verify and validate the requirements for the system. "}
{"text": "Analyzed business requirements and detail design of the software and used MS Share Point Server for storing requirement documents. "}
{"text": "Wrote and executed test cases for functional, GUI, and regression testing of the application to make sure that new enhancements do not break working features."}
{"text": "Worked on requirements for various modules covered under Retail and Global E-Commerce (POS) apps that include modules include FI (Account Receivable, Account Payable, and General Ledger), SD (Sales Order Process, Order Delivery), etc. "}
{"text": "Prepared Use Cases, Use Case Scenarios and elaborated those using UML diagrams like Use Case Diagrams, Activity Diagrams, Data Flow Diagrams, Business Process and Data Process Model using MS Visio and Stimulations using iRise."}
{"text": "Involved in writing and executing User Acceptance Testing (UAT) with end users. "}
{"text": "Wrote test plans for positive and negative scenarios for GUI and functional testing. "}
{"text": "Generated scripts for all written test cases for regression testing. "}
{"text": "Involved in writing SQL queries and stored procedures using Query Analyzer and matched the results retrieved from the batch log files. "}
{"text": "Worked extensively with MS SQL Server. "}
{"text": "Generated usage report in crystal reports that could later on be exported to other formats such as Word, XLS, PDF, etc. "}
{"text": "Wrote Traceability Matrix to validate that every requirement has at least one corresponding test case for one requirement. "}
{"text": "Actively involved in walkthroughs with stakeholders to discuss issues on either daily or bimonthly basis. "}
{"text": "Authenticated technical designs, User Interface (UI) created by IT developers and ensured if they tallied with the functional specifications. "}
{"text": "Communicated with stakeholders throughout the lifecycle of the project and kept them updated with the progress of the same. "}
{"text": "Ensured that all the artifacts are in compliance with corporate SDLC Policies and guidelines. "}
{"text": "Coordinated with the Project Manager and prioritized outstanding defects and enhancement/system requests based on business requirements, allowing sufficient time to ensure accuracy and consider deadlines. "}
{"text": "Conducted the meetings with the review teams to continuously improve the Quality Assurance process for the application development. "}
{"text": "Environment: Java, J2EE, Websphere, irise, DB2, SQL, XML, HTML, PHP, JavaScript, MS Office, UML, RUP and Visio."}
{"text": ""}
{"text": "VERTUCOM Coppell, TX                                                                                                           Feb 2014 – Oct 2015        "}
{"text": "Business Analyst                                                                                                                        "}
{"text": "Vertucom Inc is a privately held company in Coppell, TX and is a Single Location business. My experience was mainly with AFS (Apparel and Footwear Industry) client who is a leader in the Manufacturing industry."}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Conducted business process analysis and identifies process improvements."}
{"text": "Interacted with fixed income business heads to finalize the Business Requirements for the Risk Management process."}
{"text": "Following Agile/Scrum process participated in daily scrums and analyzed stories. "}
{"text": "Reviewed failure data, perform trend analysis, and make recommendations to improve system performance."}
{"text": "Created the GL mapping sheet to ensure proper migration of accounts within the general ledger via account codes to meet GAAP standards"}
{"text": "Performed API Level testing for web services, enhanced the Test harness and developed many Test suites using XML."}
{"text": "Performed Web Services testing and Validated XML request/response data using SOAP UI."}
{"text": "Participate in business process reengineering efforts"}
{"text": "Experienced in data analysis, database design, data mapping, data mining and data gap/anomaly. "}
{"text": "Designing and customizing data models for Data warehouse supporting data from multiple sources"}
{"text": "Identified Use cases from the requirements and wrote Use Case Specifications \nConducted JAD sessions for communicating with the all Project directors and stakeholders."}
{"text": "I dealt with Wholesale and retail data source systems and was involved with reports that were used by different Supply Chain business process namely Life of a Material, Order Management, Replenishment Order Management, Customer Management."}
{"text": "Actively participated in the project implementing Syspro(Customization, Workflow management, Business process modeling)."}
{"text": "Created Use-Cases and Business Use-Case Model after accessing the status and scope of the project and understanding the business processes"}
{"text": "Integrated RequisitePro with ClearQuest and Rose to provide all teams visibility and maintain tractability among requirements, use cases and change requests."}
{"text": "Managed all the requirements in RequisitePro, making requirements available to all team members. "}
{"text": "Prepared BRD supporting documents containing the essential business elements, detailed definitions, and descriptions of the relationships between the actors to analyze and document business data requirements."}
{"text": "Environment: BRD, FRD, Oracle, PL Sql, Clear Quest, Ms Office Suite,  Share Point, Ms Access, SOA,  Windows XP, HTML."}
{"text": ""}
{"text": "State Street, Boston, MA\t\t\t                              \t                   Sept 2012 – Jan 2014  Business Analyst"}
{"text": ""}
{"text": "State Street is the world's leading provider of financial services to institutional investors. Our broad and integrated range of services spans the entire investment spectrum, including research, investment management, trading services and investment servicing. Perform various tasks as a member of the business team including, but not limited to: task lead, requirements gathering and implementation, writing functional specifications, knowledge transfer and process improvement, internal team building, client communication and relationship, and quality assurance. In addition, possess expertise in the areas of data verification; report analysis and recommendations."}
{"text": "Responsibilities:"}
{"text": "Gathered business requirements through interviews, surveys, and observing from account managers and UI (User Interface) "}
{"text": "Conducted peer design and code reviews and extensive documentation of standards, best practices, and ETL procedures. "}
{"text": "Understand and articulate business requirements from user interviews and then translate requirements into functional and technical specifications."}
{"text": "Experience working on various modules covered under Retail and Global E-Commerce (POS) apps that include modules include FI (Account Receivable, Account Payable, and General Ledger), SD (Sales Order Process, Order Delivery), etc. "}
{"text": "Interacted with fixed income business heads to finalize the Business Requirements for the Risk Management process."}
{"text": "Following Agile/Scrum process participated in daily scrums and analyzed stories. "}
{"text": "Created and maintained Acceptance Criteria Document while working closely with the PO (product owner)"}
{"text": "Designed ETL processes to load prospects to data marts. Applied complicated marketing segmentation algorithm to select targeted prospects for mailing. "}
{"text": "Ensured that regulatory compliance and legal considerations are met in all projects. "}
{"text": "Constructed logical and physical data models and data mapping. Created Data Flow Diagrams to depict ETL processes. "}
{"text": "Maintained the traceability matrix and ensured that the requirements were consistent after the change using Telelogic DOORS."}
{"text": "Created Data Mapping Documents and Source to Target Transformation document. "}
{"text": "Prepared High Level Logical Data Models and BRD supporting documents containing the essential business elements, detailed definitions, and descriptions of the relationships between the actors to analyze and document business data requirements."}
{"text": "Developed different analytical tool for performance measurement, supported the management team with different reports and business presentation for monthly EBIT meeting and quarterly board meeting"}
{"text": "Analyzed the existing system and process gaps in context of new business changes (Gap Analysis)."}
{"text": "Conducted JRP sessions with management, SMEs (Subject Matter Expertise), vendors, users and other stakeholders for open and pending issues to develop specifications. "}
{"text": "Involved in Joint Application Development (JAD) sessions with the IT Group. "}
{"text": "Worked closely with the UI team to model the screens, which met user defined requirements, organizational and regulatory standards. "}
{"text": "Designed Test Cases and Test Plans; Prepared Data Mapping document for the application after finalizing the attributes and tables with business users. "}
{"text": "Used SQL, Data Warehousing and Data Cleansing for the arrangement of customer data. Used Data mapping for collecting the data."}
{"text": "Configured model design tool (Power Designer), metadata repository, and analytical/reporting tool (Business Object) and set up Environment. "}
{"text": "Held group meetings, walkthroughs and supervised/trained other analysts."}
{"text": "Developed and maintained relationships with clients on all on-going projects. "}
{"text": "Established a corporate finance data repository assisting in credit score carding."}
{"text": "Responsible for the completion of projects within specified time and budget dealing with financials, project workflow, change management and dealing with vendor relationships."}
{"text": "Integrated an external credit score carding system into internal risk management system by identifying management requirements and implementing automatic information upload."}
{"text": "Performed System and Integration Testing along with testers. Conducted UAT with the business. "}
{"text": "Assisted with Test Cases and developed strategies with Quality Assurance group to implement them. Efficiently responded to client inquiries and resolved discrepancies. Identified, prioritized, tested and proved essential business functions to assure compliance with vendor and internal auditing. "}
{"text": "Environment: Oracle, SQL, Windows 2000, Clear Quest, Agile Scrum, MS Visio, MS Project Professional."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Fidelity Investments, Boston, MA                        \t\t \t                             March 2011 – July 2012"}
{"text": "Business Analyst"}
{"text": ""}
{"text": "Fidelity Investments is an international provider of financial services and investment resources that provides mutual fund administration and accounting, collateral management, Options Futures, securities lending, and stock clearing and transfer services. The site contains detailed functional design for the Quotes and Research tab developed in the framework of the Real Time Research. The investment site is created using HTML, Java, and Oracle enables potential customers to perform Searches for the Stocks Rates, Bonds and how the market is doing currently. It gave real time and complete news and stories about the recent events related to Investment (such as Stock, Bond and Market). The functionality also includes the comparison of two stocks as well as if you want to know the detail of the stock such as when was the last time that particular stock was traded against how much it is trading now."}
{"text": "Responsibilities:"}
{"text": "Interacted with the SMEs and stakeholders to get a better understanding of client business processes and gather business requirements. "}
{"text": "Modeling the As-Is system and doing the complete Gap Analysis for the existing system in order to map it to the To-Be system. "}
{"text": "Identified Use cases from the requirements and wrote Use Case Specifications \nConducted JAD sessions for communicating with the all Project directors and stakeholders."}
{"text": "Assisted with developing algorithms with FX option straddles which offer the opportunity to limit loss, while maintaining the potential of profiting from a favorable move in a currency "}
{"text": "Assisted in the standard pricing of FX futures which enabled traders to focus on the direction of the market."}
{"text": "Linked business processes to organizational objectives, perform critical path analysis, and identify opportunities for business process improvement "}
{"text": "Communicated extensively with the clients and with different levels of management to identify requirements, use cases and to develop functional specifications."}
{"text": "Created Use-Cases and Business Use-Case Model after accessing the status and scope of the project and understanding the business processes"}
{"text": "Integrated RequisitePro with ClearQuest and Rose to provide all teams visibility and maintain tractability among requirements, use cases and change requests."}
{"text": "Managed all the requirements in RequisitePro, making requirements available to all team members. "}
{"text": "Managed the Metadata Repository associated with the ETL processes used to populate the data warehouse."}
{"text": "Involved in designing and analyzing the data warehouse using Reverse engineering and Forward engineering methodology and the respective dimension tables were designed and generated."}
{"text": "Assured that all Artifacts are in compliance with corporate SDLC Policies and guidelines. "}
{"text": "Coordinated and prioritized outstanding defects and enhancement/system requests based on business requirements, allowing sufficient time frame to ensure accuracy and consider deadlines"}
{"text": "Wrote SQL queries to test the database backend. Created Data Flow Diagrams (DFD’s). Assisted and Participated in conceptual and logical data modeling of the databases. "}
{"text": "Monitored client expectations and conducted user interviews."}
{"text": "Environment: UML, Windows, SQL, Microsoft Office suite, HTML, Agile, Quality Center."}
{"text": "EDUCATION"}
{"text": "Master of Business Administration (MBA) in Finance      \t\t\t\t      Newark, NJ\t\t       "}
{"text": "                                                                  "}