{"text": "Name: anna anna"}
{"text": "E-Mail: anna.anna@gmail.com"}
{"text": "Address: Yancheng, China"}
{"text": "Github: https://github.com/anna"}
{"text": "LinkedIn: https://linkedin.com/anna"}
{"text": "Phone No. 693698525519"}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY"}
{"text": ""}
{"text": "Business Analyst with over 6 years of experience supporting business solutions and analyzing business operations with an extensive experience in the Healthcare domain gained through exposure in innovative business processes and projects, while coordinating teams to meet the organizational demands, eliciting business requirements and implementing changes within the organization. I wish to expand my knowledge, contribute by using my strong analytical and prioritization skills to support the organizational needs in achieving the desired result in the most cost effective fashion that drives maximum revenue."}
{"text": ""}
{"text": "In depth understanding and knowledge in Technical Business Writing and Communication, Business Process Flow, Business Process Modeling, Business Analysis, Requirement Elicitation, Requirement Documentation, Visual Modeling and Presentation."}
{"text": "Experience and knowledge in all phases of SDLC with Agile, Waterfall, RUP methodology and Internal SDLC and technology delivery frameworks."}
{"text": "Expertise in Project Initiation, Planning, Organizing, Directing, Scoping, Estimating, Scheduling, Budgeting and Drafting remedy procedures."}
{"text": "Expertise in creating mock-up, wireframes and prototypes for User Interface Design using Axure RP and MS Visio."}
{"text": "Experience in creating various artifacts for the projects such as specification documents, BRD, data mapping and data analysis documents."}
{"text": "Experience and in depth knowledge of the processes of Regression Testing, Integration testing, UAT, Ad-hoc Testing, Smoke testing, Unit Testing and System testing."}
{"text": "Expertise in HIPAA/EDI Medical Claim Analysis, Design, Implementation and Documentation."}
{"text": "Clear understanding of the ICD-9CM and ICD-10CM/PCS standards. Well versed with ANSI X12, HIPAA and HL7 standards and knowledge of FACETS support systems and compliance standards for HIPAA and EDI X12 transactions (834, 835, 837, 270/271, 276/277)."}
{"text": "Experience in writing SQL queries to generate reports, extract data from multiple databases for data mapping and analysis."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE"}
{"text": ""}
{"text": "State Farm – Richardson, Texas  \t\t\t\t       March 2016 – June 2018"}
{"text": "Business Analyst"}
{"text": ""}
{"text": "Project: This project was initiated to integrate Special Enrollment Period (SEP) module into its existing Angular.js framework for the year 2017 and 2018. The system solution allows the Users to access the web portal and validate weather they are eligible to process SEP request claims and encounters."}
{"text": ""}
{"text": "Roles and Responsibilities "}
{"text": ""}
{"text": "Facilitated Surveys, User meetings, interviews and Requirement Elicitation Sessions to extract the business requirement from our business team."}
{"text": "Documented the Business, System and functional requirement from the Business team by conducting detailed interviews and surveys regarding the legal implications associated with SEP."}
{"text": "Conducted the meeting to elicit the requirements and create the BRD to determine the scopes and objectives of the project, map out the business needs and develop business processes using task-flow and work-flow analysis for pre-initiation of the Project."}
{"text": "Collaborated with the Business team, Product owner and the Software Development team to translate business requirement into user stories for the development team to implement."}
{"text": "Designed and developed the Use Cases, User Stories, UML and Activity Diagram to facilitate the business requirements using Visio."}
{"text": "Facilitated the project development to clear out any roadblocks or miscommunication during the development phase by simplifying and complying with the requirements."}
{"text": "Actively participated in the daily Scrum Meetings to follow up with the business requirements, review product backlogs and plan out the different iterations of the development phases in the sprint cycles."}
{"text": "Worked with QA team in the areas of regression testing, integration testing, functional testing and system testing before deploying functional UI for the end-users."}
{"text": "Validated technical designs created by IT developers against functional specifications."}
{"text": "Development Environment- Agile (scrum)"}
{"text": ""}
{"text": "HPS-Milwaukee\t\t\t\t\t\t     April 2014- January 2016"}
{"text": "Business Analyst"}
{"text": ""}
{"text": "Project- HealthCare Payment System offers payment solutions to enhance the consumer healthcare billing and payments experience, while driving value to healthcare providers, health insurance companies and employers. This project involved working with Medical City Women’s Hospital of Dallas to integrate the payment system into its existing HPS portal."}
{"text": ""}
{"text": "Roles and Responsibilities "}
{"text": ""}
{"text": "Responsible for analysis and evaluation of user business problems and development of system recommendations to meet the requirements. "}
{"text": "Translate high-level business requirements into functional specifications for business application development. "}
{"text": "Responsible for the full HIPAA compliance lifecycle from gap analysis, mapping, implementation and testing for the processing of Medicaid claims."}
{"text": "Worked directly with EDI developers, other team staff and users to ensure functional and technical requirements are met. Designed documents written to accurate specifications for FACETS tasks associated to any EDI transactions."}
{"text": "Analyzed and studied the technical, structural and data content changes for EDI transaction sets 835(Claim Payment/advice)."}
{"text": "Performed complex research and analysis of customer support issues/inquiries and EDI system alerts."}
{"text": "Performed analysis and updates to EDI transactions notes/specs as it relates to any mapping changes, FACETS tasks or HIPAA/business users requests/changes."}
{"text": "Served as information systems liaison with vendors, Information Services, end users, etc."}
{"text": "Created specifications for EDI HL7 (A28, A31 and ADT) and X12 (837/835) transactions that were transmitted between Claims Editor and Legacy Billing application and external payers."}
{"text": "Conducted analytical work, wrote work documents/findings, made recommendations to implement process improvements."}
{"text": "Effectively communicated and interacted with staff, managers, clients and vendors to support the business solution."}
{"text": "Conducted payment reviews to validate payments for invoicing against client systems."}
{"text": "Validated the functional aspect of the web application to ensure accuracy against the functional requirements."}
{"text": ""}
{"text": ""}
{"text": "BlueCross BlueShield of Mississippi - Flowood MS    \t                 Jul 2012- Feb 2014"}
{"text": "Business Analyst                                  "}
{"text": ""}
{"text": "Project- This project involved analysis and enhancement of their in house healthcare application in order to be able to accept and execute EDI transaction sets 834 (Enrollment and Maintenance), 837 (professional, Institutional and Dental claims and 835 (claim Payment/advice) as per HIPAA (ASC) X12 5010. The project scope also involved laying the foundation for broader transformational change from ICD-9 to ICD-10 while also implementing new initiatives such as value-based reimbursement on their EMR/HER platforms."}
{"text": ""}
{"text": "Roles and responsibilities"}
{"text": ""}
{"text": "Coordinated with Business Owners, Application Vendors, Payers, and Clearing houses to bring all processes to a level of execution to mitigate any impact to current revenue flow under the 5010-compliancy requirements."}
{"text": "Gathered and validated inventory of applications interfaces and reports that needed to be modified to comply with ICD-10 requirements for accurately processing Medicare claims using the Diamond system. "}
{"text": "Responsible for testing HIPAA EDI transactions and mainly focused on PA and Eligibility Transactions."}
{"text": "Implemented 837, 835,270,271,997 HIPAA documents."}
{"text": "Performed extensive requirement analysis including Data analysis and Gap analysis."}
{"text": "Designed and developed Business Rule Document pertaining to the Claim Component and HIPPA."}
{"text": "Developed and implemented weekly metrics management for availability management, capacity management and security management utilizing the ITIL process framework."}
{"text": "Helped with building ICD-9 to ICD-10 crosswalk map by grouping thousands of codes and range in Clinical, Benefits, Financial and Medical policy waves."}
{"text": "Performed Gap analysis between partner specks and internal system requirements by matching HIPAA 4010 to 5010 implementation techniques. "}
{"text": "Responsible for the full HIPAA compliance lifecycle from Gap analysis, mapping, implementation and testing for the processing of the Medicaid claims."}
{"text": "Prepared use cases and data flow diagrams to analyze the impact of ICD 10 diagnosis codes, CPT and HCPCS codes embedded in different system and application."}
{"text": "Analyzed the testing results to ensure that the results were in accordance with the Gap analysis and expected results for 5010 compliance."}
{"text": "Used UML for specifications, Documentation and Construction of systems."}
{"text": "Worked closely on 834-transaction code for benefit Enrollment and was involved in validation of HIPAA for 834,270/271, 276/277,834 EDI transaction."}
{"text": "Collaborated with the QA team in the creation of UAT test plan, UAT test scenarios and UAT test cases."}
{"text": ""}
{"text": "EDUCATION"}
{"text": ""}
{"text": "Northeastern Illinois University |Chicago, IL| 2012"}
{"text": "Bachelor of Business Administration "}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}