{"text": "Name: annie annie"}
{"text": "E-Mail: annie.annie@gmail.com"}
{"text": "Address: Hengyang, China"}
{"text": "Github: https://github.com/annie"}
{"text": "LinkedIn: https://linkedin.com/annie"}
{"text": "Phone No. 467366534622"}
{"text": ""}
{"text": "Professional Summary:"}
{"text": ""}
{"text": "8 years of strong IT professional working experience in object oriented design, development of web and window based applications using .NET Technologies. "}
{"text": "Developed and enhance software based on conceptual and technical designs as per business requirements."}
{"text": "Worked with business analysis and requirement gathering in Agile Methodologies such as SCRUM, Test Driven methodologies."}
{"text": "Worked closely with the project managers to guarantee timely delivery."}
{"text": "Experience in all phases of System Development Life Cycle (SDLC) from investigation of initial requirements through analysis, design, programming, testing documentation and implementation. "}
{"text": "Extensive experience in using .Net components: C#, ASP.Net, Classic ASP.Net, VB.NET, PL/SQL, ASP.Net MVC, ADO.Net, ADO.Net Entity Framework."}
{"text": "Experience in back end components like RESTFUL, XML Web services (SOAP, WSDL), Web API, WCF Services and Windows Servicesand Experience with Service Oriented Architecture (SOA)."}
{"text": "Experience in UI Development using HTML5, DHTML, CSS, JavaScript, Angular JS, Node.js, Bootstrap,AJAX, JQUERY, Kendo UI, JSON, and XML. "}
{"text": "Experience in developing applications using AngularJS and Bootstrap framework. "}
{"text": "Extensive experience in building web, windows and mobile solutions using visual studio."}
{"text": "Experience with Mobile Development and responsive design Using UML. "}
{"text": "Experience in usage of third party tools Telerik RAD control and scripting languages JavaScript and VB Script. "}
{"text": "Experienced in Waterfall SDLC, V Model and a testing process; testing of applications in Iterative testing methodology in a rapid deployment model. "}
{"text": "Implemented SOA architecture through WCF services which used to rapidly building service-oriented applications that communicate across the web and the enterprise with features Serialization, Versioning and Interop."}
{"text": "Experience in using Web Server – IIS and DNS."}
{"text": "Excellent in .Net client applications and their development including web and window applications (WinForms). "}
{"text": "Extensive Experience in designing and developing the Reusable User Controls (.ascx), Customer Controls in ASP.Net Web Pages/Forms."}
{"text": "Good Experience in designing and developing the Reusable User Controls using Partial Views, and Layouts for creating common look and feel among all the web pages in ASP.Net MVC Web Applications. "}
{"text": "Strong experience in developing the reusable components like assemblies by Implementing the OOPS Concepts and Creating the Class Libraries. "}
{"text": "Used TeamCity for continuous integration and Octopus Deploy for deployment of application."}
{"text": "Used Jira for bug tracking."}
{"text": "Document Authoring on SharePoint, Windows Azure, AWS, Cloud Services (Architectures and Developments)."}
{"text": "Expertise in Design and migration to Azure platform and AWS platform. "}
{"text": "Experienced in creating reports using Crystal Reports, SQL Server Reporting Services (SSRS) and SQL Server Integration Services (SSIS)"}
{"text": "Created and managedSQL Server, Azure."}
{"text": "Experience in Creating Data Access Layer using ADO.Net and ADO.Net Entity Framework to communicate with the Databases like MS SQL Server,PostgreSQL, mongo DB, Oracle and MS Access."}
{"text": "Experience with Mobile Development and responsive design(android and IOS). "}
{"text": "Strong experience in creating Databases, Tables, developing Complex T-SQLStored Procedures, Views, Cursors, Scripts, Triggers."}
{"text": "Creating WPF/Silverlight applications using MVVM architecture."}
{"text": "Experienced in Telecommunication Billing and Invoice Reconciliation Systems."}
{"text": "Worked with e-commerce databases. "}
{"text": "Strong hands-on experience with MS-Office, MS-Access, MS-Front Page, MS- Power Point, MS Excel and MS Project."}
{"text": "Ability to work within a fast-paced environment, and interact supportively within a team, problem solving skills (debugging and troubleshooting), fixing bugs in application and N-Unit testing."}
{"text": "Strong mathematical and logical skills with extreme accuracy to detail and excellent communication and interpersonal skills with the ability to work on multiple projects simultaneously. "}
{"text": "Used Team Foundation Server (TFS), GIT, SVN and Visual Source Safe 6.0 for Version Control. "}
{"text": "Authorized to work in the US for any employer."}
{"text": ""}
{"text": "Professional Experience:"}
{"text": ""}
{"text": "Role:Senior .Net Developer"}
{"text": "Client:Gov of District Of Columbia, DC"}
{"text": "Duration:Jan2016 to Present"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Designed and developed various web pages using ASP.NET MVC 3.0/4.0, C#, HTML, JavaScript, server controls such as Grid View, Validation controls. "}
{"text": "Developed web application using ASP.Net MVC, ASP.Net WEB API,IIS, PowerShell, Angular JS, KendoUI, and JQuery."}
{"text": "Followed specific agile developments like iterations, teamwork, collaboration, and process adaptability throughout the life-cycle of the project."}
{"text": "An Agile Scrum methodology was processed for daily stand up meeting with team members to know the current progress of the project and raise the issue if any."}
{"text": "Collaborated effectively within a global IT environment across multiple divisions."}
{"text": "Expertise in AngularJS controllers, directives, components, factory and service resources, routings andevents. Expertise in DOM manipulation using JavaScript, jQuery and AngularJS."}
{"text": "Used AngularJS and AngularUI bootstrap to develop the front end part. "}
{"text": "Created responsive web design using HTML5, Bootstrap3 and AngularJS. "}
{"text": "Developed a single page, mobile-first web application for real-time location sharing utilizing AngularJS, JavaScript API."}
{"text": "Responsible in design and development of responsive WPF UI built using MVVM and GoF pattern. "}
{"text": "Interacting with middle tire developer to define contract to communicate between WPF UI and WCF Services."}
{"text": "Optimized the code and developed web pages for payment system, extensively used KendoUI. "}
{"text": "Responsible for building the UI for the transaction flow portal using Kendo UI, MVVM and Ajax. "}
{"text": "Implemented AngularJS Controllers to maintain each view data. Implemented Angular Service calls using Angular Factory."}
{"text": "Designed, developed and enhanced the application using .NET Framework 4.0 and Visual Studio2012. "}
{"text": "Working on dependency binding and declarative tracking using Node.JS. "}
{"text": "Involved in design and developing case management system web screens using ASP.Net MVC 4.0 Framework and had knowledge on Web API (Restful). "}
{"text": "A migration project from a classic ASP application with Data-Islands to a dynamic ASP.NET MVC application with cross browser compatibility, for both provider and state facing. "}
{"text": "Developed mobile and desktop applications(Android and IOS) using C# and VB.NET."}
{"text": "Application development was based on UML methodology. "}
{"text": "Involved in Production support for Mobile site issues."}
{"text": "Working on synchronizing data model and user interface controls using Node JS."}
{"text": "Involved in all the tiers of this application. Worked on Data layer, Business layer and UI Layers. Developed Business and Data tier using .Net MVC, C#, ADO.NET. "}
{"text": "Used Telecommunication Billing and Invoice Reconciliation Systems for insurance CLAIMS."}
{"text": "Design and Develop MVC Razor Views for GUI."}
{"text": "Used Ninject to implement Dependency Injection (DI) when developing Components for MVC Architecture."}
{"text": "Extensively used LINQ - Entity."}
{"text": "Worked extensively with Disconnected Data Sets using ADO.NET to perform Database actions. "}
{"text": "Developed Master Pages and web enabled online panels for data entry using ASP.NET forms and submitted the same for processing to the appropriate Manager."}
{"text": "Developed operational contract of WCF (windows communication foundation) service to fetch messages and message details from database. "}
{"text": "Developed a password distribution module, which will display the initial password to the account owners. "}
{"text": "Created Stored Procedures for accessing, inserting and updating data group member and other related information. "}
{"text": "Windows Azure Architecture Implementation."}
{"text": "Worked on enhancing and deploying the SSIS Packages from development server to production server. "}
{"text": "Setup the Database in Development, Production environment in Cloud-Microsoft SQL-Azure."}
{"text": "Design and implement a private cloud for internal enterprise use, complete with internal marketplace as well as capability to connect to various commercial clouds."}
{"text": "Created, Modified Stored Procedures Triggers, tables and Views on SQL Server."}
{"text": "Used Silverlight and WCF RIA services for showing few reports."}
{"text": "Successfully migrated the Django database from SQLite to MySQL to PostgreSQL with complete data integrity. "}
{"text": "Deploying and adding new machines to a running data base, balancing load and duplicating the data to keep the system up, using Mongo DB, in a multi-server environment."}
{"text": "Configuring high availability using geographical MongoDB replica sets across multiple data centers.  "}
{"text": "Used Telerik MVC control for grid layouts and calendar layouts. "}
{"text": "Developed and implemented new feedback system for users concerns, bugs, and defect tracking regarding use and functionality of new interfaces. "}
{"text": "GIT, JIRA for Bug analysis, Tracking and fixes in web-industry standards. "}
{"text": "Developed web applications using principles of Test-Driven Development, with an eye to Continuous Integration enabled by TeamCity."}
{"text": "Responsible for designing, developing and deploying collaboration portal and Master data workflow using SharePoint Portal Server (SPS), Windows SharePoint Services (WSS) and, .NET Framework. "}
{"text": "Used JavaScript, jQuery and AJAX for client side validations and scripting in the Web Pages. Experienced in developing online business intelligence dashboards with rich user friendly interfaces, charts,"}
{"text": "Performed unit testing, regression testing on various new and existing modules. "}
{"text": "Providing support on addressing existing production issues and defects. "}
{"text": ""}
{"text": "Environment: ASP.NET MVC 4.0, C#, VB.NET, Agile, Angular JS, Web API, Mobile Applications (Android and IOS), UML,Bootstrap, SQL Server 2008 R2/ SQL Server 2012/2014, T- SQL, SSIS, Mongo DB,PostgreSQL, Web Services, WPF, MVVM, Kendo UI, Wix, AJAX Control Toolkit, JavaScript, jQuery, Ninject,Node.JS, HTML, IIS 7.0 , Powershell, Azure, RAD,Telerik, Teamcity Windows8, TFS, GIT, Microsoft Visio 2012, Visual Studio 2012, .Net Framework 4.5, Silverlight, Microsoft Reporting Services (SSRS), Clear Case."}
{"text": ""}
{"text": "Role: Senior .Net Developer"}
{"text": "Client:Humana Inc, KY "}
{"text": "Duration:September 2013 to October 2015"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in the Development and Testing phases of SDLC. "}
{"text": "MVC Design Pattern followed for ASP.Net application development. "}
{"text": "Implemented Agile Methodologies and SCRUM Framework in the iterative process of development. "}
{"text": "Implemented Routing for the Web Application using Angular JS UI Routing."}
{"text": "Designed Frontend with in object oriented JavaScript framework like Angular JS."}
{"text": "Created Custom AngularJS Directives for the application."}
{"text": "Create Custom layout using Kendo UI, JQuery UI and bootstrap. "}
{"text": "Helped implement a backend CQRS with event sourcing in node.js."}
{"text": "Participated in estimations by interacting with end user and analyzing complexity of the application while redesigning legacy application by using latest technology stack (C#, Entity Framework (EF5), MVC & WCF)."}
{"text": "Reengineered the existing Application using ASP.NET MVC4.0 and Entity Framework (EF4) for referring individuals to forms within a network."}
{"text": "Developed User controls using ASP.NET, VB.NET and used them dynamically in the web pages using Master pages and CSS. "}
{"text": "Involved in supporting, enhancing existing mobile site application using ASP.NET, MVC, CSS, HTML, Bootstrap, XHTML, and JQuery."}
{"text": "Developed WCF Services and secured the services with token based authentication which will be passed from Mobile devices. "}
{"text": "Worked with Telerik to display huge amount of data to the inbuilt grid controls. "}
{"text": "Presentation layer (GUI) application has been created using MVC 4.0 Razor View, ASP.NET 4.0, MS Visual Studio 2010, and HTML."}
{"text": "Used AJAX Library, CSS, JavaScript and various web controls to present data to users in a much comfortable environment. "}
{"text": "Enabled Client-side Data Validation in .NET using the validation controls like Regular Expression validator, Required Field validator. "}
{"text": "Used jQuery a concise JavaScript Library for traversing HTML document, event handling and AJAX interactions. "}
{"text": "Involved in developing applications in C# to meet the business requirements using Visual Studio.NET 2008. "}
{"text": "Used ASP.NET AJAX Toolkit controls like Script Manager, Update Panel and Timer in some web pages. "}
{"text": "AWS Cloud management and Chef Automation.  "}
{"text": "Involved in portal GUI design using Master page, Login control, Site map and Microsoft menu Control and client side validation is done by Ajax validation extenders. "}
{"text": "Worked extensively on web forms and data binding controls like Grid View, Data List and drop down boxes and Mapping page fields to the database fields. "}
{"text": "Performed the methods by using Web API."}
{"text": "Used the Object Oriented Programming (OOP) techniques and created classes (in C#.NET) for database access. "}
{"text": "Designed the database using ADO.NET and was involved in writing and maintaining complex SQL Queries and the required Stored Procedures and Triggers. "}
{"text": "Used ADO.Net such as Data Reader, Data Adapter, Dataset, Data Table and Data View for retrieving, querying and manipulating data in the database. "}
{"text": "Worked with Data Sync of Oracle with Mongo where the inserts/updates happen in Oracle DB, should reflect those changes in Mongo DB."}
{"text": "Used Mongo DB, in-memory caching along with SQL Server."}
{"text": "Fixing the bugs and checking the modification into central repository system (JIRA)."}
{"text": "Used Jenkins for continuous build system."}
{"text": "Designed and implemented reusable software elements like Custom Controls and also User Controls using ASP.NET. "}
{"text": "Used web server controls like Login Control, Menu Control and Substitution Control extensively in designing web forms. "}
{"text": "Achieved Master/Details presentation format of displaying data using Grid View and Details View. "}
{"text": "Involved Octopus Deploy in Deployment of the web application to the server. "}
{"text": "Proficient in creating Services and Endpoints using WCF (Windows Communication foundation)."}
{"text": "Integrated WCF services to enable effective communication."}
{"text": "Created packages using SSIS for extracting data from flat files, MS Excel files, OLEDB, MS Access to SQL Server database. "}
{"text": "Involved in providing technical support and maintenance for the application running at IIS 7.0."}
{"text": "Programmed LINQTOSQL for  between application and database, used extensively Data Grid."}
{"text": "Used LINQ to Entity Framework using lambda expressions for communicating between business layer and database."}
{"text": "Involved in Unit and Integration testing for quality assurance purpose."}
{"text": "Involved in the testing of the UI Interface and cross browser testing."}
{"text": ""}
{"text": "Environment: Visual Studio 2010, C#, .NET Framework 3.5, MVC 4.0/3.0, WCF, Agile, Angular JS,Entity Framework 4/5,ADO. Net, ASP. Net, VB.NET,Mobile applications(Android and IOS), Bootstrap, Octopus Deploy, Web Services,Jenkins, AJAX, Telerik, Node.JS, CSS 3, Web API, Kendo UI, AWS, XML, XSLT, HTML5, DHTML, Oracle 11g, SQL Server,PostgreSQL, Mongo DB, TFS and LINQ."}
{"text": ""}
{"text": "Role:.Net Developer"}
{"text": "Client:United Health Group - Minnetonka, MN"}
{"text": "Duration:June 2012 to July 2013"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Worked in Coding for retrieving data from XML and Excel files provided and check them according to AEP Standards. "}
{"text": "Used Agile Scrum project for the risk data team and assigning sprint work item to developers and conducting sprint review meeting."}
{"text": "Used Agile Scrum Methodology as the development process for the project implementation. "}
{"text": "Feasibility study of new developments and requirements. "}
{"text": "Designed Frontend with in object oriented JavaScript framework like Angular JS."}
{"text": "Created Custom AngularJS Directives for the application. "}
{"text": "Worked with entity framework to connect database and web application."}
{"text": "Data retrieval and manipulation using SQL Server 2012 and Entity Framework."}
{"text": "Developed dynamic ASPX web pages for Application using ASP.NET, C#.NET, XML, XSL/XSLT, HTML5, JavaScript. "}
{"text": "Converted Web Sites Projects into Web Application projects, rewrite code of Classic ASP intoASP.NET(C# 2.0/3/3.5) based on business requirements. Created documentations for users anddevelopers."}
{"text": "Used LINQ for querying capabilities in .Net. "}
{"text": "Involved in implementing AJAX and SOA application. "}
{"text": "Implemented the application using MVC 3 Architecture. "}
{"text": "Responsible for developing WCF Service Libraries to exchange data between Desktop and Central Application and implement business logic. "}
{"text": "Used Razor syntax in creating Asp.Net MVC application by reducing the coding aspect. "}
{"text": "Implemented Ajax features of JavaScript to have the specific content loaded as per user needs. "}
{"text": "Involved in writing queries using LINQ. "}
{"text": "Used Octopus for deployment of code and database."}
{"text": "Used SOAP over HTTP5 to Implement Web Services and Consumed and published XML web services in the application."}
{"text": "Worked with their server team as well and maintained their DNS server, network authentication, network resources, email accounts and all aspects of server software "}
{"text": "Used Agile Scrum methodologies throughout the project. "}
{"text": "Implemented Web Services to integrate the client systems using WCF. "}
{"text": "Setup identity and access management in azure cloud. "}
{"text": "Create role based access the azure cloud."}
{"text": "Worked on MongoDB database concepts such as locking, transactions, indexes, replicationand schema design."}
{"text": "Involved in System testing, N Unit Testing and Integration testing in development environment and ensuring application is according to specifications. "}
{"text": "Development of enterprise reports by pulling data from various sources and presenting in SQL reporting services (SSRS) "}
{"text": "Coding the presentation layer using WPF and silverlight and service layer using Windows Communication foundation technology."}
{"text": "Environment:Frame Work 3.5, ASP.NET 3.5, Classic ASP.Net, C# (3.5/3.0), MVC, Agile scrum, Angular JS,Entity Framework, Web Services, LINQ, Octopus, WCF, WPF, AJAX, ADO.NET (3.5/3.0), Azure, HTTP, DNS, SQL Server 2008, Silverlight, Mongo DB, XML, CCS3, XSL/XSLT, HTML5, JAVA SCRIPT."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Role:.NET Developer"}
{"text": "Client:Zen Info Tech Solutions, HYD"}
{"text": "Duration: November 2010 to Mach 2012"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Analysis of the specifications provided by the clients. "}
{"text": "Successfully organized initial set of requirements into master list of Use Cases."}
{"text": "We use to follow Agile Methodology to plan and schedule releases."}
{"text": "Extensive experience in developing .Net frameworkapplications usingC#, ASP.NET, ADO.NET, VB.Net, ASP.Net, MVC, Web services, WSDL, WCF, Web forms, Win forms and AJAX."}
{"text": "Worked in developing Interfaces, Coding and debugging using ASP.NET and C#."}
{"text": "Feasibility study of new developments and requirements. "}
{"text": "Involved in requirement study and tool development"}
{"text": "Involved in requirement gathering, functional and technical specification."}
{"text": " Implemented the module to print the clearance and regular tickets using the following skill sets - C#, .Net, MVC3, Entity Framework, Enterprise Library, SQL and LINQ."}
{"text": "Used N-tier architecture for presentation layer, Business and Data Access Layers using C#. "}
{"text": "Developed web forms using ASP.NET server controls and validated client side using Java Script. "}
{"text": "Used ADO.NET objects such as Data Adapter, Data Reader and Dataset for consistent data access. "}
{"text": "Writing Database routines, stored procedures and fixing up standard specifications. "}
{"text": "Setup the Development, Test, Production environment in Cloud-Microsoft Azure."}
{"text": "Creating reports using the Crystal Report for the report needed by Middle Office, Back Office users. "}
{"text": "Identified researched, investigated, analyzed, defined and documented business processes. "}
{"text": "Involved in enhancing the business layer to provide more interfaces and functions needed for the system. "}
{"text": "Used various tools for testing the developed code and Performed several testing to fix the bugs and ensure the application error-free."}
{"text": "Configured TFS 2010 Environment along with Share point Services, Reporting Services."}
{"text": "Used a hybrid of waterfall and incremental model as the SDLC. "}
{"text": ""}
{"text": "Environment: .NET Framework 3.0, ASP.NET, Web Services, SOAP Messages, C#. NET, MVC 3, Visual Studio .NET 2010, JavaScript, IIS 6.0, HTML, Azure, Crystal Reports, SQL Server 2008, Share point, TFS."}
{"text": ""}
{"text": ""}
{"text": "Role: Junior.Net Developer"}
{"text": "Client: 3Edge Software Solutions"}
{"text": "Duration: August 2008 to October 2010"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Analyzing the specifications provided by the clients. "}
{"text": "Involved in requirement gathering, functional and technical specification. "}
{"text": "Developed UI/Components/Classes/Methods/Functions for the application and also Functionalities such as Data retrieval using disconnected record sets, using ADO.NET / ASP.NET / Windows Forms / Web Forms / Server controls."}
{"text": "Used N-tier architecture for presentation layer, Business and Data Access Layers using C#. "}
{"text": "Coding and debugging using ASP.NET and C#. "}
{"text": "Maintained Windows application with Visual Studio 2008 with VB.NET."}
{"text": "Created business Model in VB.NET to maintain connectivity with SQL Server databases."}
{"text": "Developed the web forms using ASP.NET Server controls and Performed validation on the client side using JavaScript and Validation Controls. "}
{"text": "For consistent data access used ADO.NET objects such as Data Reader and Data Set. "}
{"text": "XML services, Database Designing, Reports. "}
{"text": "Writing Database stored procedures, views etc."}
{"text": "Used Stored Procedures, Database routines for fixing up the standard Specifications. "}
{"text": "Implemented Unit Testing, Integration Testing and System Testing using NUNIT."}
{"text": "Identified researched, investigated, analyzed, defined and documented business processes. "}
{"text": "Involved in enhancing the business layer to provide more interfaces and functions needed for the system. "}
{"text": "Used a hybrid of Waterfall and Incremental model as the Software Development Life Cycle. "}
{"text": ""}
{"text": "Environment:Visual Studio 2005 and 2008, C#, ASP.NET, ADO.NET, .NET Framework 3.0, HTML, DHTML, CSS, Web Forms, JavaScript, Microsoft, XML, Web Services, IIS, SQL Server 2005, N-Unit, VSS, Crystal Reports 9."}
{"text": ""}
{"text": "Education:"}
{"text": ""}
{"text": "Bachelors in Technology - Bharat Institute of Engineering and Technology, India."}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": ""}
{"text": ""}