{"text": "Name: daisy daisy"}
{"text": "E-Mail: daisy.daisy@gmail.com"}
{"text": "Address: Xi’an, China"}
{"text": "Github: https://github.com/daisy"}
{"text": "LinkedIn: https://linkedin.com/daisy"}
{"text": "Phone No. 106338026457"}
{"text": ""}
{"text": "Summary:"}
{"text": "Network Engineer with 7+ years of expertise in Designing, Implementing and troubleshooting various Network Technologies. "}
{"text": "Experience in design, installation, configuration, administration and troubleshooting of LAN/WAN infrastructure and security using Cisco routers/Switches/ Cisco PIX, Checkpoint Firewall. "}
{"text": " Experience on LAN, WAN, Routing and Switching, server and storage systems, capacity planning, administration, monitoring, troubleshooting, cluster building, back-up and restore planning, operation and maintenance and project management. "}
{"text": " Extensive knowledge of network protocols (EIGRP, OSPF, BGP, RIP, VLAN, TCP/IP, etc.) "}
{"text": " Experienced in installation, configuration, design and ongoing maintenance of Cisco router and switches. "}
{"text": " Comprehensive understanding of networking concepts pertaining to LAN and WAN, Information security, IT communication and maintenance in multi-platform environments."}
{"text": "Experience in Network Intrusion detection/Intrusion Prevention System and Firewalls."}
{"text": "Extensive knowledge of network Switches like Avaya.\n Experience in Implementing & managing Symantec Data Loss Prevention. "}
{"text": "Experience in implementing application security solutions "}
{"text": "Experience with wireless technology 802.11x, configuration of wireless access points, wireless controllers and Cisco prime"}
{"text": "Adjusts to new systems and environment rapidly, takes responsibility for obligations, meeting administration aptitudes, Good hard working attitudes, Group and individual based critical thinking and basic leadership capacities."}
{"text": ""}
{"text": "Technical Skill:"}
{"text": ""}
{"text": "Routers: Cisco 2811, Cisco 6509-E (Multi-layer Switch), Juniper MX960, Cisco7200, Cisco3800, Cisco 3640, and Cisco 3745. Cisco Nexus 2k 3K,5k,6k,7k,9k"}
{"text": "Switches: Cisco Multi-layer Switch 6500, Avaya, Catalyst 4500, Catalyst3750, Catalyst2900 and Catalyst 3500XL. "}
{"text": "Routed Technology: IPv4, Sub Netting, VLSM, IPv6, Multicast"}
{"text": "Routing Technologies: RIPv1, RIPv2, IGRP, EIGRP, OSPF, BGP"}
{"text": "WAN Switching Technologies: HDLC, FRAME-REALY, PPP, Multi-link PPP."}
{"text": "LAN Switching Technologies:Ethernet, STP, VLAN, Ether channel, VTP, MLS."}
{"text": "IP Services: Redundant Service HSRP, VRRP, GLBP."}
{"text": "Hardware Platform: Cisco Routers, Ethernet Switches, F5 LTM, GTM "}
{"text": "Network Monitoring Tools: Wire shark, Packet Tracer, GNS."}
{"text": "Operating System: Windows xp, Windows 7, Cisco ios"}
{"text": "Documentation: MS-Office, MS- Visio"}
{"text": ""}
{"text": "Certification:"}
{"text": "Cisco certified network associate in Routing Switching (CCNA)"}
{"text": ""}
{"text": ""}
{"text": "Professional experience:"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "One Cloud, San Jose, CA \t\t\t\t\t\tFeb 15 - Present"}
{"text": "Network Engineer"}
{"text": "Responsibilities:"}
{"text": "Involved in Configuring, upgrading and verifying the NX-OS operation system."}
{"text": "Involved with converting 6500 to Cisco Nexus in the data centre environment."}
{"text": "Design and configuring of OSPF, BGP on Juniper Routers (MX960, MX480) ."}
{"text": "Worked with Nexus 7010, 5020, 2148, 2248 devices"}
{"text": "ConfiguredF5 LTM, GTM series like 6400, 6800, 8800 for the corporate applications and their availability"}
{"text": "Worked on updating pools, members and nodes using the GUI interface for the local traffic managers"}
{"text": "Configuring Virtual Chassis for Juniper switches EX-4200"}
{"text": "Configuration of Cisco 6500, 4500 Catalyst switches for network access."}
{"text": "Configured Nexus 7010 including NX-OS Virtual Port Channels, Nexus port profiles, Nexus Version 4.2 and 5.0, Nexus VPC peer links."}
{"text": "Worked with Network Switches like Avaya."}
{"text": "Worked on FTP, HTTP, DNS, DHCP servers in windows server-client environment with resource allocation to desired Virtual LANs of network."}
{"text": "Configured OSPF, BGP, DHCP Profile, HSRP, IPV6, Bundle Ethernet implementation on ASR 9K redundant pair."}
{"text": "Configured CIDR, PPP, MPLS and OSPF routing"}
{"text": "Working with Network Design and implementation teams on various projects"}
{"text": "Deploying and decommissioning of Cisco Routers, Cisco switches and their respective software upgrades"}
{"text": "Implemented DHCP, DNS, IPAM configuration on the servers to allocate, resolute the IP addresses from Subnet."}
{"text": "Monitored Network infrastructure using SNMP tools"}
{"text": ""}
{"text": ""}
{"text": "Mercy Health, St. Louis, MO \t\t\t\tNov 2014 - Jan 2015"}
{"text": "Network Engineer"}
{"text": "Responsibilities:"}
{"text": "Redesigned BGP Multi-homed site for redundancy."}
{"text": "Implementation and verification of GLBP protocol for default Gateway Redundancy."}
{"text": "Responsible for implementing and monitoring traffic patterns using F5 BIG IP LTM load balancers"}
{"text": "Experience in Wireless LAN (IEEE 802.11) and deployment of light weight access point."}
{"text": "Implemented Network Security solutions using Cisco VPN Concentrators and Cisco ACS sever."}
{"text": "Responsible for configuration of Checkpoint firewalls"}
{"text": "Configured Access List (Standard, Extended and Named) to allow users all over the company to access different applications and blocking others"}
{"text": "Configuring and troubleshooting VLANS and Inter VLAN routing for improving LAN performance. Sub netting networks and troubleshooting DHCP and DNS issue"}
{"text": "Configured network access servers for AAA Security"}
{"text": "Configuration of Nexus 7000 and Nexus 5000 switches"}
{"text": "Troubleshoot traffic passing managed firewalls via logs and packet captures"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "ING Vysya Bank, India \t\t\t\tSep 2011 - Oct 2014"}
{"text": "Network Administrator"}
{"text": "Responsibilities:"}
{"text": "Design, manage and troubleshoot OSPF, EIGRP and BGP"}
{"text": "Installation and Configuration of Cisco Switches and Nortel Switches"}
{"text": "Converted LAN from one flat scope of 600 nodes to a multi-VLAN network, segregating traffic into different classifications using access control lists to limit the traffic access to other VLANs"}
{"text": "Implemented VLANs with Spanning tree Cisco IOS Architecture for Cisco routers and switches"}
{"text": "Managing complex network implementations, including Cisco PIX firewall and Cisco Intrusion Detection System installation, Cisco VPN and Layer 3 implementations."}
{"text": "Installation and Configuration of Cisco firewalls and VPN Concentrators."}
{"text": "Monitor, improve, and support all aspects of network connectivity"}
{"text": "Support and Administration of Windows Systems."}
{"text": "Maintenance of general networking objectives of system/network operations."}
{"text": "Coordinating with vendors in ordering new products."}
{"text": ""}
{"text": "Ness Technologies, India\t\t\t\t\t July 2008 - Sep2011"}
{"text": "Jr. Network Engineer/Desktop Support"}
{"text": "Responsibilities:"}
{"text": "Setup and configuration for new workstations using ghost imaging software"}
{"text": "Configuring various printers using TCP/IP"}
{"text": "Monitored network performance and conferred network users how to solve existing system problems"}
{"text": "Solved most of the computers problems (hardware and software)"}
{"text": "Dealt with third-party vendors for parts and service orders on all equipment including fax machines, printers, PC's, and phone lines"}
{"text": "Perform maintenance tasks on systems and printers such as changing cartridges and check for computer problems"}
{"text": "Troubleshoot network, Internet and email problems for users"}
{"text": "Troubleshoot hardware problems with network cards, video cards, sound cards, motherboards, modems etc.,"}
{"text": "Provided comprehensive desktop and network support, resolving technical issues for over 50 end-users"}
{"text": "Assisted with installation, maintenance and troubleshooting of network support equipment"}
{"text": ""}
{"text": ""}
{"text": "Education:"}
{"text": ""}
{"text": "Bachelor in computer Application from AISECT College undertaken by Dr. C.V Raman University. (INDIA)"}
{"text": ""}
{"text": ""}