{"text": "Name: edna edna"}
{"text": "E-Mail: edna.edna@gmail.com"}
{"text": "Address: Santiago, Chile"}
{"text": "Github: https://github.com/edna"}
{"text": "LinkedIn: https://linkedin.com/edna"}
{"text": "Phone No. 939738993747"}
{"text": "Dynamic Business Analyst / Project Manager with over 7+ years of professional experience in Software Development Lifecycle (SDLC) and business reengineering process, offering extensive experience in healthcare domain. Areas of expertise include HIPAA compliance ANSI X12 4010 to 5010 and ICD 9 to ICD 10, EDI transactions and Claims Adjudication process. Experience with FACETS   configuration, coordination of benefits (COB), Medicare and Medicaid programs; strong interpersonal communication, writing, presentation and collaboration skills."}
{"text": ""}
{"text": "Proven track record of delivering cost-effective, high performance technology solutions to meet the constantly changing business needs."}
{"text": "Demonstrated experience in gathering requirements and developing detailed functional specifications through JAD sessions, interviews, observation, and on site meetings with SME, business users &development teams."}
{"text": "Knowledge of ICD-9, 10, CPT coding, EMR, HIPPA, JCAHO, PQRS and Meaningful Use, medical terminologies, and medical insurance activities."}
{"text": "Experience in conceptualizing Private and Public Exchanges for CIO group in line with PPACA act"}
{"text": "Extensive experience with HIPAA compliance, particularly with the migration of ANSI X12 4010 to 5010 and ICD 9-CM to ICD 10-CM/PCS using GEM. Extensive experience in ANSI X12 EDI transactions (270/271, 834, 835, 837, 276/277), NCPDP, NDC and DRG codes."}
{"text": "FACETS version upgrade implementation project and worked extensively on 837i (Institutional Claim), 837p (Professional Claims) and 834 (Enrollments)."}
{"text": "Experience in Software Development Life Cycle (Agile, Waterfall)."}
{"text": "Knowledge on medical necessities, software validation and healthcare compliance auditing."}
{"text": "Experience with various modules like membership management, premium billing, enrollment, claims processing & adjudication, benefits administration within Healthcare industry"}
{"text": "Experience in development methodologies like RUP, SDLC, AGILE, SCRUM and Waterfall"}
{"text": "Tested the Professional, Institutional Claims processing and adjudication and validate data with facets."}
{"text": "Hands on experience in customization and configuration of FACETS, Medicare (part A, B, C, D) and Medicaid programs. Good knowledge on different claim processing modules within healthcare domain (Membership, billing, enrollment, claims, capitation, providers)."}
{"text": "Thorough knowledge of HIX, PPACA and HL7."}
{"text": "Strong knowledge of HL7 Standards, HIX, EHR - Electronic Health Records, EMR - Electronic Medical Records, CMS regulations, Health Care Reform, EMTALA, PPO, POS and HMO. Strong interpersonal skills in listening, coaching, mentoring, negotiating, mediation and conflict resolution; excellent analytical, writing and presentation skills."}
{"text": "Excellent working knowledge of UML, RDBMS, Oracle, SQL, and PL/SQL; proficient in MS SQL administration, Enterprise Manager, data analysis and reporting. Experience with data analysis, data mapping and dimensional modeling."}
{"text": "Methodologies:\t\t\tSDLC, RUP, Agile"}
{"text": "Project Management:\t\tMicrosoft Project and Microsoft Office"}
{"text": "Modeling Tools:\t\t\tRational Rose, Microsoft Visio"}
{"text": "Change Management Tools:\tRational Requisite Pro, Clear Quest"}
{"text": "Version Control Systems:\t\tRational Clear Case"}
{"text": "Testing Tools: \t\t\tRational Enterprise Suite, Test Director, Win Runner, Load Runner"}
{"text": "Databases:\t\t\tOracle, MS SQL Server, MS-Access"}
{"text": "Operating Systems:\t\tWindows, Familiar with UNIX and LINUX"}
{"text": "RDBMS and Databases:\t\tSQL Server, Sybase Accelerator, and Oracle"}
{"text": "Reporting Tools:\t\t\tBusiness Object, IBM Cognos, and Crystal Report"}
{"text": ""}
{"text": "Client: Celtic Healthcare, Inc. Pennsylvania, PA,\tMay-2013-Till Now \t\t\t\nPosition: Business Analyst / Project Manager\t\t\t\t\nThis project involved development of schemas as well as customization of User interface in Java Language for HIPAA ANSI x12 transactions 837,835, 270.It also involved development of migration from Diamond software to Facets 4.0 including configurations, claims auto adjudication scope and definitions, financial transactions ID cards, Membership, and Enrollment. EDI 835, 837I, P, 270, 271 and proprietary conversions utilizing Facets extensions and development of new scripts and extensions to meet proprietary origination formats and reformat them into HIPAA standardized formats."}
{"text": "This project followed Agile Scrum methodology                                          \nResponsibilities:"}
{"text": "Responsible for defining the scope and implementing business rules of the project, gathering business requirements and documentation."}
{"text": "Responsible for writing Functional Requirement Specifications (FRS) and User Requirement Specification (URS)."}
{"text": "Provided support to CMS/ Federal and State stakeholders on objectives relative to PPACA -HIX by performing the following duties in an agile (scrum) SDLC environment."}
{"text": "The goal of the project was to create, EDI transaction data maps with its clients and business partners. The outcome was transaction maps were created. "}
{"text": "Experience with TriZetto Facets Application Groups: Claims Processing, Guided Benefit Configuration, Medical Plan, Provider, Subscriber/Member, Utilization Management."}
{"text": "Used Trizetto Product NetworX Pricer and the terms used in the Pricer. "}
{"text": "Wrote online training manual of EDI transaction maps."}
{"text": "Provided hands on agile project management approach & planning, apply strategy and scrum framework in various projects/phases, set team's objectives and goals."}
{"text": "Created reports using Microsoft SQL Server 2005 Reporting Services and QNXT 3.4 tables"}
{"text": "Write SQL scripts for adding, changing or deleting various benefit or contract data to or from QNXT that would take several man hours to complete via the front end software."}
{"text": "Analyzed Business Requirements and segregated them into high level and low level Use Cases, Activity Diagrams / State Chart Diagrams using Rational Rose according to UML methodology thus defining the Data Process Models."}
{"text": "Created detailed Use cases, activity diagrams and flowcharts based on requirements gathering."}
{"text": "Involved in configuration of Facets Subscriber/Member Application group"}
{"text": "Used Agile Methodology in the process of the project management based on SDLC"}
{"text": "Analyzed the member/eligibility information on claim to that in Facets."}
{"text": "Created test data for testing in Facets development client."}
{"text": "Worked on implementing software development projects using methodologies such as Waterfall, Rational Unified Process, and Agile/Scrum"}
{"text": "Resolved issues like member duplicated in file, dealing with dependent transaction if subscriber is not found, failures in submissions in QNXT."}
{"text": "Analyzed and studied the technical, structural and data content changes for EDI transaction sets 834 (Enrollment and Maintainace), 837 (Professional, Institutional and Dental Claims) and 835 (Claim Payment/Advice)."}
{"text": "My role was to assist the Project Management Office (PMO) in the development of an Enterprise-wide, web-based guidelines for Rational Unified Process. "}
{"text": "Followed the Rational Unified Process (RUP), Agile methodology and Extreme Programming concepts for project development. Analyzed and incorporated User Stories in different release plans for the sprints in Scrum process."}
{"text": "Performed GAP analysis to identify AS-IS a process EDI transaction set 834,837 and 835 of 4010A and TO-BE processes of 5010 standard and based on that developed Business Requirement Documents. "}
{"text": "Worked on Facets to help payers efficiently execute core administrative functions, including claims processing, premium billing and customer service."}
{"text": "Understand the As Is system and develop the To Be system concept and also prepare the System Process Maps."}
{"text": "Identified and documented data model processes and system deficiencies for the HIX eligibility & enrollment. "}
{"text": "Utilized corporation developed Agile SDLC methodology. Used Scrum Work Pro and Microsoft Office software to perform required job functions."}
{"text": "Worked on Healthcare system implementation including enterprise Electronic Medical Records (EMR) software."}
{"text": "HIPAA EDI transactions such as 835, 837 (P, D, I) 276, 277, 278."}
{"text": "Worked with NASCO teams to get current work flow for detailed business process."}
{"text": "Evaluated and analyzed  EDI transaction sets 276/277 (Claim Status Request/Response), 270/271 (Eligibility Inquiry/Response), 837 (Claim Transaction) and 278 (Healthcare Service Review Information)"}
{"text": "Organized local meeting to promote and introduce new environmental products"}
{"text": "Wrote Test Cases and performed User Acceptance Testing (UAT), documented the in detail defects using the Defect Tracking report."}
{"text": "Performed smoke test and Functional testing on the Sprints as and when they were delivered to the QA team"}
{"text": "Used Test Case distribution and development reports to track the progress of test case planning, implementation and execution results."}
{"text": "Maintained proper communication with the developers ensuring that the modifications and requirements were addressed and also monitored these revisions."}
{"text": "Involved in compatibility testing with other software programs, hardware, Operating systems and network environments."}
{"text": ""}
{"text": "Client: Cardinal Health, Dublin, OH\t\t Oct-2011-Apr-2013"}
{"text": "Position: Business  Analyst / Project Manager\t\t\t\t\t\nMy role as a Business Analyst comprised developing fully automated, real-time claims processing system for complete, on-line mediation of medical, dental, vision, and disability claims following HIPAA guidelines. The system allowed the efficient and timely management of all relevant data- clinical, financial, and administrative throughout the organization enabling the sharing of information between subsystems."}
{"text": "Responsibilities:"}
{"text": "Analyzed Business Requirements, developing tracking and enhancing them into functional requirements using Rational Requisite Pro as a requirements tool."}
{"text": "User Acceptance Testing (UAT) – Carried out UAT activities associated with each project and presented the results to the Business Stakeholders. "}
{"text": "Worked on HIPAA transaction codes specifically on EDI 837, 835 and 834 to incorporate enhancements to existing efforts on capturing and mapping, member enrollment and eligibility and contribution data respectively received at the Plan level from the State.  "}
{"text": "Writing Complex SQL queries and optimizing SQL Queries."}
{"text": "Involved in mentoring specific projects in application of the new SDLC based on the Agile Unified Process, especially from the project management, requirements and architecture perspectives."}
{"text": "Documented the meeting minutes from the JAD’s and stored the artifacts in the appropriate place holders in PDS and SharePoint for both the teams to review."}
{"text": "Well versed with different SDLC methodologies like Agile – Scrum, XP, RUP and Waterfall. "}
{"text": "Worked in GAP analysis to understand the difference between both the billing systems and documented the GAPs in GAP analysis spreadsheet."}
{"text": "Used UML and RUP best practice methodologies along with supporting toolset including Mercury Test Director, Caliber RM and StarTeam for overall development framework"}
{"text": "Documented the business requirements into functional requirements document."}
{"text": "Gathered the requirements and transformed them into high-level Process-Flow Diagram using PowerPoint."}
{"text": "Created a task plan for the team identifying the key deliverables and the respective deadlines. "}
{"text": "Created the ETL requirements to load the data into TeraData."}
{"text": "Analyzed the business requirement as per the HIPAA rules and regulations. "}
{"text": "Provided coaching on Agile values and practice to other teams within the company"}
{"text": "Involved in preparing Test Plans based on User Requirements Document (URD) and prepared the Test Cases using Test Director/HP Quality Center."}
{"text": "Created mapping/crosswalk documents for mapping data flow between systems."}
{"text": ""}
{"text": "Client: State of New Mexico, Department of Health,Santa Fe,            Feb-2010-Sep-2011\nPosition: Business  Analyst / Project Manager\t\t\t\t\t\t\nThis is a comprehensive solution for the Family, Infant and Toddler (FIT) program of DOH at New Mexico. The system allows enrollment of children, their eligibility check for insurance and Medicaid, recording delivery of services, and processing of claims with the Insurance/Medicaid. It also allows the service provider agencies to use the system for tracking the settlement of the invoice generated for delivered services. The solution was developed using Microsoft   .NET technology with SQL server as a data store. I did the business analysis with the client and managed the deliveries with off-shore team\n"}
{"text": "Responsibilities:"}
{"text": "Conducted requirements analysis and facilitated Joint Application Development (JAD) sessions for Rapid Application"}
{"text": "Development (RAD) to identify business rules and requirements elicitation "}
{"text": "Followed a structured approach to organize requirements into logical groupings of essential business processes, business rules, information needs, and ensured that none of the critical requirements go unnoticed  "}
{"text": "Maintained the chart of acccounts mapping values for converting the legacy system"}
{"text": "Developed tables, Views, Stored Procedures and Triggers using SQL Scripting"}
{"text": "Documenting user stories and test cases/ test scripts to support Agile Methodology of development."}
{"text": "Documented the user requirements in the Business Requirements and Functional requirements documents  "}
{"text": "Researched and documented As-Is processes, defined and documented To-Be processes "}
{"text": "Linked business processes to organizational objectives, identifying opportunities for business process improvement "}
{"text": "Utilized corporation developed Agile SDLC methodology. Used ScrumWork Pro and Microsoft Office software to perform required job functions."}
{"text": "Assisted project management team in high level feasibility studies and risk mitigation "}
{"text": "Experience with object oriented analysis using Agile modeling."}
{"text": "Used the Agile methodology to build the different phases of Software development life cycle.(SDLC) "}
{"text": "Acted as a liaison between business units to coordinate interdependencies and resolved issues"}
{"text": "Active member of CCB and regulated the gaps in the requirements "}
{"text": "Managed Traceability matrix to trace use cases, business and functional requirements"}
{"text": "Conducted iterations and communicated results and milestone achievements to the stakeholders while keeping the developers closely updated on all documented refinements  "}
{"text": "Developed project delivery schedule, managed projects and identified resources to successful completion "}
{"text": ""}
{"text": "Horizon BCBS, Newark, NJ\t      \t\t                           Jun-2008-Dec-2009          "}
{"text": "Business Analyst/ Coordinator"}
{"text": "Horizon BCBS is the   leading Healthcare provider of the region. The web based application is related to bending the cost of care curve while improving the health and wellbeing of the people. This allows its clients to meet the requirements of Affordable Care Act mandates, to implement member engagement and retention strategies, customized benefit packages  as per to the needs of groups and individuals. My role involved in creating a test plan and test strategy for online enrollment application including: market data analysis, workflow, file management, image management, Web page layout and security. These were created based on user requirements and the types of content"}
{"text": ""}
{"text": "Responsibilities:  "}
{"text": "Involved in framing out Business Transaction rules and related Documentation, creating Test Plans based on Functionality and Business rules using structured SDLC approach. "}
{"text": "Conducted Surveys and Brainstorming JAD sessions with SMEs for requirement gathering and prepared User Requirement Specifications (URS) documents. "}
{"text": "Analyze business rules to develop wireframes for pages in HTML to assist in UI design."}
{"text": "Performed Gap Analysis of the As-Is and To-Be process within the organization to analyze and fill the existing gaps in the business processes. "}
{"text": "Conducted  Onsite-Offshore Status Meetings on regular basis  and co-ordinate to perform BRD related activities"}
{"text": "Documented the Use Cases and Activity diagrams using MS Visio to understand the requirements and communicate them to the development team. "}
{"text": "Implemented an integrated RUP solution with complete line of traceability for all the artifacts of web development projects. "}
{"text": "Involved in the creation and maintenance of the Workflow plans and artifacts."}
{"text": "Designed workflows for the new corporate tool (COTS product) based on the capability project for the initial release and to see that the minimum business requirements were met"}
{"text": "Elicited business requirements and business needs as part of an Agile Scrum team"}
{"text": "Performed requirements analysis for a large-scale, highly-available, COTS-based infrastructure Tracking system"}
{"text": "Performed Data Analysis and design development using SAS/ Stat procedures and MS Excel. "}
{"text": "Prepared Business Process Models that includes modeling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models. "}
{"text": "Worked with the exchanges for market data redistribution sign off and approvals for clients setup on client’s proprietary OMS"}
{"text": "Involved in reviewing complex SQL queries, views, functions and stored procedures and spotting issues before/during code migration. "}
{"text": "Worked with the UI team to create the User Interface screenshots to be presented to the Business. "}
{"text": "Reviewed, analyzed and modeled Test plans and Test procedures based on RUP methodology. "}
{"text": "Performed Gap analysis for the modules in production, conducted feasibility study and performed impact analysis for proposed enhancements. "}
{"text": "Verified the functional aspect as per the Business Process and validated the interfaces with the other systems and data conversion from the legacy system. "}
{"text": "Involved in walkthroughs and meetings with development team to discuss related issues. "}
{"text": "Used Rational Rose to visually determine the proper structure, key elements and optimal design for the database and to aid efficient creation of tables and storing procedures. "}
{"text": "Wrote clear, concise and detailed system requirements specification (SRS) documents and user documentation in accordance to guidelines and standards of a level where developers can interpret, design and develop the application with minimum guidance."}
{"text": "Performed User Acceptance Testing (UAT) to test the functionality of the application."}
{"text": "Coordinated with the development team in documenting End User Manual."}
{"text": ""}
{"text": ""}
{"text": "UNICARE, Minneapolis, MN\t\tJan-2007-May-2008               \t\t\t "}
{"text": "Business Analyst"}
{"text": "Unicare is a national organization dedicated to the delivery of quality health care plans and products to its customers. This project aimed at developing software for auto-adjudication of claims process to improve the efficiency in processing claims. The system primarily aimed at handling Medicare / Medicaid insurance claims and process exceptions."}
{"text": "Responsibilities:"}
{"text": "Analyzed current business process flow by understanding preset business rules and conditions."}
{"text": "Conducted formal interviews, Live Meetings and JAD sessions with business users Subject Matter Experts (SME’s)"}
{"text": "Designed and developed Use Cases, Activity Diagrams and Sequence Diagrams using UML."}
{"text": "Involved in Backend Testing to verify data integrity by using SQL."}
{"text": "Documented, organized and tracked the requirements using Rational Requisite Pro."}
{"text": "Defined project milestones, schedules, and monitored progress using MS-Project and updated plans as required."}
{"text": "Analyzed and tested Data Interface needs with external systems."}
{"text": "Analyzed, manipulated and updated Database using SQL."}
{"text": "Gap Analysis: Analyzed the client’s applications programs to determine the impact of the HIPAA rule on EDI Transaction Set and Code List implementation and defined the changes to bring the affected systems into HIPAA compliance."}
{"text": "Assisted with user testing of systems and maintained quality procedures and ensured appropriate documentation is in place."}
{"text": "Maintained Requirement Traceability Matrix (RTM) and Utilized Clear Quest for change requests and defect tracking."}
{"text": "Claim validation and Pend/Denied Claims Analysis for the Health plans Medicaid programs."}
{"text": "Worked closely with the technical team to look up for the best possible solution on requirements by keeping business needs and technical constraints in mind."}
{"text": "Updating, transferring and sharing Files using FTP between Windows and UNIX machines."}