{"text": "Name: evelyn evelyn"}
{"text": "E-Mail: evelyn.evelyn@gmail.com"}
{"text": "Address: Riyadh, Saudi Arabia"}
{"text": "Github: https://github.com/evelyn"}
{"text": "LinkedIn: https://linkedin.com/evelyn"}
{"text": "Phone No. 468356454129"}
{"text": ""}
{"text": "________________________________________________________________________"}
{"text": ""}
{"text": "Credential Certifications:"}
{"text": "Salesforce.com Certified Force.com Developer (DEV 401 CERTIFIED).  "}
{"text": "Salesforce.com Certified Salesforce Administrator (ADM 201 CERTIFIED)."}
{"text": "_________________________________________________________________________________."}
{"text": "Carrier Objectives: "}
{"text": ""}
{"text": "To obtain challenging and rewarding Salesforce position with growth and learning opportunities in supportive, challenging work environment that would take advantage of my job experience.Always seeking opportunity that will allow me to prove myself in various aspects of critical conditions and adding values to the prosperity and development of the company."}
{"text": ""}
{"text": "Summary of Experience:"}
{"text": ""}
{"text": "Strong 8 experience in  Salesforce Administration, Business analysis and testing. Salesforce CRM data model of Sales, Service and Marketing cloud and customization of Standard Objects Leads, Accounts, Contacts, Opportunities, Opportunity Products, Campaigns, Campaign Members, Cases, Solutions, Knowledge, and Articles. "}
{"text": "Sounds knowledge with Salesforce relationships - Lookup, Master-Detail, Junction Objects, Fields, Dependent Fields, Formula Fields, Validation rules, Page Layouts, Search Layouts, Compact Layouts, Related Lists, Custom Links, Buttons, Tab and List views."}
{"text": "Expertise with Salesforce Administrative tasks of Creating Users, Profile, Permission Sets, setting up organization role hierarchy, security controls (Network IP filtering, Password policies), Remote Site Settings, Email Templates, Connected Apps, and Sites."}
{"text": "Expert in developing Functional Specifications for Business Process Refinement, Re-Engineering, Business Process Modeling, Business Intelligence and Automation. "}
{"text": "Good experience with Process Builder and consolidated all existing workflow rules into new process flows and created actions like updating child records, auto submission of approval process based on the criteria."}
{"text": "Extensively worked on SOAP and REST APIs Integration and design necessary data flow integration."}
{"text": "Strong experience with Sales cloud customization on Lead by defining the Lead process, Assignment Rules, Web-to-Lead & field mapping, enable team selling on Account Teams, Opportunities by configuring Price books and adding Price books for the products."}
{"text": "Good knowledge in configuring and executing Campaigns using ExactTarget by creating HTML Email templates, data sets in ExactTarget."}
{"text": "Extensive experience in developing APEX classes, Triggers, Visual force pages, Controllers, writing Workflows, Integration and Force.com API."}
{"text": "Experience working with Service cloud by implementing Email-to-Case, Web-to-Case, Assignment, Escalation, Auto-response rules on Case object, implementing Service Console and Live agent."}
{"text": ""}
{"text": "Good experience with tools like Force.com Explorer, Eclipse IDE (with Force.com plug-in), Data Loader, Workbench, SOAP UI for querying and accessing REST, SOAP web services."}
{"text": "Proficient with Salesforce communities configuration and setting up community users."}
{"text": "Generated HTML Email templates in ExactTarget and configured single sign on in ExactTarget."}
{"text": "Build custom report types, Tabular, Summary, Matrix and Joined reports, Analytic Snapshots and Dashboards for different business units and configured report/dashboard folder visibilities."}
{"text": "Experienced using salesforce lightening UI"}
{"text": "Hands-on experience in deploying components across Production and Sandbox instances using Force.com Migration tool, Changesets and Workbench. Good at implementing Salesforce best practices."}
{"text": "Worked on service cloud and closely with business team, functional analysts, QA and SFDC architect."}
{"text": ""}
{"text": "Technical Skills:"}
{"text": ""}
{"text": "Platform"}
{"text": ""}
{"text": "Salesforce\t: Salesforce CRM, Apex, Visual force, Triggers, Batch & Schedule classes, Sales Cloud, Service Cloud, Marketing Cloud, Data Loader, Custom Labels, Article Management, Visual Flows, Process Builder, SOQL, SOSL, HTML, JavaScript, CSS, jQuery"}
{"text": "Tools\t: Eclipse, Force.com IDE, Developer Console, Workbench, Data Loader, Demand Tool, Cast Iron Studio, JIRA."}
{"text": "Web Technologies\t: Java, J2EE, Servlet, Struts, JSP, spring, HTML5/4, CSS3/2, JavaScript, jQuery"}
{"text": "Database\t\t: Oracle 9i/10g/11g, Microsoft SQL Server 2008 R2, MS Access"}
{"text": "Integration Tools           :Informatica Power Center 9.x, MuleSoft, Dell Boomi"}
{"text": "Methodologies\t\t: Agile Scrum, and Waterfall"}
{"text": "Operating Systems\t: Linux, Mac, Unix, Microsoft Windows Platforms"}
{"text": ""}
{"text": ""}
{"text": "Professional Experience:"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Organization        :      UBER"}
{"text": "Address                :     Philadelphia, PA."}
{"text": "Designation\t  :     Salesforce Developer"}
{"text": "Period                   :      April -2016 to Till Date."}
{"text": ""}
{"text": "Uber is evolving the way the world moves. By seamlessly connecting riders to drivers through our apps, Uber make cities more accessible, opening up more possibilities for riders and more business for drivers. From our founding in 2009 to our launches in over 400+ cities today, Uber's rapidly expanding global presence continues to bring people and their cities closer."}
{"text": ""}
{"text": "Responsibilities:  "}
{"text": ""}
{"text": "Interacted with various business team members to gather the requirements and provided technical inputs for the user stories."}
{"text": "Proficiency in SFDC Administrative tasks like creating Profiles, Roles, Users, Page Layouts, Record Types, Email alerts, Reports, Dashboards and Tasksand Connected apps for Integration."}
{"text": "Created HTML, Text based Email Templates and Folders for different business groups."}
{"text": "Built Workflow rules, Approval process and created related actions Field update, Email alert, Creating a Task and outbound messaging. "}
{"text": "Experience on SFDC implementations covering Sales cloud and service cloud and  Chatter and AppExchange applications. "}
{"text": "Used Process Builder to migrate existing Workflow rules into the process builder and performed additions actions like Create child records, auto submission for approval process on field value changes."}
{"text": "The project was to enhance the existing application with new implementations and the purpose of the project was to validate whether the data entered into one application is automatically transferred into their another application. "}
{"text": "Performed deployments using sfdc Force.comAnt migration tool, Change Sets and Eclipse tools to migrate components across various instances. "}
{"text": "Responsible for setting up new instances of JIRA, data import, customization, and backup."}
{"text": "Developed analytics  Cloud data using SAQL via Wave Analytics to build own app to access and analyze Analytics cloud data. "}
{"text": "Mentored junior programmers in Oracle database design and development."}
{"text": "Developed Lightning apps with design systems using CSS and Parameters, App Builder and Lightning component features for the use of Desktop and Salesforce1 Mobile Platforms. "}
{"text": "Hand on experience in salesforce lightning feature and knowledge.And  Implemented wave Analytics to track overall business which increased 20% of entire sales"}
{"text": "Created data loading and query optimization strategies for large (1TB+) data sets in oracle and MS SQL databases and involved in Unit Testing, SIT and UAT integration activities"}
{"text": "Used Salesforce.one for managing navigation and built custom Visual Force components with J Query Mobile and AngularJS. "}
{"text": " Implemented CTI to serve both sales and service purposes for both inbound and outbound calls ."}
{"text": "Developed Triggers, Apex classes and visual force pages as per the needs of the application."}
{"text": "Worked on design of solutions and integration development code."}
{"text": "Also worked on newly introduced interface Lightning Experience."}
{"text": "Worked on customization of Sales cloud objects Accounts, Contacts, Opportunities, Price books, Products and configured Account Teams for team selling."}
{"text": "Created data migration document for import/export of data from data loaderCreated  and Developed Quote Documents using X-AUTHOR for Word, also developed Customized login screen for community user and functionality to redirect user from Salesforce to APTTUS CPQ Quote creation using APTTUS API's, APEX, Visual Force and Trigger"}
{"text": "Integrated Salesforce with web applications using SOAP WSDL service and unit tested using SOAP UI."}
{"text": " Developed efficient PL/SQL programs to access Oracle databases. Manage data retrieval for front-end applications."}
{"text": "Change Management (Testing, Training, Customer Betas, Internal and external communication). Service cloud  Console:"}
{"text": "Experience in Salesforce1 Mobile with out of box using Lightening."}
{"text": "Worked on service cloud  implementation using Cases, and implemented Email-to-Case, Escalation and assignment rules."}
{"text": "Experienced using salesforce lightening UI. Created Components and Apps in salesforce lightening and Salesforce1 Mobile Experience and Involved on creating Lightening Pages Inside lightening community Builder."}
{"text": "Business requirements document (BRD) details the business solution for a project including the documentation of customer needs and expectations."}
{"text": "Hand on experience in salesforce lightning feature and knowledge."}
{"text": "Test-driven development (TDD) is a software development process that relies on the repetition of a very short development cycle: "}
{"text": "Migrated bulk data from external data source to Salesforce using Data Loader bulk API."}
{"text": "Created many lightening Components and server-side controllers to meet the business requirements. Experienced in migrating the standard and custom objects in standard experience to lightening experience"}
{"text": "Expertise in Informatica Data Quality (IDQ) tool installation and Standardization, Address Validation and Deduplication"}
{"text": "Deployed components using Force.com Migration tool (prepared package.xml), Change Sets, Workbench and Eclipse to deploy across dev, QA and UAT Sandboxes and Production instances."}
{"text": ""}
{"text": "Environment: Salesforce.com CRM, Apex language, Visual force pages, Triggers, SOQL, SOSL, Sales Cloud, Service cloud, Web services, Custom Objects, Fields, Sharing rules, Profiles, Queues, Validation, Sites, Communities, Eclipse, Developer Console, Workbench, Force.com Migration tool (ant based), Data Loader, Reports, Dashboards, web services, Git."}
{"text": ""}
{"text": "\n"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Organization : Kaiser Permanete."}
{"text": "Location       : Oregon City, OR."}
{"text": "Nov-2014-March 2016"}
{"text": "Sfdc Developer."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Kaiser one of the leading firms in the US. salesforce.com as a platform to build custom workflow solutions that can automate critical internal business processes. They are in process of establishing Force.com center of excellence within the enterprise and implemented projects like Credit Review and Art Tracke."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "•  Perform detailed analysis of business and technical requirements and designed the solution by customizing variousstandard objects of Salesforce.com (SFDC) and other Platform based technologies like Visual Force, Force.com API, and Web Services."}
{"text": "•   Used Workbench in Salesforces.com."}
{"text": "•   Actively involved in design and development of custom CRM solution to service."}
{"text": "•   Architected the solution in SFDC and participated in coding apex classes, triggers, visual force pages and REST API's."}
{"text": "•   Designed and developed external customer portal on SFDC to serve borrowers."}
{"text": "•   Created custom service cloud application on top existing solution to improve the productivity of CRM."}
{"text": "•   Deployed new Live chat/CTI Platform for Connect & Save Telephony over IP service and other marketing promotion ."}
{"text": "•   Implemented SSO in SFDC, to utilize corporate windows authentication."}
{"text": "•   Extensively worked on SFDC UI using Visual Force Pages."}
{"text": "•   Extensively worked on integrating REST API using callouts framework in SFDC."}
{"text": "•   Extensively worked on SOQL and Apex Triggers to implement business logic."}
{"text": "•   Designed and developed workflows and Process Builders to automate the business processes."}
{"text": "•   Worked on Custom Setting and Test Case and Expertise in Service Cloud console with exposure to CTI adapters and Mobile Application Integrations  and  familiarity with Agile SCRUM mythology."}
{"text": "•   Experience in ETL processes utilizing informatica power center tools to design data conversions from a variety of relational, XML and flat file source systems to data warehouse/data marts"}
{"text": "•   Worked on CTI Integration and Used Steelbrick (CPQ) for Salesforce to configure, price and quote new deals, add-on sales and renewals."}
{"text": "•   Extensively used apex Data loader to synchronize the data between external systems and SFDC and  Experience with Test-driven Development (TDD)."}
{"text": "Administered, configured and managed Salesforce application user Profiles, Roles, Permission Sets, generating Security tokens, upgrade to managed app exchange packages."}
{"text": "Created custom pipeline report and other reports for different business users using tabular, summary and matrix reports and dashboards."}
{"text": "Written SOQL, SOSL queries in Apex triggers and controllers, used Salesforce workbench to generate queries."}
{"text": "  Developed apex custom and extension controller classes for actions defined in Visual force pages. "}
{"text": "Designed and developed Custom objects, Components, Visual force Pages to suit the needs of the application Deployed components across organizations (Production and Sandboxes) using Eclipse, Force.com Migration Tool, and Change Set."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Address                     :  Detroit, MI."}
{"text": "Organization\t       :   Wells Fargo."}
{"text": "Sfdc Developer\t\t\t\t\tMarch -2012 to Oct-2014."}
{"text": "Wells Fargo, which helps many of the small and medium-sized business people in growing up their business levels. The company advertises its customers in industries, such as financial services, Home, and healthcare, where reliable non-stop computing power is essential. TheFargo keeps track of all their pre-sales and post sales operation in Salesforce."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Performed roles of Salesforce Configuration and Administrator."}
{"text": "Created relationships using Lookup and Master-detail among custom and standard objects and created junction objects to establish many-to-many relationships among objects."}
{"text": "Created various Formula, Rollup Summary Fields, Record types, Page Layouts, Search Layouts, Related lists, List views, Custom tabs, apps, Custom Links, Custom Buttons and Actions on a record detail and edit pages."}
{"text": "Customized various Salesforce.com objects like Accounts, Contacts, Leads, Opportunities, Products, Price books, Campaigns, Campaign Members, Cases, and Solutions."}
{"text": "Customized Leads by creating a Lead process for various groups, assignment rules, web-to-lead and custom lead conversion."}
{"text": "Implemented Case Management Automation to track and solve customer issues by creating support process, record types, assignment and escalation rules. "}
{"text": "Configured Partner and Customer portal for the users in the organization for Partner selling."}
{"text": "Administered, configured and managed Salesforce application user Profiles, Roles, Permission Sets, generating Security tokens, upgrade to managed app exchange packages."}
{"text": "Created Workflow rules, Approval process on various objects to automate actions Email Alert, Field Update, Creating task, Outbound messaging and time-dependent actions."}
{"text": "Created custom pipeline report and other reports for different business users using tabular, summary and matrix reports and dashboards."}
{"text": "Written SOQL, SOSL queries in Apex triggers and controllers, used salesforce workbench to generate queries."}
{"text": "Developed apex custom and extension controller classes for actions defined in Visual force pages. "}
{"text": "Designed and developed Custom objects, Components, Visual force Pages to suit the needs of the application."}
{"text": "Deployed components across organizations (Production and Sandboxes) using Eclipse, Force.com Migration Tool, and Change Set."}
{"text": "Provided post-implementation support to assist end users in creating reports, dashboards and certain Administration tasks including creating and maintaining user profiles and privileges."}
{"text": "Responsible for driving end-user adoption by assisting in day-to-day Salesforce CRM support, including the managing releases and change control processes."}
{"text": "Participated in training sessions provided to the team. Also delivered training to new joiners in the team."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Address                     :  Hyderabad, India"}
{"text": "Organization\t:HSBC"}
{"text": "Designation\t  : Salesforce Admin "}
{"text": "Period\t\t: May-2011 to Feb-2012"}
{"text": ""}
{"text": "HSBC is the one which is a leading private invest firms under management. It is the type of consulting based approach for private equity investing with the various management teams. Building HSBC web services and Database map that constructs the complete Cloud Framework for facilitating the creation, updating, maintenance and querying of SFDC cloud-customer details records"}
{"text": ""}
{"text": "Responsibilities:  "}
{"text": "Worked as Salesforce Administrator and interacted with business for requirements and performed administrative tasks."}
{"text": "Achieved comprehensive analysis of business practices and guided on ways to boost up the processes. "}
{"text": "Created custom objects, fields, established relationships among objects using Lookup, Master-detail and created junction objects for many-to-many relationships."}
{"text": "Customized and configured Formula fields, Rollup Summary Fields, Record types, Page Layouts, Search Layouts, List views, Custom tabs for various objects."}
{"text": "Customized various Salesforce.com objects like Accounts, Contacts, Leads, Opportunities, Products, Price books, Campaigns, Campaign Members, Cases, and Solutions."}
{"text": "Worked on customization of Leads by creating a Lead process, assignment rules, web-to-lead, and lead conversion."}
{"text": "Implemented Case Management automation by enabling Web-to-Case, Email-to-Case, auto response, escalation rules and support process on the Case Object. "}
{"text": "Configured Partner and Customer portal for the users in the organization for Partner selling."}
{"text": "Designed, configured, managed Salesforce application user Profiles, Roles, Permission Sets, generating Security tokens, upgrade to managed app exchange packages."}
{"text": "Organized Email Templates and Mail Merge Templates and was committed to doing the mail merge for various standard and custom objects. "}
{"text": "Created Workflow rules, Approval process on various objects to automate actions Email Alert, Field Update, Creating task, Outbound messaging and time-dependent actions."}
{"text": "Configured Salesforce Outlook connector to sync contacts, events and tasks between Salesforce and Outlook. "}
{"text": "Created custom pipeline report and other reports for different business users using tabular, summary and matrix reports and dashboards."}
{"text": "Prepared SOQL, SOSL queries for data extraction, migration and update."}
{"text": "Written Apex custom and extension controller classes for actions defined in Visual force pages."}
{"text": "Written Apex classes, Visual force Pages for different use cases provided by the business."}
{"text": "Managed Salesforce sandbox and deployed components using Eclipse, Force.com Migration Tool, and Change Set."}
{"text": "Involved in production support to resolve issues from end users with user profiles, privileges, accessibility and data visibility."}
{"text": "Responsible for driving end-user adoption by assisting in day-to-day Salesforce CRM support, including the managing releases and change control processes."}
{"text": ""}
{"text": ""}
{"text": "Organization\t: ImageHealth Group."}
{"text": "Designation\t: Salesforce Admin"}
{"text": "Period\t\t: May-2009 to April 2011"}
{"text": ""}
{"text": "ImageHealth Group is one of the leading suppliers of innovative products addressing early stage Integrated Circuits and system design aimed at improving design efficiency for the world's leading semiconductor and consumer Health Group companies. "}
{"text": ""}
{"text": "Responsibilities:  "}
{"text": "Performed roles of Salesforce Configuration and Administrator."}
{"text": "Created relationships using Lookup and Master-detail among custom and standard objects and created junction objects to establish many-to-many relationships among objects."}
{"text": "Created various Formula, Rollup Summary Fields, Record types, Page Layouts, Search Layouts, Related lists, List views, Custom tabs, apps, Custom Links, Custom Buttons and Actions on a record detail and edit pages."}
{"text": "Customized various Salesforce.com objects like Accounts, Contacts, Leads, Opportunities, Products, Price books, Campaigns, Campaign Members, Cases, and Solutions."}
{"text": "Customized Leads by creating a Lead process for various groups, assignment rules, web-to-lead and custom lead conversion."}
{"text": "Implemented Case Management Automation to track and solve customer issues by creating support process, record types, assignment and escalation rules. "}
{"text": "Configured Partner and Customer portal for the users in the organization for Partner selling."}
{"text": "Administered, configured and managed Salesforce application user Profiles, Roles, Permission Sets, generating Security tokens, upgrade to managed app exchange packages."}
{"text": "Created Workflow rules, Approval process on various objects to automate actions Email Alert, Field Update, Creating task, outbound messaging and time-dependent actions."}
{"text": "Created custom pipeline report and other reports for different business users using tabular, summary and matrix reports and dashboards."}
{"text": "Written SOQL, SOSL queries in Apex triggers and controllers, used Salesforce workbench to generate queries."}
{"text": "Developed apex custom and extension controller classes for actions defined in Visual force pages. "}
{"text": "Designed and developed Custom objects, Components, Visual force Pages to suit the needs of the application."}
{"text": "Deployed components across organizations (Production and Sandboxes) using Eclipse, Force.com Migration Tool, and Change Set."}
{"text": "Provided post-implementation support to assist end users in creating reports, dashboards and certain Administration tasks including creating and maintaining user profiles and privileges."}
{"text": "Responsible for driving end-user adoption by assisting in day-to-day Salesforce CRM support, including the managing releases and change control processes."}
{"text": ""}
{"text": ""}
{"text": ""}