{"text": "Name: katherine katherine"}
{"text": "E-Mail: katherine.katherine@gmail.com"}
{"text": "Address: Kunming, China"}
{"text": "Github: https://github.com/katherine"}
{"text": "LinkedIn: https://linkedin.com/katherine"}
{"text": "Phone No. 407986723435"}
{"text": " "}
{"text": "Summary:"}
{"text": ""}
{"text": "Senior business analyst with 6+ years of industry wide experience in the domain of Insurance, Healthcare, Pharmacy, Life Sciences with solid understanding of Business Requirement elicitation techniques, Business Intelligence and experience in envisioning, representing and translating the product vision from the business sector to the software development."}
{"text": "Script developing and testing in Facets Client, Development and Production environments."}
{"text": "Experience supporting the design, implementation and maintenance of multiple, complex data warehouses including Texas Medicaid Vision 21 data warehouse, Texas Medicaid Encounters Data Warehouse, the Texas Medicaid Pharmacy Claims Data Mart, and the Connecticut Medicaid Decision Support System."}
{"text": "Experience working with team members for full-cycle projects, such as developers, to complete consulting projects on time, and deliver outstanding consulting services to salesforce.com clients."}
{"text": "Experience with various Facets modules such as Subscriber/Member, Property & Casualty(P&C)Claims, Plan/ Product."}
{"text": "Experienced with multiple payer applications including AMISYSand FACETS and DIAMOND, XLESYS."}
{"text": "Worked on implementing HIPAA 4010 and HIPAA 5010 transaction set rules."}
{"text": "Extensive knowledge of Salesforce.com implementation cycle in Sales, Marketing, Service and support modules. "}
{"text": "Experience dealing with enterprise data ware house projects dealing with data transactions and data analysis."}
{"text": "Business Analyst with solid understanding of Business Requirements Gathering, Business Process Flow and Business Process Modeling"}
{"text": "Experience in SalesForce Testing and Administration spanning all facets of package software and SaaS application implementation. "}
{"text": "Solid background in Software Development Life Cycle methodologies such as the Traditional Waterfall Model as well as iterative approach to software development. "}
{"text": "Experience in building SQL Queries, Creating sub queries, minus, union, inline queries and performance tuning of SQL (DB2 and Oracle). "}
{"text": "Knowledge in Salesforce.com SFA, Force.com Apex Classes, Apex triggers, Integration, Visual force, Force.com API, SOQL, and SOSL. "}
{"text": "Experienced in performing Business Process Analysis to check the compatibility of the existing system infrastructure with the new business requirements."}
{"text": "Involved in reviewing test procedures, defining test cases, reviewing and maintaining test scripts, analyzing bugs and User Acceptance Testing (UAT)."}
{"text": "Involved in design and development of Enterprise applications using Microsoft.Net Technologies and SQL server Database 2010 and 2008 VB.NET, ASP.NET, Web Services, UML, HTML, Java Script and XML."}
{"text": "Extensive experience in using MS Project for status reporting and planning."}
{"text": "Team player, result-oriented, fast learner, excellent communication skills with strong research capability."}
{"text": "Strong knowledge of Business Intelligence, Data Warehousing and Business Architecture."}
{"text": "Documented artifacts required for each cycle in Agile/Scrum. Used JIRA Agile for management of team projects"}
{"text": "Technical Skills:"}
{"text": ""}
{"text": ""}
{"text": "Client: ELI LILLY, Indianapolis, IN\t\t\t\t\t\t\t\t\tOctober 2013 –Jan 2016 "}
{"text": "Sr. Salesforce Business Analyst "}
{"text": "Eli Lilly has built a reputation for exceptional clinical quality, preventive care, disease management and member satisfaction and has consistently rated among the top plans in the country."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Performed the requirement analysis, impact analysis and documented Business Requirements Document (BRD) and Functional Specification Document (FSD) using Rational Requisite Pro."}
{"text": "Prioritized deliverables, identified gaps, tracked defects, defined software requirements, created artifacts for testing and development. "}
{"text": "Gathered knowledge on Medicare Part- B, D HL7 V3, HIPAA rules and regulations. "}
{"text": "Performed Impact analysis for readiness of ICD-10 conversion."}
{"text": "Worked on delivering the final phase of the new Claims Processing Engine, Compass21 as part of MMIS."}
{"text": "Managed team providing end-to-end support during the deployment to customized version of Salesforce.com and its integration with the legacy CRM system."}
{"text": "Conducted several checks on the data flow into Salesforce.com application with the help of SQL Queries to develop test data. "}
{"text": "Hands on work experience with Waterfall, and Agile software development methodology."}
{"text": "Program governance and project management responsibilities of all transformation and transition projects for Annuities client letters, confirms and account statements. "}
{"text": "Worked with Salesforce team on regular basis to discuss and document various Business needs, requirements, development of the application and to discuss and resolve any issues, changes or problems during various phases of SDLC. "}
{"text": "Used Mercury Quality Center and created a test case to store the test cases which were created"}
{"text": "Collaborated efforts with technical staff and subject matter experts to establish the technical vision of product and analyze triple constraint tradeoffs."}
{"text": "Wrote and executed system test plans, test cases and test data on MS Excel for the web-based application."}
{"text": "Managed BIG Data projects with one utilizing skills in area of JMP-Pro, SQL Server Management Studio, SQL Server Analysis Services, Dimensional Modeling, etc. "}
{"text": "Worked on End to End Implementation and Integration of Marketo with  Salesforce. "}
{"text": "Experience with developing User Stories throughout the Agile Lifecycle as well as created various UML diagrams such as Use Case, Activity and State Chart diagrams with tools like Rational rose and MS Visio."}
{"text": "Modified fields and record types in various Salesforce.com standard objects like Accounts, Contact, Campaign, and Lead; along with building custom objects for internal purposes such as Recruiting with Job Application, Interview Processing and HR Management. "}
{"text": "Experience managing requirements using Blue Print Requirements software for time and budget management."}
{"text": "Created UML diagrams- Use Case Diagrams, Activity Diagrams, Sequence Diagrams and ER Diagrams in MS Visio. "}
{"text": "Documented the Traceability Matrix for tracing the Test Cases and requirements related to them."}
{"text": "Recommended changes for system design, methods, procedures, policies and workflows affecting Medicare/Medicaid claims processing in compliance with government compliant processes like HIPAA/ EDI formats and accredited standards like ANSI. "}
{"text": "Analyzed, maintained and updated FAQ knowledge base in SharePoint for better data accuracy and better timely data availability."}
{"text": "Environment: Salesforce.com, MS Visio, Oracle Clinical, Agile, LIMS, CSS, cGMP, BIG Data, UI, FDA Regulations, , Windows NT, MS Office (MS Excel for reporting), Rational Rose, Requisite Pro, Xcelys."}
{"text": ""}
{"text": "HANCOCK GROUP OF PHARMACIES, CT\t\t\t\t\t\t\tJuly 2011 – September 2013"}
{"text": "Salesforce Business Analyst  "}
{"text": "Senior Business Analyst for the department of Pharmacy in 16 Hancock groups of pharmacies. "}
{"text": "Responsibilities:"}
{"text": " "}
{"text": "Performed the requirement analysis, impact analysis and documented Business Requirements Document (BRD) and Functional Specification Document (FSD) using Rational Requisite Pro."}
{"text": "Prioritized deliverables, identified gaps, tracked defects, defined software requirements, created artifacts for testing and development. "}
{"text": "Interacted with customers and established new corporate business. Fast paced customer service and sales driven work environment with sales force."}
{"text": "Gathered knowledge on Medicare Part- B, DHL7 V3, HIPAA rules and regulations. "}
{"text": "Worked with customers in resolving acute issues, fixes involving Meditech (MT) software& coordinating all activity within each assigned Meditech module."}
{"text": "Worked with numerous business teams for requirement gathering and data collection to implement the business on Salesforce platform by customizing the objects to meet the functional needs of the organization. "}
{"text": "Performed Impact analysis for readiness of ICD-10 conversion."}
{"text": "Initial analysis and design on the Cash and Financial initiatives for the MMIS project."}
{"text": "Responsible as part of a team in preparing a report on enterprise data warehousing requirement for Customer Relationship Management."}
{"text": "Experience supporting the design, implementation and maintenance of multiple, complex data warehouses including Texas Medicaid Vision 21 data warehouse, Texas Medicaid Encounters Data Warehouse, the Texas Medicaid Pharmacy Claims Data Mart, and the Connecticut Medicaid Decision Support System."}
{"text": "Created interactive dashboards to enhance the User Experience using Microsoft VISIO and Requisite Pro."}
{"text": "Administered Salesforce CRM applications for Sales, Marketing and Support Departments. Involved in creating multiple analytical reports, with varying degreee of complexity. "}
{"text": "Used Market Prominence as a process to have central unifying source for all data and for management of relationships and workflow processes."}
{"text": "Collaborated efforts with technical staff and subject matter experts to establish the technical vision of product and analyze triple constraint tradeoffs."}
{"text": "Interacted with providers and other medical professionals regarding billing, documentation policies, procedures and regulations. "}
{"text": "Experience dealing with Avaya communication management system by making interactions to the communication manager regarding objectives."}
{"text": "Recommended changes for system design, methods, procedures, policies and workflows affecting Medicare/Medicaid claims processing in compliance with government compliant processes like HIPAA/ EDI formats(850, 860, 855, 856, 810, 867, 830, 862, 846) and accredited standards like ANSI. "}
{"text": "Managed the planning / test process for Medicare Part D Pharmacy Claims (PBM)."}
{"text": "Analyzed, maintained and updated FAQ knowledge base in SharePoint for better data accuracy and better timely data availability "}
{"text": "Environment: Salesforce.com, Oracle Clinical, LIMS, CSS, cGMP, FDA Regulations, Genesys, MS Visio, Windows NT, MS Office (MS Excel for reporting), Rational Rose, Requisite Pro, Xcelys."}
{"text": ""}
{"text": "Allergan, Texas\t\t\t\t\t\t\t\t\t\t\tAugust 2009 – June 2011"}
{"text": "Business Analyst "}
{"text": "Worked in Clinical trial system as well as good manufacturing practices; this is an application used to collect the patient data who is taking part in the new study for a drug/vaccine. This is a CFR Part 11 validated and Regulated Systems for clinical trials. For document management system and quality management "}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Identified and validated high potential business opportunities for stakeholders and develop customized business strategies that are aligned with corporate strategic objectives."}
{"text": "Processes claim adjustment requests in Xcelys following all established adjustment and claim processing guidelines.  "}
{"text": "Utilize SharePoint and Excel as necessary to work through daily inventory assignments.  "}
{"text": "Identifies and escalates root cause issues to supervisor for escalated review.  "}
{"text": "Reviews and responds to internal escalated provider disputes transferred by management and other associates.  "}
{"text": "Provided Salesforce usage training and support to end users including developing necessary documentation. "}
{"text": "Used MS Visio for flow-charting, process model and architectural design of the application."}
{"text": "Assisted with proposal development (i.e.; writing proposals, contracts PMPs, cost analysis, etc.), contract compliance and the development of new business initiatives. "}
{"text": "Worked on delivering the final phase of the new Claims Processing Engine, Compass21. "}
{"text": "Produced ad hoc reports and extracts from Texas Medicaid Vision21 Data Warehouse, ranging from small Excel deliverables to massive text file extracts, based on specifications provided by requestors (MMIS). "}
{"text": "Acts as liaison with other departments when additional clarification is needed about claims payment policy disputes.  "}
{"text": "Managed from inception to closure, 30 Customer Reporting project based around the Genesys CCA solution. "}
{"text": "Initial analysis and design on the Cash and Financial initiatives for the Compass21 project"}
{"text": "Conducted GAP analysis of current state for Medicare Part-D (As-Is) ICD 9 and proposed state (To-Be) ICD 10 situations and represented the same on MS Visio."}
{"text": "Worked with Vision21 Maintenance and Modifications organizations as a Subject Matter Expert for Managed Care encounter transactions. (MMIS)"}
{"text": "Validated PQ’S of Mass Spectroscopy, Color Chromatography."}
{"text": "Maintained records for lab assay data and converted them to Electronic lab notebook. Programmed SAS based Monte "}
{"text": "Environment: Java, JSP, Oracle Clinical, LIMS, CSS, cGMP, FDA Regulations,Genesys, MS Visio, Windows NT, Cognos, MS Office (MS Excel for reporting), Rational Rose, Requisite Pro, Xcelys."}
{"text": ""}
{"text": "MetLife Insurance, San Francisco, CA\t\t\t\t\t\t\t\tNov 2008- August 2009  "}
{"text": "Business Analyst"}
{"text": "Metropolitan Life Insurance Company is one of the largest and most recognized insurance companies in the United States. It not only provides personalized customer service but also have fast claims services. MetLife Insurance offers various insurance policies to customers like providing health, life and Auto Insurance. "}
{"text": "Worked on multiple projects, Contributed in designing a prototype for future system claim processing by developing a web-based service application to streamline office workflow processes involved in Electronic Data Interchange (EDI) (214, 810, 830, 844, 845, 846, 849, 850, 852, 855, 856, 860, 864,867,888) transactions and benefits in claims management cycle based on HIPAA Guidelines (ICD 9 – ICD 10). "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Process claims for all lines of business including but not limited to HMO, PPO, POS, TPA, P&C and Medicaid/Medicaid.  "}
{"text": " Audit claims for accuracy as it relates to State Medicaid and appeal denials as needed.  "}
{"text": "Work all pending holds according to plan benefits to ensure timely and proper payment.  "}
{"text": "Assist in all trainings and meetings related to claims processing and implementations. "}
{"text": " Educate providers on benefits and eligibility related to member utilized health services. "}
{"text": " Collaborate with the health improvement department to create and implement health related activities. "}
{"text": "Performed the requirement analysis, impact analysis and documented Business Requirements Document (BRD) and Functional Specification Document (FSD) using Rational Requisite Pro."}
{"text": "Analyzed business processes, requirements, and data necessary to provide detailed logic for ETL development. "}
{"text": "Created UML diagrams- Use Case Diagrams, Activity Diagrams, Sequence Diagrams and ER Diagrams in MS Visio. "}
{"text": "Documented the Traceability Matrix for tracing the Test Cases and requirements related to them."}
{"text": "Conducted GAP Analysis of current state (As-Is) ICD 9 and proposed state (To-Be) ICD 10 situations and represented the same on MS Visio."}
{"text": "Supported development of UAT cycle test scripts, Review User Acceptance Test Plan (UATP) and attend walkthrough "}
{"text": "Managed the planning / test process for Medicare Part D Pharmacy Claims (PBM)."}
{"text": ""}
{"text": "ENVIRONMENT: MS PowerPoint, Requisite Pro,XML, MS Visio, Dreamweaver, Genesys, UI, MS Excel, MS Access, MS Word, Oracle,  Waterfall SDLC."}