{"text": "Name: louise louise"}
{"text": "E-Mail: louise.louise@gmail.com"}
{"text": "Address: Shangrao, China"}
{"text": "Github: https://github.com/louise"}
{"text": "LinkedIn: https://linkedin.com/louise"}
{"text": "Phone No. 504064395489"}
{"text": "IT professional with over 7+ yearsof experience in Object Oriented Analysis, Design and Java Development using Java8/J2EE technologies. Excellent communication and interpersonal skills, quick learner, self-motivated, ability to work individually and as well as in a team environment with good team spirit."}
{"text": ""}
{"text": "Professional Summary:"}
{"text": "Experience in all stages of Software Development Life Cycle (SDLC) including gathering requirements, analysis, design, development, testing and implementation of projects using software methodologies like Agile/Scrum and Waterfall. "}
{"text": "Extensive expertise with Java8, J2EE, JSP, JDBC, Servlets, Java Beans, EJBs (Session beans, Entity Beans and JMS), J Boss, JavaScript, Angular 2, Knockout js, jQuery, CSS, Ajax, Jason, XML, DTD,XSD, JAXP, JAXB, Web Services, Struts, Spring, Microservices, Hibernate and Oracle PL/SQL."}
{"text": "Good knowledge on Object Oriented Analysis, Design and Object modelling using UML like Class diagrams, Use cases, Sequence and Test Cases. "}
{"text": "Experienced in Behavior driven development (BDD) and Test-driven development (TDD) approach using SCRUM framework under Agile Methodology. "}
{"text": "Having Extensive experience on core java concepts like Multi-Threading, Inheritance, Abstraction, Encapsulation, Polymorphism, Exception handling, and Collections Framework. "}
{"text": "Extensively used Java 8 Streams, Lambdas and Filters to process Order data. "}
{"text": "Expertise in Java Servlets, JSP, Struts, EJB (session Beans and Message Driven Beans), JMS, JDBC, Frameworks (Struts, spring, Hibernate, JSF) in Implementing web based and enterprise solutions. "}
{"text": "Used NodeJS, React. JS, and Backbone.JSMVC framework for developing the Single Page Application (SPA)."}
{"text": "Worked with Microservices using J2EE Web Services based on Spring Boot and created dynamic documentation of RESTful endpoints using Swagger API."}
{"text": "Used Swagger specification for documenting REST API's, which exposes description of a RESTFUL web- services to different clients."}
{"text": "Expertise in implementing applications with Model-View-Controller (MVC) pattern and implementing various Java8/J2EE design patterns including Singleton, Factory, MVC, Front Controller, DAO, Data Transfer Object and Session Facade."}
{"text": "DevOps role included automation of processes. Heavy use of shell scripting in order to automate deployment an post deployment activities."}
{"text": "Proficient in building Web Applications using HTML5, XML, XHTML, AJAX, JavaScript (jQuery, AngularJS), Bootstrap and CSS in a Client/Web Server environment. "}
{"text": "Experience in working in Software Configuration Management using TortoiseSVN, Microsoft Visual Source Safe (VSS) and Visual Studio Team Foundation Server (TFS)."}
{"text": "Building and deploying applications in AZURE."}
{"text": "Good experience in writing application on No SQL databases like Cassandra and MongoDB. "}
{"text": "Experience in developing the User Interface (UI) Applications and professional web applications using HTML 4.0/5, CSS2/CSS3, JavaScript, Angular JS 2.0/4.0, React JS, Node JS, jQuery, AJAX, JSON, XHTML, XML and Bootstrap. "}
{"text": "Hands on Experience with Middleware Technology Messaging Brokers like JMS, Active MQ, Rabbit MQ."}
{"text": "Auto documented REST services using Swagger and WSDL for SOAP WS."}
{"text": "Experience in dealing with CI/CD tools like Jenkins,Git Stash, Dockers. "}
{"text": "Exposure building Java applications using tools like ANT, MAVEN and Gradle."}
{"text": "Have experience working in Agilemethodology."}
{"text": "Experience in Data Modeling and working with Cassandra Query Language (CQL). "}
{"text": "Experienced in React JS and working with React Flux architecture. "}
{"text": "Developed and maintained code for various applications using PHP, Java8 and MySQL."}
{"text": "Created LINQ enabled database layer using API such as LINQ to SQL and Entity Framework. "}
{"text": "Experience in creating SPA pages with AngularJS."}
{"text": "A Good team player with excellent communication and inter-personal skills with a positive attitude towards work, loyalty towards time schedules for worthful delivery."}
{"text": ""}
{"text": ""}
{"text": "Technical Expertise:"}
{"text": ""}
{"text": "Languages Java8, J2EE, XML, PL-SQL, Unix Shell Script, C, C++, JavaScript. "}
{"text": "Databases SQL Server, MySQL, Oracle Postgres SQL, Mongo DB, Cassandra. "}
{"text": "Web Technologies JSP, JSON, Servlets, XML, HTML, XSLT, JSF, CSS, JavaScript, Node JS, Angular JS, Angular 2.0/4.0, Bootstrap, DOJO, JAXB 2.2.11, JMS. "}
{"text": "J2EE Technologies Struts, Spring, JDBC, EJB, Java Beans. "}
{"text": "Application Servers JBOSS, BEA WebLogic […] "}
{"text": "Web Servers Tomcat 6.x/7.x/8.x, IBM WebSphere. "}
{"text": "Database Tools TOAD, SQL Developer, MySQL Work bench. "}
{"text": "Operating Systems Windows, Unix and Linux. "}
{"text": "IDE's Eclipse, IntelliJ. "}
{"text": "Frameworks Struts 1.x/2, JSF 2.x, Angular JS 2.0/4.0, Spring 4.x/3.x, iBatis 2.x, Hibernate 3.x/4.x, JSP and velocity, Spring MVC, Apache Camel. "}
{"text": "Tools & Packages CVS, SVN, GIT, GitHub, Maven, Gradle, Jenkins, ANT, Log 4J, Mockito, Junit, Jenkins, JIRA, Design Patterns. "}
{"text": "SDLC Methodologies Agile, Waterfall and Scrum Models."}
{"text": "Education:"}
{"text": "Bachelor of Engineering at Anurag College of Engineering, Hyderabad, India."}
{"text": "Master’s degree at DeVry University, Chicago, Illinois."}
{"text": "Professional Experience:"}
{"text": "American Airlines, Fort Worth, TX    \t\t\t\t\t\t\tFeb 2017 – Till Date"}
{"text": "Role: Full Stack Developer\n"}
{"text": "Responsibilities:"}
{"text": "Involved in full life-cycle of the project from requirements gathering to transition using Agile Methodology."}
{"text": "Following Agile - Sprint methodologies to do requirements gathering, analysis and planning, development & testing. "}
{"text": "Participating in Agile scrum meetings, updating the tasks based on the user stories in Rally. "}
{"text": "Using Eclipse as IDE tool and Rally for bug and issue tracking, Any Point Studio for Mule Soft. "}
{"text": "Developing an Integration Component with third party application using Mule ESB 3.7.1. "}
{"text": "Implemented Java 1.8 features for the existing application where ever required. "}
{"text": "Implementing SOAP web service components using JMS, Mule ESB. "}
{"text": "Developing Core Java programs for all business rules and workflows using spring MVC framework and spring Data MongoDB."}
{"text": "Adopt Devops model for build and deployment of application components"}
{"text": "Using Spring Boot for developing microservices, Soap to retrieve data from client-side using Microservice architecture and Pivotal Cloud Foundry (PCF) for deploying microservices. "}
{"text": "Rewriting java code using AKKA Framework because of Mule performance issues. "}
{"text": "Developing code for SOAP Web services using XML and used SOAPUI tool for testing the services proficient in testing Web Pages functionalities and raising defects. "}
{"text": "Involving with bug fixing on functionality, performance and designing issues with JavaScript and AngularJS."}
{"text": "Created the Node.js EXPRESS Server combined with Socket.io to build MVC framework from front-end sideAngularJS to back-end MongoDB, in order to provide broadcast service as well as chatting service."}
{"text": "Created proof-of-concept using responsive web design, Node.js, React JS, HTML5 and CSS3. Resolving Cross Browser Issues. "}
{"text": "Used Jira Atlassian tools like Bamboo for Continuous Integration and deployment, Bit Bucket and Confluence."}
{"text": "Build REST web service by building Node.js Server in the back-end to handle requests sent from the front-end jQuery Ajax calls."}
{"text": "Using SOAP UI and POSTMAN for testing Workday endpoint URL's and development of webservices. "}
{"text": "Implementing Swagger Configuration in Java Spring boot for auto generating swagger JSON files for REST API call."}
{"text": "Implemented AngularJS Controllers to maintain each view data. Implemented Angular Service calls using Angular Factory. "}
{"text": "Used SOAP based Web Services from scratch to develop interfaces to integrate between front endsystems and back end systems. "}
{"text": "Hands-n experience in Automation tools like chef, puppet,Kafka."}
{"text": "Implemented source control and version control using GIT Hub and JIRA& Version One. "}
{"text": "Maintained the Version, Labeled Versions and Backups of the source using GitHub. "}
{"text": "Maintained and debugged existing code Jira, Stash/GIT, and Used SVN for version control."}
{"text": "Everyday tasks include Agile, Rally, Jira, GitHub, Stash."}
{"text": "J2EE application development on Windows and UNIX platforms using MVC pattern"}
{"text": "Created Business Logic Layer, Repository Layer & Data Access Layers to implement MVC architecture. "}
{"text": "Environment:Java, J2EE, HTML, CSS, JavaScript, Spring Boot, Kafka, XML, Docker, JSP, Angular JS, Servlets, Spring, Struts, Jasper Report, Hibernate, MongoDB, Web services, SQL, Oracle, Swagger,GWT, Stash, AWS, bamboo,Microservices, Eclipse, GIT, Jenkins, Maven, Log4j, JUnit, WebLogic 10.X, IBM WebSphere Application Server, JIRA, ClearCase Unix/Shell Scripting."}
{"text": ""}
{"text": "Alaska Airlines, SeaTac, WA\t\t\t\t\t\t\t\tJan 2016 – Jan 2017\nRole: Java/J2EE Developer\nResponsibilities:"}
{"text": "Involved in requirement gathering, functional and technical specification. "}
{"text": "Used Java-J2EE patterns like Model View Controller (MVC), Business Delegate, Data TransferObjects, Data Access Objects, factory patterns. "}
{"text": "Worked on testing and deployment automation with Docker, MongoDB, Jenkins, AWS and Ansible."}
{"text": "Setup Drools Rule Engine on JBOSS server and manage configuration. "}
{"text": "Used Spring boot actuator to monitor and track the application in a production environment by check healthy, threads dump, and metrics."}
{"text": "Used Apache Kafka (Message Queues) for reliable and asynchronous exchange of vital information between multiple business applications."}
{"text": "Involved in writing java API for Amazon Lambda to manage some of the AWS services. "}
{"text": "Involved in analysis, specification, design, and implementation and testing phases of Software Development Life Cycle (SDLC) and used agile methodology (SCRUM) for developing application. "}
{"text": "Upgraded existing UI with HTML 5,CSS3, MongoDB, jQueryand Bootstrap with AngularJS 2.0 interaction. "}
{"text": "Used Spring Framework AOP Module to implement logging in the application to know the application status. "}
{"text": "Implemented the application using Spring IOC, Spring MVC Framework, Spring Batch, Hibernate and handled the security using Spring Security. "}
{"text": "Configured persistence-Context in Spring Framework and Hibernate as a persistence provider to interact with the database. "}
{"text": "Used Swagger for documenting Restful API."}
{"text": "Implemented modules into Node.js to integrate with design and requirements & also back-end service using Node.js and REACT modules. "}
{"text": "Produced Restful Webservices using JAX-RS and Jersey Framework. "}
{"text": "Developed user interface using JSP, JSP Tag libraries, third party libraries and Java Script to simplify the complexities of the application. "}
{"text": "Utilized Cassandra, NOSQL database management system for keeping user generated data by upgrading of Couch base and Cassandra cluster."}
{"text": "Converted the static HTML design markup to fully functional components by writing the custom directives in Angular JS. "}
{"text": "Good Knowledge in documentation of REST APIs using Swagger and WADL."}
{"text": "Developed Microservices to provide RESTful API utilizing Spring Boot with Spring MVC. "}
{"text": "Moving existing monolithic architecture to microservices and migrating them to AWS cloud. "}
{"text": "Utilized AWS EC2 instances to deploy Docker containers with microservices architecture. "}
{"text": "Experience with AWS S3 services creating buckets, configuring buckets with permissions, logging, versioning and tagging."}
{"text": "Developed single page applications using AngularJS. "}
{"text": "Used jQuery and AJAX to make asynchronous calls to the Controllers to validate business logic and load partial views in MVC. "}
{"text": "Configured Swagger-UI, registered Micro service with Eureka server to monitor service health check from Spring Boot admin console."}
{"text": "Involved in enhancing the application for client’s requirement based on demand using the MVC pattern, J Query, Bootstrap, and Web API and SPA Application using Angular JS."}
{"text": "Involved in creating web pages using Angular JS, JavaScript, jQuery, HTML 5.0 and CSS. "}
{"text": "Improved user experience using jQuery. Used jQuery event handling mechanism to dynamically assign events on web controls. "}
{"text": "Developed advanced ETL import packages using SSIS, T-SQL to transform and import raw index data into database tables. "}
{"text": "Provided efficient error handling to the SSIS packages. "}
{"text": "Used Fiddler to debug web request and responses to solve user issues on the client side. "}
{"text": "Environment:Java, J2EE, Spring Framework, Angular JS 2.0, Spring MVC, Node JS, AWS, Cassandra, Docker, Hibernate, Bootstrap, HTML, Swagger,JSP, MongoDB, CSS, JavaScript, jQuery, AJAX, Rest Webservices, Microservices, Spring Boot, apache Kafka, Splunk, Selenium, Mockito, JUnit, JSON, WebLogic Application Server, Junit, GIT, Maven, Jenkins."}
{"text": ""}
{"text": ""}
{"text": "United Health Group, Minneapolis, MN    \t\t\t\t\t Jan 2014 – Dec 2015"}
{"text": "Role: Java Developer\n"}
{"text": "Responsibilities:"}
{"text": "Involved in all stages of SDLC started from requirements gathering to Analysis, Design, Implementation, Testing and Deployment of entire project."}
{"text": "Developed Web Service for retrieving Employee Data (based on XML, WSDL, and SOAP). "}
{"text": "Worked extensively on the UI, created views by utilizing MVC3, and created view models. "}
{"text": "Consumed Web Services using WCF for online transactions using C# and exposed them through SOAP and HTTP. "}
{"text": "Worked in an Agile work environment with Content Management system for workflow management and content versioning. "}
{"text": "Developed Frond End Web application by using Angular JS, Bootstrap, HTML, CSS3 (SaaS) and JSF. "}
{"text": "Worked extensively with Core Java, Multithreading, and Collections."}
{"text": "Reduced latency by 20% with utilized Redis to construct distribute cache processing  "}
{"text": "Designed front-end user interfaces with React JS by creating many components and modules. "}
{"text": "Worked on Spring DAO module encapsulated using DAO pattern to implement persistent layer components. "}
{"text": "Used and implemented the application using Spring MVC, Spring IOC, Spring Annotations modules and Hibernate. "}
{"text": "Strong programming skills in designing and implementation of multi-tiered applications using web-based technologies like Spring MVC, Spring Boot and Spring Cloud."}
{"text": "Developed Web Services to allow communication between applications through REST over HTTP. "}
{"text": "Used JSON, XML, XSL and XSLT for consuming RESTfulWeb Services. "}
{"text": "Migrating existing application into REST based Microservices to provide all the CRUD capabilities using Spring Security. "}
{"text": "Involved in migrating existing monolithic application into Microservice Architecture based RESTful Service and deployments were done using Docker."}
{"text": "For deploying the application, we used JBOSS and we are responsible for usage of Continuous Integration and Continuous Delivery (CICD) process. "}
{"text": "Used Oracle as database and Involved in the development of PL/SQL backend implementation and using SQL created Select, Update and Delete statements. "}
{"text": "Implemented SOA architecture with web services using SOAP, WSDL, UDDI and XML. "}
{"text": "Designed extensive additions to existing Java Web Application utilizing Service Oriented Architecture (SOA) techniques. "}
{"text": "Deployment, support and configuration of cloud services performed such as AWS (Amazon Web services)."}
{"text": "Have done data model principles, fit-gap analysis, prototyping, development, implementation, maintenance and support during the product design and development. "}
{"text": "Environment:Java, J2EE, JSP, Springs, Hibernate, Eclipse,Redis, Web Logic 10g, jQuery, MVC, Oracle 11g, HTML5, CSS, Angular JS, XML, UML, Web Services, JUnit, EJB, GIT, Windows, UNIX."}
{"text": ""}
{"text": "HSBC Bank, Mumbai, India\t\t\t\t\t\t\tMay 2012 – June 2013"}
{"text": "Role: Jr. JAVA/J2EE Developer\n"}
{"text": "Responsibilities:"}
{"text": "Participated in requirement gathering sessions with the client and preparation/modifying of the requirements in Requirement Specification document. "}
{"text": "Designed and developed Application using Spring Framework, Spring MVC and Spring Templates. "}
{"text": "Developed front end using the JSF, JSTL, HTML, CSS, Bootstrap, JavaScript, jQuery, Typescript and AngularJS. "}
{"text": "Involved in Requirements gathering, analysis, and design, development, and Testing and Maintenance phases of the application. "}
{"text": "Implemented Agile development process on Software Development Life Cycle. "}
{"text": "Used Spring Core for concept Inversion of control (IOC) implemented using dependency injection. "}
{"text": "Used Hibernate Query Language (HQL) for writing the queries. "}
{"text": "Developed Soap and Rest web service clients to communicate with third party vendors. "}
{"text": "Involved in using REST API while integrating with servers. "}
{"text": "Created sequence and stored procedures for analyzing complex queries. "}
{"text": "Developed Junit test classes for unit testing purposes. "}
{"text": "Involved in setting up Maven configuration and helping Continuous Integration (CI) Issues. "}
{"text": "Developed server running script for automation using the JBoss 6.3 application server "}
{"text": "Extensively used GIT as the version controlling Tool. "}
{"text": "Configured Log4j for adding the debugging information in the code base. "}
{"text": "Involved in creating JUNIT test cases and ran the TEST SUITE. Ran check style, PMD defects & Find bugs and fixed them. "}
{"text": "Involved in debugging the defects, code review and analysis of Performance issues. "}
{"text": "Involved in peer level design & code reviews. Used GIT for version and source control."}
{"text": ""}
{"text": "Environment:Java /J2EE, Multithreading, core Java, Spring, Hibernate ORM 4.3.0, Spring web-flow, Spring MVC, Spring AOP, Spring Hibernate, JSF, JSTL, HTML, CSS, Java Script, AngularJS, Bootstrap, XML."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Innominds, Hyderabad, India      \t\t\t\t\t\tJune 2011 – April 2012"}
{"text": "Role: SQL Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Interacting with the business users to understand the functionality and their requirements. "}
{"text": "Designed and developed custom packages, procedures, Triggers using PL/SQL."}
{"text": "Loaded data into Oracle using PL/SQL, Dynamic SQL UTL_FILE, SQL* Loader and extensive use of External Tables "}
{"text": "Designed the packages and procedures for getting the data from Source systems to ESA (Enterprise Staging Area) and from ESA to EDW (Enterprise Data Warehouse) "}
{"text": "Extensively worked on Oracle Packages, procedures and functions using PL/SQL, SQL, SQLNavigator and PL/SQL Developer. "}
{"text": "Performed unit testing on the developed code to ensure that its bug free and handled Production issues and manage the same in issue log. "}
{"text": "Interacted with Business Analysts and Users in requirement gathering, built complex queries using SQL and wrote stored procedures using PL/SQL. "}
{"text": "Involved in the database design for better understanding the relations, associations and dependencies within the database. "}
{"text": "Involved in creating people soft Interactive Charts and Navigation links using Java Script."}
{"text": "Designed Technical design document based on the business requirements. "}
{"text": "Worked on SQL*Loader to perform bulk data loads into database tables from external data files. "}
{"text": "Designed and developed Oracle PL/SQL Procedures, Functions, and Database Triggers and involved in creating and updating Packages to meet business requirements. "}
{"text": "Created UNIX shell scripts to automate data loading, extraction and to perform regular updates to database tables to keep in sync with the incoming data from other sources.\t"}
{"text": ""}
{"text": "Environment:Oracle 10g, PL/SQL, Report Builder 10.1.2.0.2, Jasper Server 3.1.1/1.3.0, Jasper ETL, I Report 3.1.1/1.3.0, Toad 7.5.2.0, UNIX."}
{"text": ""}
{"text": ""}
{"text": ""}