{"text": "Name: lucy lucy"}
{"text": "E-Mail: lucy.lucy@gmail.com"}
{"text": "Address: Hangzhou, China"}
{"text": "Github: https://github.com/lucy"}
{"text": "LinkedIn: https://linkedin.com/lucy"}
{"text": "Phone No. 625211649716"}
{"text": ""}
{"text": "Over 8 years of extensive IT experience in Front End/UI development with emphasis on HTML/HTML5, XHTML, DHTML, XML, CSS/CSS3, AJAX, DOM, JSON, JavaScript, jQuery, Bootstrap, AngularJS, Angular 2/Angular 4, D3.js, ReactJS, NodeJS, ExpressJS and BackboneJS."}
{"text": "Strong experience in Software Development Life cycle (SDLC) – Analysis, Design, Development, Testing and maintenance of applications."}
{"text": "Expertise in MVC architecture, Object Oriented programming along with building SPA (Single Page Applications) using AngularJS."}
{"text": "Experience in working with Angular 2/4 modules, services, templates, directives, services and dependency injection to create a SPA."}
{"text": "Good understanding of Document Object Model (DOM) and DOM functions. "}
{"text": "Good understanding in developing Responsive Web designs from scratch as well as using frameworks like Bootstrap."}
{"text": "Experience in Object Oriented JavaScript (ES5 and ES6) and use of design patterns like module, revealing module and singleton pattern."}
{"text": "Experience on working with CSS Background, CSS Layouts, CSS positioning, CSS text, CSS border, CSS margin, CSS padding, CSS table, Pseudo classes, Pseudo elements and CSS pre-processing platforms such as LESS and SASS."}
{"text": "Highly experienced in designing, developing and debugging applications using technologies like Java, AngularJS, AMD (CommonJS/RequireJS), NodeJS, Grunt, Bower, Gulp, Webpack, Backbone, Handlebar, Dojo, React, Underscore,"}
{"text": "Designed and delivered UXDesign, user stories, user journeys, and mockups optimized for a wide range of devices and interfaces."}
{"text": "Experience in creating Personas, user scenarios, UX specs, task flows, wireframes, site maps, storyboards, taxonomies, task flows, wireframes, mock-ups, prototypes, localization, accessibility, visual design and design patterns. "}
{"text": "Working knowledge in implementing AJAX in web clients to asynchronously communicate with server resources."}
{"text": "Experience in working with RESTful Web services, XML and JSON data formats communication. "}
{"text": "Proficient in creating MEAN Stack based web applications using AngularJS, NodeJS, MongoDB and ExpressJS."}
{"text": "Knowledge in creating modular designs by using Angular 2 and Typescript."}
{"text": "Adept in writing clean, efficient, sematic, easy to read code."}
{"text": "Extensively used Core Java concepts like Collections, Exception Handling, Generics and Java I/O during development of Business Logic."}
{"text": "Experience in the Web Application GUI Development using HTML, CSS, JavaScript, XML and AJAX, DOJO Tool kit. "}
{"text": "Proficient in Java Multi-threading, Collections, and Exception handling concepts.Hands on experience with Spring MVC, Spring Boot, Hibernate and Struts frameworks."}
{"text": "Developed web applications based on different Design Patterns such as Model-View- Controller (MVC), DataAccess Object (DAO), Form Controller, Business Delegate, Service Locator, Transfer Objects etc. "}
{"text": "Experienced in implementing RESTful and SOAP Web Services using Spring framework. "}
{"text": "Experience in D3.js to build interactive data visualizations in web browsers and creating UI reports. Experience in creating the charts for Dashboard applications using D3.js."}
{"text": "Skillful in designing database in, MySQL, MS SQL Server, Oracle and Mongo DB databases."}
{"text": "Knowledge of tools like Chrome Element Inspector, Firebug, IE Tester for testing and debugging."}
{"text": "Practical knowledge in Unit Testing along with End-To-End Testing using test framework Qunit, Jasmine and test runner Karma."}
{"text": "Experience in profiling web applications and removing performance bottle necks and designing web applications and web contents utilizing various Search Engine Optimization (SEO) techniques."}
{"text": "Experience in using various IDEs for development - Notepad++, Sublime Text, Eclipse, IntelliJ, WebStorm, etc. "}
{"text": "Strong knowledge of UX Design principals and experience in Adobe Photoshop, Axure, Zeplin, Illustrator, Invision, etc."}
{"text": "Experience in designing UI layouts using Microsoft Visio and Creately."}
{"text": "Experience with working closely with back end developers, converting PSD to Pixel perfect layouts for both Web and Mobile layouts."}
{"text": "Strong understanding in using controllers, modules, directives, factories, services, dependency injection and digest cycle in AngularJS."}
{"text": "Ability to work with various browser compatibility issues of various browsers like IE, Mozilla, Chrome, etc."}
{"text": "Experience in NPM, Grunt, Gulp task runners to manage projects and Bower package manager to install libraries and dependencies."}
{"text": "Hands on experience with various version control tools like SVN, CVS and GIT"}
{"text": "Knowledge of Continuous Integration tools like Jenkins, Bamboo and build automation tools like Ant, Maven."}
{"text": "Experience in deploying applications using Amazon Web Services (AWS-EC2, S3, Cloud front).\t"}
{"text": "Experience in Unit Testing, Functional Testing, Browser compatibility Testing and Automation Testing."}
{"text": "Experience in working with TDD, ATDD, BDD and CI/CD engineering practices."}
{"text": "Well Acquainted with Waterfall, Scrum & Agile methodologies and proficient in using Agile bug tracking tool JIRA."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Par Pacific Holdings, Inc., Houston Texas                                                                          "}
{"text": "Role: Sr. Front End Developer/Full Stack Developer            June’ 2016 – Present"}
{"text": ""}
{"text": "Par Pacific Holdings, Inc owns, manages and maintains interests in energy and infrastructure businesses. The      company strategy is to identify, acquire and operate energy and infrastructure companies with attractive competitive positions."}
{"text": ""}
{"text": "Key Roles and Responsibilities:"}
{"text": "Involved in the design discussions and user experience sessions to provide inputs on the layout and UX along with development of layouts for web application matching the requirements."}
{"text": "Created Personas, user scenarios, UX specs, task flows, wireframes, site maps, storyboards, taxonomies, task flows, wireframes, mock-ups, prototypes, localization, accessibility, visual design and design patterns. "}
{"text": "Designed and generated fully-interactive HTML prototypes and click-throughs which were used for client presentations, mock-ups, as well as user-testing studies. "}
{"text": "Ensured mock-ups met both visual and textual branding standards. Defined and documented website design standards when needed. "}
{"text": "Developed user personas and scenarios to enhance functionality and usability for key audiences."}
{"text": "Designed front-end applications, User Interactive web pages using HTML5, CSS3, JavaScriptframework AngularJS and D3.js."}
{"text": "Followed MVC Structure to develop Application in AngularJS and D3.js."}
{"text": "Consumed RESTful web services using AngularJS HTTP service and rendered the JSON data on the screen."}
{"text": "Used JSON format for all server communications. Developed AngularFactor classes to build models from plain JSON messages "}
{"text": "Implemented various business validations using JavaScript."}
{"text": "Applied Dojo MVC Framework architecture to develop a highly modular and unit-testable front-end architecture for the front-end development. "}
{"text": "Developed custom Dojo Widgets, Enhanced Grids and the next generation DGrids using Dojolibraries. "}
{"text": "Developed JSON templates as data input format to feed the DOJO JavaScript program to render data on UI."}
{"text": "Developed export to pdf, excel feature for the UI data grids using Dojo API."}
{"text": "Implemented server-side task using Java, Servlets, Java Beans and XML."}
{"text": "Jboss Application server implementation, support, workload management and performance tuning including Web server setup configuration with Jboss App Server."}
{"text": "Implemented Webpack for downloading third-party library files and babel was implemented to use ECMAScript 6(ES6) features."}
{"text": "Utilized ECMAScript6 new features for supporting classes, constructors and for inheritance."}
{"text": "Implemented ECMAScript 6 arrow functions for lexical scoping and less ceremony when defining an anonymous function."}
{"text": "Improved performance on Angular.js side by not saving the session data on the memory side, which will be a significant overhead to server. "}
{"text": "Developed Slide bar, Popover, Type ahead, Dropdown functionality using Angular Strap. "}
{"text": "Utilized vanilla JavaScript to perform simple tasks where load times were critical and when needed to make async requests and handle some user events even when the user does not make that much interaction with the website."}
{"text": "Used AngularJS two-way data binding for automatic synchronization between the view and the model."}
{"text": "Implemented Angular JS Validation to validate user inputs and to create user-friendly web application"}
{"text": "Developed Angular JS Directives to extend the grammar of the web through reusable HTML elements, attributes, and classes."}
{"text": "Utilized Angular 2 concepts like building the components, Data binding, String Interpolation, Property Binding, Event Binding, Two-way Data binding (with the help of Forms Module), Directives using *ngif Structural Directive) to Output Data Conditionally, Styling Elements dynamically with ngClass, Outputting Lists with ngFor, Attribute Directives, Understanding ngSwitch, Pipes, Interpolation, Services & Dependency Injection, Using Services for Cross-Component Communication, Routing, Dealing with Reactive forms in Angular, Validations. "}
{"text": "Used AngularJS AJAX effectively to create pagination and with client-side events like quick search.  "}
{"text": "Developed base HTTP service on top of Angular JS HTTP service to communicate backend web services."}
{"text": "Loaded data into jQuery data tables using Restful Services."}
{"text": "Filtered data using different multiselect dropdowns and based on time and date as well as search Keywords."}
{"text": "Used D3.js to select elements, create SVG objects, style them, and add transitions."}
{"text": "Development of analytical reports using D3.js and Kendo UI Frameworks."}
{"text": "Developed various charts for dashboard applications using D3.js"}
{"text": "Used jQuery for creating various widgets, data manipulation, data traversing, form validations, create the content on the fly depend on the user request, implementing Ajax features for the application."}
{"text": "Developed fast loading images using Adobe Photoshop CS3."}
{"text": "Installed and maintained front-end libraries and their dependencies by Bower. "}
{"text": "Used NodeJS and ExpressJS to perform RESTful API operations."}
{"text": "Utilized NodeJS to set up local host as well as take advantage of NPM to manage the packages that contain the tools needed for this project."}
{"text": "Implemented the Node.js server-side code to interact with Mongo DB to store and retrieve data by using the Mongoose drivers."}
{"text": "Developed Web API using NodeJS and hosted on multiple load balanced API instances."}
{"text": "Maintained Cross Browser compatibility & implement Responsive Web Design using Bootstrap."}
{"text": "Used Apache Tomcat as a web server for the project."}
{"text": "Used Gulp to perform code minify and compile LESS to CSS."}
{"text": "Used JIRA as a bug and project tracking tool. Utilized GitHub as repository and Git for version control."}
{"text": "Performed Continuous Integration using Jenkins, Bamboo.Performed unit testing and end-to-end testing using Qunit framework and Karma to test individual modules."}
{"text": "Tested Angular 2 Services using Stubs and passed data via the fixture component instance."}
{"text": "Utilized Agile Methodology (Scrum) to manage full life-cycle development of the project and involved in sprint-planning, daily stand-ups, reviews, retrospectives, release planning and demos."}
{"text": ""}
{"text": "Environment:HTML5, CSS3, XML, JSON, RESTful web services, AJAX, JavaScript, jQuery,Angular 2/4, D3.js, Bootstrap, Bower, Gulp, LESS, Qunit, Karma, Firebug, Chrome Dev tools, Jenkins, Node.js, Express.js, NPM, Sublime Text, JIRA, Mongo DB, GIT, Agile, AWS,Dojo 1.8"}
{"text": "\t"}
{"text": ""}
{"text": "Client:Northern Trust Bank, Chicago, IL"}
{"text": "Role: Full Stack Developer\t\t\t\t\t\tNov’ 2013 – May’ 2016"}
{"text": ""}
{"text": "The Northern Trust Corporation is an American international financial services company headquartered in Chicago, Illinois. It provides investment management, asset and fund administration, and fiduciary and banking services through a network of 85 offices in 18 US states and 20 international offices in North America, Europe, and the Asia-Pacific."}
{"text": ""}
{"text": "Key Roles and Responsibilities:"}
{"text": "Involved in requirement analysis and design phases to implement with minimal errors."}
{"text": "Involved in re-designing the whole Website into a new look and feel as per the business requirement which we make it easier for a user to navigate."}
{"text": "Involved in UI review with UI architect and Business Units."}
{"text": "Designed front-end applications, User Interactive web pages using HTML5, XHTML, CSS3, D3.js, ECMA Script 5.0(ES5), Bootstrap, JSON, AJAX, React.js, Classic ASP."}
{"text": "Involved in migration of Classic ASP legacy code to C# code, ASP.net framework 4.0."}
{"text": "Utilized the ASP User controls (.ascx) for provide security by redirecting to reusable user login pages, thereby, reducing memory usage and time efficiency."}
{"text": "Worked with Flux as application architecture then moved on to REDUX as a state container for dynamic data handling."}
{"text": "Designed and developed GUI pages using CSS, HTML, jQuery, AJAX, DOJO, JSTL, PHP and JSP."}
{"text": "Reinventing the website with react REDUX to improve the experience of 1000+ users, working on server-side configuration for API route creation and connecting with Mongo DB Data Base Worked with Flux as application architecture then moved on to REDUX as a state container for dynamic data handling."}
{"text": "Installed and built React.js bindings which are not included in Redux.js framework."}
{"text": "Developed responsive web pages by implementing Bootstrap CSS and CSS Media Queries."}
{"text": "Worked in integrating Node.js with React.js for describing UI as a function of state, and emitting state updates in response to actions by Node.js."}
{"text": "Generated container components using the functionalities provided by React JSX for maintaining performance."}
{"text": "Created the front-end web pages using React.js with Babel, JSX, Classic ASP on HTML5, CSS 3 for performance."}
{"text": "Utilized JavaScript, JQuery, XML, AJAX calls for calling the back-end C# functionalities."}
{"text": "Was involved in retrieving data from SQLdatabase tables using ADO.net, C#.net, SQL Stored procedures and SQL parameterized queries."}
{"text": "Involved in collection and projection of the fetched data into respective fields (checkboxes, drop-down, etc.) using JSON objects."}
{"text": "Implemented Virtual DOM and React libraries to render only the subcomponents of a webpage."}
{"text": "Maintained Cross Browser compatibility & implement Responsive Web Design using Bootstrap."}
{"text": "Utilized JIRA for task assignment, bug tracking tool."}
{"text": "Developed the application using Backbone.js to perform operations on the server."}
{"text": "Built real-time application using backbone.js and web sockets via Socket.io. "}
{"text": "Designed and implemented backbone.js APIs (some handling 1,800 requests/second at peak), microservices, caching layers, and monitoring. "}
{"text": "Implemented real time encoding (backbone.js) of the uploaded files by users. "}
{"text": "Implemented backbone.js functions parallel execution with help of STEP library, which is an async control flow library built for backbone.js. "}
{"text": "Used Node Package Manager(NPM) as a package manager to install the necessaries packages and Grunt as a task runner to compile the SASS files into minified CSS files. "}
{"text": "Worked with the team, helping them build out their markup and CSS. My specialty is large scale CSS, focusing on reusability and modularity using preprocessors like SASS. "}
{"text": "Used CSSSprites to decrease the number of HTTP requests and load time of web pages. "}
{"text": "Involved in maintenance of web security and prevented cross-site scripting, SQL injectionattacks by using parameterized queries."}
{"text": "Used NodeJS to build Grunt tasks and build the project."}
{"text": "Used Tortoise SVN version control throughout the development."}
{"text": "Used Apache Tomcat as a web server for the project."}
{"text": "Tested and applied the branding on a step by step procedure using Jasmine."}
{"text": "Utilized Agile Methodology (Scrum) to manage full life-cycle development of the project and involved in daily SCRUM meetings to keep track of the ongoing project status and issues. "}
{"text": "Provided KT to new team members along with updating technical documents on day to day basis."}
{"text": ""}
{"text": "Environment:HTML5, XHTML, XML, AJAX, DOJO, Bootstrap, Redux.js, React.js, JSX, Babel, Node.js, SQL, Tortoise SVN, Sublime, JSP, JSON, CSS3, JavaScript, ECMAScript 5, Agile, Grunt, NPM, Jasmine, SASS, Backbone, C#, Microservices."}
{"text": ""}
{"text": "Client:  Maritz LLC, St Louis, MO"}
{"text": "Role: UI Developer\t\t\t\t\t\t\t\t\t           July’ 2011 – Oct’ 2013"}
{"text": ""}
{"text": "Maritz is a sales and marketing services company that designs and operates employee recognition and reward programs, sales channel incentive programs. It also plans corporate trade shows, meetings and events, and offers a customer experience technology platform."}
{"text": ""}
{"text": "Key Roles and Responsibilities:"}
{"text": "Worked in a team, which involved developing the UI, layout and front-end programming (HTML4) for web application that matches requirements of sprint. "}
{"text": "Followed MVC Architecture to develop the web applications."}
{"text": "Communicated with the BA and involved in feedback sessions to comprehend the requirements of the UI layout of the web application. "}
{"text": "Creating GUI designs and developing UI specifications for internet and intranet sites."}
{"text": "Developed non-functional HTML, CSS pages from the mock ups and involved in UI review with UI architect and Business Units. "}
{"text": "Transformed the Photoshop mockups into HTML and CSS pages"}
{"text": "Created the screens with table-less designs following W3C standards"}
{"text": "Successfully implemented the RESTful Web services Integration using XML and JSON."}
{"text": "Wrote JQuery scripts intended for basic animation and end user screen customization purposes"}
{"text": "Used jQuery to implement AJAX functions to establish data communication between server and browser and implemented RESTful web services using XML and JSON."}
{"text": "Involved in designing and developing the JSON, XML Objects with SQL"}
{"text": "Implemented browser-side element effects like Hide, Show, Event Handling and DOM manipulation with jQuery "}
{"text": "Developed database connection and SQL Queries to create dynamic content on web pages."}
{"text": "Developed code to call the web service/APIs to get the data and display it in the interface using jQuery/AJAX. "}
{"text": "Involved in designing CSS based page layouts which are cross-browser compatible on all the major browsers like Safari, Chrome, Firefox and IE"}
{"text": "Implemented custom validation controls with JavaScript validation controls"}
{"text": "Extensive development of UI using jQuery, Backbone.js, Bootstrap and JavaScript."}
{"text": "Worked with quality assurance group to give user enhanced experience and reduce the number of key strokes"}
{"text": "Developed fast loading images using Adobe Photoshop CS3."}
{"text": "Involved in meetings with the end-clients and discuss regarding developing custom UI Components that are cross browser compatible"}
{"text": "Used SVN version control repository for source code management"}
{"text": ""}
{"text": "Environment:HTML, CSS, Java/J2EE, JSP 2.1, JavaScript, Eclipse IDE, MS Office, Backbone.js, Adobe Photoshop, Oracle, Git, AJAX, Scrum, J Unit, log4j, Ant, Maven, Web Sphere Application Server, MVC Architecture"}
{"text": ""}
{"text": ""}
{"text": "Client: 1800 Registry, Las Vegas, NV"}
{"text": "Role: Web Developer\t\t\t\t\t\t\t\t May’ 2009 – June’ 2011"}
{"text": ""}
{"text": "The 1800 Registry website is a Wedding Event Planner. The project is designed for customers who want to marry and for vendors who supply wedding services like flowers, DJ, photography, invitations and stationary. The website is also capable of sending the invitations on-line, and a wedding website can be created and shared with friends, relatives and family members, depending on the information provided such as particular category, budget cost and some keywords."}
{"text": ""}
{"text": "Key Roles and Responsibilities:"}
{"text": "Communicated with BA’s to understand their business models and goals and help define strategy, content, and features. "}
{"text": "Responsible for creating the screens with table-less designs in accordance to W3C standards"}
{"text": "Designed mockups, GUI layouts by using HTML, XML, CSS and JavaScript, jQuery and AJAX. "}
{"text": "Used JavaScript libraries to create slider and page-turning animations on calendar widgets."}
{"text": "Effectively utilized JavaScript to ensure every functionality is working correctly and showing up a meaning message whenever required. "}
{"text": "Wrote code to fetch data from Web services using JQUERYAJAX via JSON response and updating the HTML pages."}
{"text": "Implemented design process upon client approval and built out all assets: buttons, products shots, UI components"}
{"text": "Participated in day-to-day meeting, status meeting, strong reporting and effective communication with project manager and developers."}
{"text": "Participated in bug thrashing sessions to discuss and resolve bugs that were reported in JIRA."}
{"text": "Creating cross-browser compatible and standards-compliant CSS-based page layouts. Involved in fixing Front-End issues with the layouts."}
{"text": "Used GIT as version control tool."}
{"text": "Provided KT to new team members."}
{"text": ""}
{"text": "Environment:HTML, CSS, JavaScript, JQuery, AJAX, RESTful, XML, JSON, GIT, Notepad++, Oracle, JIRA"}
{"text": ""}
{"text": "Bachelor of Technology in Information Technology, JNTU, India.\t"}
{"text": ""}
{"text": ""}