{"text": "Name: marie marie"}
{"text": "E-Mail: marie.marie@gmail.com"}
{"text": "Address: Bijie, China"}
{"text": "Github: https://github.com/marie"}
{"text": "LinkedIn: https://linkedin.com/marie"}
{"text": "Phone No. 362334223897"}
{"text": "Summary"}
{"text": "7+ years of experience as a Quality Assurance Analyst and Test Engineering in all phases of Manual and Automation Testing in Financial, Insurance, Retail, and Energy domains. "}
{"text": "Experience in Requirement Analysis, planning, design and execution of software Testing Activities and Quality Assurance activities of Windows Applications, Web Applications & Embedded software applications (Software & hardware Integration). "}
{"text": "Maintained and updated all documentation needed throughout the Cognos environment.  "}
{"text": "Coordinated with Project Managers, Development Team, Business Analysts, and End-Users for better quality testing. Worked closely with business team to understand the Requirement Document in creating Test Plan. "}
{"text": "Designed and built Test Cases, developed, maintained and troubleshot Test Scripts, coordinated with team members in debugging effort and assisted developers in Root Cause Analysis and clarified them the results. "}
{"text": "Created List reports, Charts and Cross-tab reports using Cognos Report Studio. . "}
{"text": "Performed Service Oriented Architecture SOA / Web Service testing using soap UI "}
{"text": "Created and implemented Automatic scripts for performing Functional, Regression, System, Integration testing. "}
{"text": "Expertise in Smoke/Sanity, Unit, Black Box, White Box, Gray Box, Selenium IDE, GUI, Usability, UAT, Alpha and Beta, Load, performance, Stress, Security testing. "}
{"text": "Highly skilled in implementation and execution of test using HP Mercury tools Quick Test Professional, Quality Center, LoadRunner, Test Director. "}
{"text": "Generated VBScripts, reusable actions, and libraries to automate and retest in QTP, used descriptive programming to reduce time maintaining object repositories. "}
{"text": "Good Expertise in creating complex SQL scripts for Data Validation, for complex business rules based on ETL mapping documents. "}
{"text": "Written the SQL scripts to validate ETLs developed by Ab Initio. "}
{"text": "Validated Ab Initio ETL mappings and transformations like joiner, update strategy and lookup. "}
{"text": "Worked on POC and created Cognos reports and Dashboards by using multiple datasources. "}
{"text": "Created and published packages in Cognos 11 using Framework Manager in various subject areas, using Data Source Query Subjects, Model Query Subjects.  "}
{"text": "Evidenced and recognized for high productivity, attention to detail and the ability to effectively engage and meet the needs of Business Requirements. "}
{"text": ""}
{"text": "Specialized in: "}
{"text": "Requirement Analysis, Planning and Monitoring the Traceability. "}
{"text": "Software Test Planning, Design and Execution (Manual Testing & Automation testing). "}
{"text": "Integration, Regression, Functional, and User Acceptance Testing. "}
{"text": "Business and Software Requirements Management. "}
{"text": "Software Configuration Management, Risk based Test Management "}
{"text": "Quality Assurance & Quality Control"}
{"text": ""}
{"text": "ETL/Cognos Tester"}
{"text": "United Airlines Chicago, IL\t\t\t\t\t\t\tMar 2016 – Dec 2017"}
{"text": "Description: Responsible for ensuring the quality for United Airlines mobile applications. Developing /updating test scripts/test cases to ensure the quality and efficiency. Developing and implementing quality-assurance and quality-control methodologies to ensure compliance with QA standards, federal regulations and customer specifications. Verifying application in mobile devices, including iPhone, iPad, Android, BlackBerry, Windows 7, and Windows 8 tablet. \n"}
{"text": "Responsibilities:  \n"}
{"text": "Participated in Sprint Planning meetings to identify the strategic features of the user stories and review the current sprint user stories. "}
{"text": "Participated in daily scrum meetings to address any blockers of testing and discuss the status of assigned tasks. "}
{"text": "Created and executed automated software test plans, cases and scripts to uncover, identify and document software problems and their causes. "}
{"text": "Created Executive level Dashboards in Cognos showing various high level key performance indicators. "}
{"text": "During this project tenure, I was involved in ETL Design, Build of Informatica codes, performed unit testing and data validations "}
{"text": "By using the data vault data modelling, I performed Extract Transform Load (ETL) operations "}
{"text": "Involved in developing the automation script for Mobile Native applications IOS, Android ."}
{"text": "Assured the quality of codes to fulfill the requirements and adhered to the ETL architecture."}
{"text": "During this project tenure, I was involved in ETL design, building of Informatica codes, performed unit testing and data validations. "}
{"text": "Prepared the estimates and tracked the development activities of the ETL phases. "}
{"text": "Worked on POC and created Cognos reports and Dashboards by using multiple datasources. "}
{"text": "Created and published packages in Cognos 11 using Framework Manager in various subject areas, using Data Source Query Subjects, Model Query Subjects. "}
{"text": "Developing and testing of Cognos BI Cubes in Transformer. "}
{"text": "Ensure the consistent execution of Regression testing methodology for company wide solutions at the offshore QA service provider, Ensuring on time release of system updates with mitigation. "}
{"text": "Environment: \nRational Quality manager, HP Quality Center, Windows, Cognos Report Studio, SQL Server, VB Script, MSSQL Server 2012, Java, .net framework, Load Runner9.1, Apache, IBM Cognos 11, Oracle 11g, VB script, PL/SQL, HTML, HP Quality Center 11/10.0, UML, AWS, Informatica Power Center 10.1, Word, Excel, PowerPoint, Outlook, MS Visio, MS Project, Windows 7, UNIX, LINUX, UBUNTU."}
{"text": ""}
{"text": ""}
{"text": "ETL Tester"}
{"text": "Amerigroup - Virginia Beach, VA \t\t\t\t\t\t\tApril 2014 – Feb 2016"}
{"text": "Amerigroup Corporation is a multi-state managed healthcare insurance company focused on serving people who receive healthcare benefits through publicly sponsored programs, including Medicaid, Medicare, State Children's Health Insurance Program (SCHIP), Family Care and Special Needs Plans (SNP). There were multiple ongoing projects at Amerigroup where multitasking was a key to success. Namely, Amerigroup was undergoing eligibility system conversion from the Legacy system to FACETS as well as collaborating with the third party to offer OTC benefit card for real-time healthcare transactions to its Medicare members. \n \nResponsibilities: \n"}
{"text": "Analyzed the objectives and scope of each stage of testing process from the Test plan. "}
{"text": "Interacted with business analysts to gather the requirements for business and performance testing. "}
{"text": "Prepared Test Plan and Test Cases in accordance with the Business Requirements. "}
{"text": "Performed Manual Testing to check on major functionality of AUT. "}
{"text": "Validated the Web Services (SOAP) both Request and Respond Messages. "}
{"text": "Involved in validating SOAP XML specifications as per the standards. "}
{"text": "Responsible for Unit testing, System Testing , Performance testing, Load and Stress testing, Security Testing, Usability Testing, Compatibility Testing, User Acceptance Testing, Smoke and Regression testing "}
{"text": "Organized and managed all phases of the software testing process, including planning tests, executing tests, and tracking defects. "}
{"text": "Involved in fixing the script issues and handling exceptions of the scripts using Rational functional tester "}
{"text": "Performed back-end testing using SQL queries on the Oracle database. "}
{"text": "Used SQL statements to check data integrity and data validation. "}
{"text": "Performed Sanity Testing and Smoke Testing of the application. "}
{"text": "Conducted GUI Testing and Regression Testing of the application using Rational Robot. Performed Regression, System and User Acceptance Testing using Rational Robot."}
{"text": "Performed Functionality testing using Rational Test Manager. "}
{"text": "Performed Security Testing in Rational Test Manager using Positive and Negative Testing to ensure appropriate user authentications "}
{"text": "Created List reports, Charts and Cross-tab reports using Cognos Report Studio."}
{"text": "Maintained and updated all documentation needed throughout the Cognos environment. "}
{"text": "Actively participated in enhancement meetings and was responsible for weekly status updates, troubleshoot new releases and production issues.  "}
{"text": "Created and performed testing strategy and test plans for any changes related to Cognos Reports. "}
{"text": "\nEnvironment: MSSQL Server 2012, Java, .net framework, Load Runner9.1, Apache, Oracle 11g, IBM Cognos, VB script, PL/SQL, HTML, Rational Quality manager, HP Quality Center 11/10.0, UML, Word, Excel, PowerPoint, Outlook, MS Visio, MS Project, Cognos Report Studio, Windows 7, UNIX, LINUX, UBUNTU."}
{"text": ""}
{"text": "Lead QA Tester"}
{"text": "ELC New York, NY\t\t\t\t\t\t                                            Jan 2013 – Mar 2014"}
{"text": "Lead 6 resources of QA team for successfully delivering eCommerce application with quality. Trained the existing new team on E-Commerce testing and made sure that they are able to handle the project without issues and received multiple accolades in leading & training team with in a short span of time. \n \nResponsibilities:"}
{"text": "Helped the existing team members to understand & leverage them to test eCommerce application. "}
{"text": "Migration from Perl gem to Drupal Framework "}
{"text": "Worked on different sites across the Globe and different brands including internationalization "}
{"text": "Performed Mobile application testing across different devices & OS versions. "}
{"text": "Performed cross-browser testing across different browsers "}
{"text": "Trained entry level and senior QEs on ecommerce testing "}
{"text": "Lead onsite/offshore teams assigning modules reviewing status everyday with the team and sending status report to business manager and project manager. "}
{"text": "Extracted Data from Teradata using Informatic Power Center ETL and DTS Packages to the target database including SQL Server and used the data for Reporting purposes. "}
{"text": "Performed cross browser testing for compatibility checks on IE, Firefox and Safari. "}
{"text": "Conducted various management activities by analyzing and verifying test results providing status reports and created detailed periodic status reports for senior management to keep them posted on the progress. "}
{"text": "Assisted for the business requirements, ETL Analysis, ETL test and design of the flow and the logic for the Data warehouse project."}
{"text": "Created ETL test data for all ETL mapping rules to test the functionality of the Data Stage Mapping. "}
{"text": "Preparation and execution of Test Plans, Test Cases for the mappings developed through the ETL Informatic tool in the Quality Centre. "}
{"text": "Used Agile testing methodology for achieving deadlines in UAT. "}
{"text": "Used different Modules in ALM like Dashboards, Management, Requirement, Testing and Defects. "}
{"text": "Prepared scripts, running tests, Analyzing results in Load Runner 9.1 for Performance testing. "}
{"text": "Environment: MSSQL Server 2012, Java, .net framework, Load Runner9.1, Apache, Oracle 11g, VB script, PL/SQL, HTML, HP Quality Center 11/10.0, UML, Word, Excel, PowerPoint, Outlook, Informatic Power Center, MS Visio, MS Project, Windows 7, UNIX, LINUX, UBUNTU."}
{"text": ""}
{"text": ""}
{"text": "Quality Analyst"}
{"text": "Park Avenue Health Care and Wellness Center, Pomona, CA\t\t  \t    Sep 2010 - Dec 2012"}
{"text": "Park avenue is a skilled nursing, rehabilitation and assisted living facility. It provides a broad range of integrated health care and related plans and services, and proven health and well-being programs that are targeted to the needs of customers, clients and partners. This tool was helpful to improve the patient experience and population health while reducing the per capita costs"}
{"text": "Responsibilities:"}
{"text": "Gathered BRD (Business Required Documents) from the BA and extensively communicated with the BA to come up with efficient test plans and test cases. "}
{"text": "Facilitated test plan/ case reviews with cross- functional team members. "}
{"text": "Tested the trade file extracts and request/ Response authorizations. "}
{"text": "Involved in tracking utilization management and cost over time by linking clinical events and professional charges to the patient's case. "}
{"text": "Coordinate work with teams in different time zones."}
{"text": "Worked on Business process design and re-engineering."}
{"text": "Expertise in Project Planning, Project Design, creating functional specifications and data flow diagrams."}
{"text": "Defect Reporting using Quality Center (QC) and MS Excel."}
{"text": "Involved in cross browser testing of the application."}
{"text": "Implements testing standards, guidelines and testing methodology as specified in the testing approach."}
{"text": "Used Version one tool to keep track of the User stories."}
{"text": "Strong relational database skills, worked on Oracle to do data mapping and data migration"}
{"text": "Environment: MSSQL Server 2012, Java, .net framework, Load Runner9.1, Apache, Oracle 11g, VB script, PL/SQL, HTML, HP Quality Center 11/10.0, UML, Word, Excel, PowerPoint, Outlook, MS Visio, MS Project, Windows 7, UNIX, LINUX, UBUNTU."}