{"text": "Name: sally sally"}
{"text": "E-Mail: sally.sally@gmail.com"}
{"text": "Address: Quanzhou, China"}
{"text": "Github: https://github.com/sally"}
{"text": "LinkedIn: https://linkedin.com/sally"}
{"text": "Phone No. 692229266160"}
{"text": "Summary:"}
{"text": "Over 6+years of  IT experience as Scrum Master and having expertise in conducting Backlog refinement, Sprint planning, Daily Scrum, and Sprint Review Meetings when using Agile Methodology. "}
{"text": "Hands on experience of writing and prioritizing User Stories in Backlog. "}
{"text": "Formulated and executed process flows and product backlog."}
{"text": "Successfully managed Backlogs, release scheduling, project duration estimation and forecasting. "}
{"text": "Thorough understanding of Software Development Life Cycle (SDLC) phases and specialized in employing different methodologies like Agile and Waterfall."}
{"text": "Successfully involved in transitioning the Organizational Structure and Business Processes from traditional Waterfall to Agile."}
{"text": "Rendered hands-on supervision and mentorship to a team which was entirely new to Agile Scrum methodology."}
{"text": "Experience working with team members for full-cycle projects, such as developers, to complete consulting projects on time, and deliver outstanding consulting services to salesforce.com clients. "}
{"text": "Successfully overcame the challenges of working with an off-shore scrum team for the first time."}
{"text": "Directed and lead development team from project initiation through delivery of final product."}
{"text": "Responsibilities include protecting development team from outside distractions, impediments or team conflicts, and maintain focus on product backlog and project timeline. "}
{"text": "Managed project scope to ensure delivery was compliant to scope commitment."}
{"text": "Successfully implemented changes to Business Processes, Systems and Technology, Job Roles and Organizational Structure. "}
{"text": "Facilitated tracking of Sprint and Release by using Burn-down charts."}
{"text": "Tracked and managed product backlog, burn-down metrics, velocity, and task break-down."}
{"text": "Strong experience in working with agile lifecycle, and/or tracking, and process management tools like Rally and JIRA."}
{"text": "Provided technical support for Sprint Cycles and testing with Rally tool."}
{"text": "Extensively used Rally for maintaining User Story Hierarchy, Backlog Grooming, Updating Tasks, Connecting Rally with JIRA and Quality Centre, Planning Iterations and Releases "}
{"text": "Prepared and led bi-weekly “Iteration Planning Meetings” (IPMs) as part of the agile development process, and lead software demos to client."}
{"text": "Extensive experience in user requirements gathering, Brain storming sessions and analysis."}
{"text": "Excellent interpersonal, collaboration, and problem solving skills combined with excellent written and verbal communication skills."}
{"text": "Helping the team to maintain their Scrum tools (Story board, Action board, charts, backlogs, etc.)."}
{"text": "Addressed problems through risk management and contingency planning."}
{"text": "Coordinated with various departments and ensured delivery of projects on time. "}
{"text": "Improved the team's engineering practices and tools as required. Fully facilitated productivity, and make sure teams have the tools and know-how they need to succeed. "}
{"text": "Demonstrated experience and ability to write detailed Business Requirements Document (BRD), Use Case Specifications, Functional Specifications (FRD); and work within tight deadlines. "}
{"text": "Held responsibilities included Initiating; Planning; managing matrixes resources; Monitoring development, testing, and implementation; Change management; and Defect management.  "}
{"text": "Oversaw the Social Media vendor for social media integration. Established the vendor milestones and integration plan of deliverables into the main redesign project. "}
{"text": "Radiated information and ensured the team's progress and successes are highly visible to all stakeholders, including the team itself. "}
{"text": "Facilitated creativity and empowerment for the Cross functional development team."}
{"text": "Created and documented deliverables and documents such as: requirements definitions, functional specifications, hosting and maintenance agreements, RFPs, presentations, engagement contracts, strategy decks, gap analysis, project plans, budgets, schedules, risk assessments, style guides, creative briefs, site maps, storyboards and wire-frames, user manuals, online marketing plans and project post-mortems. "}
{"text": ""}
{"text": "Technical Skills:"}
{"text": "Process Management Tools: Rally, JIRA, MS Project, MS Visio"}
{"text": "Tools: MS office, MS Visio, Quality Center, Rational Rose for UML"}
{"text": "Programming Languages:  C++, Java, HTML"}
{"text": "Operating System: Windows 2000, 2003, Windows 7"}
{"text": "Database: SQL, MySQL "}
{"text": ""}
{"text": "Professional Experience: "}
{"text": ""}
{"text": "Capital One, Capital one, McLean, VA\t\t\t\t\t\t        Oct 2018- Jan 2020"}
{"text": "Scrum Master/ Business Analyst"}
{"text": "Responsibilities:"}
{"text": "Interacted with various business team members to gather the requirements and documented the requirements. "}
{"text": "Established Scrum environment for the call recording project team, thereby, fostering an agile implementation environment where value is delivered to customers quickly "}
{"text": "Developed relevant metrics to measure Scrum team performance for use by all enterprise telephony teams, leading to a better understanding of process improvements and reduction of lead and cycle times "}
{"text": "Salesforce.com Configuration and Design of Service Cloud, Sales Cloud and Force.com solutions, with an emphasis on Service Cloud solutions. "}
{"text": "Evangelize, educate, and influence others in the benefits and use of Scrum"}
{"text": "Managed team providing end-to-end support during the deployment to customized version of Salesforce.com and its integration with the legacy CRM system.  "}
{"text": "Ensure the occurrence and value of Scrum ceremonies such as daily stand-up, mid-sprint review, backlog refining, demo/review, planning, and retrospective "}
{"text": "Experience with Salesforce data tools such as Data Loader and Eclipse Force.com IDE for data migration. "}
{"text": "Supported data migration team in executing, managing and monitoring regular data loads in the Salesforce production instance. "}
{"text": "Provide performance reporting and analysis to product/program leadership after each iteration (sprint), creating a superior level of transparency and understanding of progress  "}
{"text": "Integrated the Web Services for extracting the data from external systems to display in the pages of Salesforce.com. "}
{"text": "Implemented Standard and Custom Apex Controllers to handle business logic and used debug logs to trace the execution. "}
{"text": "Designed and deployed dynamic workflows, validation rules, Approval Processes and Auto-Response Rules for automating business logic."}
{"text": "Support the UAT team during their testing. "}
{"text": "Liaise with business operations to develop strategy and drive implementation of new intent and business as usual changes for call recording platforms"}
{"text": ""}
{"text": "Walmart, Bentonville, AR\t\t\t\t                                       Jan 2017 – Sept 2018"}
{"text": "Scrum Master/ Business Analyst\nResponsibilities:"}
{"text": "Documented Requirement Traceability Matrix (RTM) for traceability of requirements and responsible for end to end traceability."}
{"text": "Facilitate scrum ceremonies including daily scrum, sprint planning, sprint review, backlog grooming and Reports. "}
{"text": "Mentored and groomed globally distributed team members on agile methodologies and techniques to ensure they attain agile maturity. "}
{"text": "Responsible for Bug free delivery of Sales and Service Oriented applications developed on (Salesforce.com) Force.com Platform."}
{"text": "Guided Product Owners with backlog creation and monitored the creation and maintenance of user stories in JIRA to ensure completeness. "}
{"text": "Monitored progress for sprints and anticipated/ intervened on impediments to the scrum team. "}
{"text": "Continuous and comprehensive communication with IT, Business and Management and ramping them up on the process change since moving to the Agile Release Train. "}
{"text": "Maintained JIRA dashboards including agile metrics like burn down charts for reports for program manager and business teams "}
{"text": "Involved with the QA team to conceptualize, determine and develop test approaches and methods for unit testing, integration and functional testing, load and usability testing according to the application complexity and test requirements. "}
{"text": "Experience in Creating and editing Users, Accounts in Salesforce."}
{"text": "Evaluated and suggested changes to agile practices to progressively improve team output. "}
{"text": "Collated data and metrics for Inspect and Adapt purposes "}
{"text": "Worked with business and PO team to educate and help them navigate the Agile transition."}
{"text": "Extensive business knowledge and customization experience on various salesforce.com standard objects like Accounts, Contacts, Opportunities, Products and Price books, Cases, Leads, Campaigns, Forecasting, Reports and Dashboards."}
{"text": "Liaise with project managers of dependent projects and QA, Dev and Release management teams to set expectations for delivery and timelines and enable iterative release planning."}
{"text": "Responsible for reporting of project progress to Application Dev and Program Managers."}
{"text": "Negotiate with multiple vendors on resourcing needs and staffing plans. "}
{"text": "Co-ordinate and managed dependencies with other scrum teams in the release train for identification and preemptive resolution of conflicts and risks. "}
{"text": "Represent the teams in supplier workshops conducted by business team and set expectations with internal and external stakeholders."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Cisco Systems Inc., San Jose, CA\t\t\t\t\t                    Mar 2015 – Dec 2016"}
{"text": "Scrum Master\nResponsibilities: "}
{"text": "Introduce and implement best practices for impediment management across scrum teams and leadership team to identify risks and dependencies at feature level that resulted in risk reduction by 20%. "}
{"text": "Work with globally distributed cross-functional teams, effectively communicating scope, timeline, risks and priorities in order to keep them informed, engaged, motivated and focused on delivery. "}
{"text": "Create effective, informed and highly motivated teams focused on delivery transformed in improved productivity, release progress and team velocity by 10%. "}
{"text": "Facilitate high quality, high impact scrum ceremonies including: Agile commit, production deployment, planning, retrospective, agile estimation and grooming sessions to become a self-organizing / self-managing unit. "}
{"text": "Identify risks, highlight the impact and probability, and define owner and mitigation strategy, monitor and track progress, including the resolution of escalated project issues. "}
{"text": "Report various metrics like Velocity metrics, Burn-down charts, burn-up, Defect tracking etc. "}
{"text": "Ability to quickly adapt to shifting priorities, demands, and timelines through analytical and problem-solving capabilities "}
{"text": ""}
{"text": "Mercury Insurance Group, Brea, CA                                                                                Nov 2013 – Feb 2015\nBusiness Analyst"}
{"text": "Responsibilities:"}
{"text": "Creating the project plan and identifying milestones, activities, tasks and resources to be allocated for each activity. "}
{"text": "Responsible for gathering requirements for the clients and creating the document after gathering the requirements. "}
{"text": "Worked extensively in organizing, scheduling and facilitating meetings between the key members of the project, which included the project manager, IT team, Business team as well as the clients and other stake holders"}
{"text": "Coordinated the conversion of the legacy system into the new system and documenting this conversion along with the developers. "}
{"text": "Responsible for creating the cutover plan and making sure that the project is on track and all the related tasks are completed in time. "}
{"text": "Assisted the conversion team in the unit test as well as the system test. "}
{"text": "Provided weekly updates to the key stakeholders, project manager and IT Lead by creating JAD sessions and facilitating these sessions. "}
{"text": "Worked with teams dispersed across a large geographical area, identified, and presented their requirements to the team.  "}
{"text": "Collaborated with the Project Manager, Product Owners and Business users to scope out the project objectives and determine impact and timeline of various deliverables."}
{"text": "Worked on developing requirements through active co-ordination and JAD (Joint Application Development) sessions and developed use case scenarios and diagrams."}
{"text": "Gathered and analyzed Reporting requirements and formulated Business Rules for Net Premiums, Investment Income and other financial parameters for the Property & Casualty Personal Line Business as part of the Data Warehouse Initiative with Business Objects as the front end reporting tool."}
{"text": "Concentrated on implementing Guidewire batch integration in replacing the existing NextGen legacy functionalities like NY VIN Reconciliation screen"}
{"text": "Involved in business calls for Data conversion, between Guidewire policy center and NY DMV EDI X12 files"}
{"text": "Defined Acceptance Criteria and collaborated with the team to define staggered defect criticality levels."}
{"text": "Actively worked with the Business Users in the UAT phase by helping them build test scenarios and resolving any anomalies in the results of the reporting elements."}
{"text": "Recommended a reporting solution in the Oracle Data Warehouse that would minimize the impact on the system from evolving business needs."}
{"text": "Documented technical requirements starting from project initiation to completion."}
{"text": "Documented project details using Microsoft Project to develop and maintain a Work Breakdown Structure (WBS)."}
{"text": "Defined Product Model Requirements for Private Passenger Auto, Homeowners, and Commercial Auto. "}
{"text": "Identified high Gaps between functionalities of current system and Guidewire."}
{"text": "Identified system requirement for integration with Guidewire System."}
{"text": "Documented Business processes and data flow using Process Flow and Data Flow diagrams in Microsoft Visio and PowerPoint presentations."}
{"text": ""}
{"text": ""}