{"text": "Name: mary mary"}
{"text": "E-Mail: mary.mary@gmail.com"}
{"text": "Address: Miami, United States"}
{"text": "Github: https://github.com/mary"}
{"text": "LinkedIn: https://linkedin.com/mary"}
{"text": "Phone No. 927797787881"}
{"text": "Professional Summary"}
{"text": "6 years of experience in design, development, implementation of python, Django and client-server technologies based applications. "}
{"text": "Extensively followed development methodologies such as Agile (SCRUM), Water Fall. "}
{"text": "Experienced in web UI design and interface development using HTML, DHTML, CSS, Bootstrap, JavaScript, JQuery, AngularJS, AJAX and JSON. "}
{"text": "Expertise working on all aspects of web development, from the front end, data access layer, business logic layer, service layer and to the database backend."}
{"text": "Good experience using various Python libraries to speed up development (libraries used: Beautiful Soup, SciPy, Matplotlib, Python-twitter, Pandas data frame, network, urllib2, MySQL dB for database connectivity, JSON libraries)."}
{"text": "Experienced with ORM's such as Django ORM and SQLAlchemy, database design and normalization. "}
{"text": "Experienced in using MVC/MVT architecture using RESTful, Soap Web services and high-level Python Web frameworks like Django and Flask. "}
{"text": "Experience in object-oriented programming (OOP) concepts using Python, C++, Java."}
{"text": "Understanding of Hadoop Ecosystem. "}
{"text": "Experienced on AJAX to transform datasets and tables into HTTP serializable JSON strings."}
{"text": "Used RESTful and Flask framework and Web programming that allow user to utilize the CURD functionality on the site."}
{"text": "Worked with Business Analysts to identify the appropriate data elements for required capabilities."}
{"text": "Worked on various Integrated Development Environments like PyCharm, Sublime Text, Spyder, Eclipse, NetBeans, Visual Code, Visual Studio 2013, 2017 and PyScripter. "}
{"text": "Strong RDBMS concepts and Extensive experience in Database Design, building Triggers, Complex Queries, Views, Indexes, Store Procedure, joins etc."}
{"text": "Good Knowledge of Core Java concepts like OOPS, Multithreading, Garbage Collections, and Collection etc."}
{"text": "Experienced in working with different operating systems Windows, Linux, Ubuntu and UNIX. "}
{"text": "Excellent Knowledge on Python Collections, Multi-Threading, Exceptional Handling, Inheritance etc."}
{"text": "Followed the best practice of Python such as PEP-8. "}
{"text": "Excellent Experience of Databases such as MySQL, Oracle 9i/10g/11g, Microsoft SQL Server, PostgreSQL. "}
{"text": "Experience in project deployment using Heroku/Jenkins and using web services like AWS EC2 and AWS S3."}
{"text": "Familiar with Design Pattern like MVC, MVP, Repository, Dependency Injection, Singleton, Strategy, Factory, Abstract Factory, Decorator, Proxy and Observer pattern."}
{"text": "Experience in designing Use Cases, Class diagrams, Sequence and Collaboration diagrams."}
{"text": "Good knowledge in maintaining various version controls system such as Apache Subversion (SVN) and Git."}
{"text": "Excellent team player, very dynamic, flexible with positive attitude and excellent learning skills."}
{"text": ""}
{"text": "\tWilling to relocate: Anywhere."}
{"text": "\tAuthorized to work in the US for any employer."}
{"text": ""}
{"text": ""}
{"text": "Technical Skills"}
{"text": "Employment History"}
{"text": ""}
{"text": "Erie Insurance, Erie, PA                          \t\t\t\t\t\t          August 2016 - Present"}
{"text": "Role: Python Developer"}
{"text": "Erie Insurance is the leading insurance providing company for Home, Business, Life and Auto. The project was to enhance the web based system and add more functionality to the existing system. The UI enhancement and further development was done in earlier phase and later carried out with web enabled middleware development."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Design and development of user interfaces and client displays using Java Script, JSP, CSS and troubleshoot various issues in Python code and fix them."}
{"text": "Built various graphs for business decision making using Python matplotlib library."}
{"text": "Wrote Python scripts to parse XML, JSON data and load the data in database. "}
{"text": "Developed automated scripts using Python, Shell Scripting for data collection and transfer to databases. "}
{"text": "Involved in integration of application like bill payment and insurance claim."}
{"text": "Designed the front end of the application using Python, HTML, CSS, AJAX and JQuery. "}
{"text": "Worked on backend of the application, mainly using Active Records. "}
{"text": "Used AngularJS to bind different modules & Implemented MVC collaboratively with AngularJS for separation of UI, data, logic concerns."}
{"text": "Involved in development of application that parses information from logs and provides analysis of data by mapping to information in database to provide analysis for proactive monitoring and alerts. "}
{"text": "Developed and tested many features for dashboard using Python, Bootstrap, CSS, and JavaScript. "}
{"text": "Experience with various frameworks of JavaScript like BackboneJS, AngularJS, EmberJS etc. "}
{"text": "Involved in Configuring various big data workflows to run on top of Hadoop and these workflows comprise of heterogeneous jobs like Pig, Hive and MapReduce. "}
{"text": "Used Git and JIRA for code submissions and review process."}
{"text": "Managed code versioning with GitHub and deployment to staging and production servers."}
{"text": "Involved in designing search application system requirements and coded back-end and front-end in Django/Python. "}
{"text": "Improved security using Authentication and Authorization."}
{"text": "Involved in enhancement existing automated solutions, such as the Inquiry Tool added new features and fixed bugs."}
{"text": "Actively involved in analysis of the system requirements specifications and involved in client interaction during requirements specifications."}
{"text": "Involved in writing automation scripts using Selenium to test the functionality of the web pages."}
{"text": "Involved in the performance tuning of the application on client side."}
{"text": "Created Views and developed Stored Procedures, Functions and Triggers."}
{"text": "Involved in documentation."}
{"text": "Experience reading C++ code, understanding it and debugging the C++ code."}
{"text": "Recorded the online users' data using Python Django forms and implemented test case using Pytest."}
{"text": "Extensively used JavaScript and JQuery to implement client-side validation."}
{"text": "Involved in Unit testing, Integration Testing."}
{"text": "Environment: Python, Django, C++, Java, MySQL, Oracle, Linux, Eclipse, HTML5, CSS, AJAX, XML, JavaScript, AngularJS, JSON, JQuery, Bootstrap, Linux, PyCharm."}
{"text": ""}
{"text": ""}
{"text": "Bluestem Brands, Minneapolis, MN\t\t\t\t\t\t\t           May 2015 – July 2016                  "}
{"text": "Role: Python Developer"}
{"text": "Bluestem Brands, Inc., is the parent company to 13 dynamic eCommerce retail brands. This exciting company offers a unique mix of retail and payment options for a diverse range of customers with a wide range of financial needs. The innovative solutions enabled automated processing of pre-sales, point-of-sale execution of applications, post-sale support, consumer reporting and delivery management."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible for gathering requirements, system analysis, design, development, testing and deployment.  "}
{"text": "Involved in building database Model, APIs and Views utilizing Python, in order to build an interactive web based solution."}
{"text": "Created User Controls and simple animations using Java Script and Python."}
{"text": "Redesigned existing task management systems using Python."}
{"text": "Worked on UI using HTML5, CSS3 and Java Scripts. "}
{"text": "Designed and implemented Model-View-View Model pattern for many components in the project (Contracts, Products, Search Sales, Employees, BackOffice Admin)."}
{"text": "Developed tools using Python, Shell scripting, XML to automate some of the menial tasks."}
{"text": "Interfacing with supervisors, artists, systems administrators and production to ensure production deadlines are met. "}
{"text": "Developed Most of frontend and backend modules using Python on Django Web Framework."}
{"text": "Developed Business Logic using Python on Django Web Framework."}
{"text": "Involve in adding support for Amazon AWS S3 to host static/media files and the database into Amazon Cloud."}
{"text": "Used JQuery and AJAX calls for transmitting JSON data objects between frontend and controllers. "}
{"text": "Used JQuery for selecting particular DOM elements when parsing HTML."}
{"text": "Used GitHub for version control. "}
{"text": "Worked on Restful API's to access the third-party data for the internal analysis and statistical representation of data. "}
{"text": "Utilized PyUnit, the Python unit test framework, for all Python applications."}
{"text": "Developed SQL Queries, Stored Procedures, and Triggers Using Oracle, SQL, PL/SQL. "}
{"text": "Involved in Unit Testing and Integration Testing for quality assurance purpose."}
{"text": "Involved in documentation."}
{"text": "Implemented page level error handling using custom Error pages and Error logs. "}
{"text": "Environment: Python, Django, PHP, C++, HTML5, CSS3, JQuery, AJAX, XHTML, Bootstrap, AWS, JavaScript, XML, GitHub, Flash, SQLite, MySQL, SQL, PLSQL, Oracle and Windows."}
{"text": ""}
{"text": ""}
{"text": "SunTrust Bank, Atlanta, GA \t\t\t\t\t\t\t\t           Jan 2014 – April 2015"}
{"text": "Role: Python Developer"}
{"text": "SunTrust Banks, Inc. is nation’s largest financial services companies. Primary banking responsibilities include deposits, lending, credit cards, as well as trust and investment services. The task was to update and re-engineered the online banking system and business process as per the changing business environment. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Participate in requirement gathering and analysis phase of the project in documenting the business requirements by conducting workshops/meetings with various business users."}
{"text": "Worked with team of developers on Python applications for RISK management."}
{"text": "Developed Python application for Google Analytics aggregation and reporting."}
{"text": "Worked on Python Open stack API's."}
{"text": "Involved in writing Python scripts to update content in the database and manipulate files."}
{"text": "Developed RESTful API web services for sending and receiving data from multiple application."}
{"text": "Processing of collected data using Python Pandas and NumPy packages for statistical analysis."}
{"text": "Used Python REGEX to match and find data."}
{"text": "Worked on front end frame works like CSS, Bootstrap for development of Web application. "}
{"text": "Engaged in Design, Development, Deployment, Testing and Implementation. "}
{"text": "Added several options to the application to choose algorithm for data and address generation. "}
{"text": "Designed the Layout page for the whole application to act as a template for each View. "}
{"text": "Implemented AJAX for dynamic functionality of a webpages for front end applications."}
{"text": "Used Bootstrap to improve the responsiveness of webpage and designed with custom CSS3 style sheet on elements.  "}
{"text": "Wrote and executed various MySQL database queries from Python using Python-MySQL connector and MySQL db package."}
{"text": "Developed views and templates with Python and Django's view controller and templating language to create a user-friendly interface using MVC architecture."}
{"text": "Associated with working cloud computing platforms like open stack."}
{"text": "Involved extensively in developing the client-side validations using JavaScript and JQuery. "}
{"text": "Maintained the versions using Git and sending the release notes for each release."}
{"text": "Involved in creating Store Procedure and trigger using Transact-SQL for the Database."}
{"text": "Engaged in Design, Development, Deployment, Testing and Implementation. "}
{"text": "Responsible for debugging the project monitored on JIRA."}
{"text": "Involved in code refactoring, optimizing the code to improve performance of the application."}
{"text": "Used Agile Methodology and SCRUM Process."}
{"text": "Involved in bug fixing and support during each release."}
{"text": "Environment: Python 2.7, PyQuery, MVW, HTML5, CSS, JavaScript, JQuery, JSON, Apache Web Server, SQL, UNIX, Windows, and Python libraries."}
{"text": ""}
{"text": ""}
{"text": "Nihar Info Global Limited, Telangana, India\t\t\t\t     \t           Dec 2010 – May 2012"}
{"text": "Role: Python Developer"}
{"text": "Nihar Info Global Limited is leading Software Company besides that has been working to build custom software, ecommerce application according to the need of client. The project was to build web application for small cooperatives and financial services that can manage accounts, inventory, branches and clients."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in the design, development and testing phases of application using Agile methodology."}
{"text": "Responsible for creating use case outline, activity flow diagrams and object/class diagrams in the initial phase.  "}
{"text": "Developed most of frontend and backend modules using Python on Django Web Framework. "}
{"text": "Wrote several PL/SQL procedures and SQL queries to retrieve data from database."}
{"text": "Experience with Core java with strong understanding and working knowledge of Object Oriented Concepts (OOPS) like Collections, Multi-threading, Exception Handling, Reflection."}
{"text": "Established JDBC connections for data retrieval and update."}
{"text": "Designed the front end of the application using Python, HTML, CSS, AJAX, JSON and JQuery. "}
{"text": "Implemented and tested Python based web applications interacting with MySQL"}
{"text": "Developed and designed an API (RESTful Web Service). "}
{"text": "Involved in writing MapReduce code to make un-structured data into semi- structured data and loaded into Hive tables. "}
{"text": "Implemented code in Python to retrieve and manipulate data."}
{"text": "Composed Python scripts to parse XML and JSON reports and load the information in database."}
{"text": "Used Git for version control. "}
{"text": "Used Django configuration to manage URLs and application parameters."}
{"text": "Used Bootstrap as a mechanism to manage and organize the html page layout. "}
{"text": "Collaborate with key stakeholders and project managers to design, develop, integrate, test, document and implement the system."}
{"text": "Used PyChecker for testing code."}
{"text": "Tracking defects and resolving bugs using JIRA."}
{"text": "Involved in doing Agile (SCRUM) practices and planning of sprint attending daily Agile (SCRUM) meetings and SPRINT retrospective meetings to produce quality deliverables within time."}
{"text": "Environment: Python, Java, Django, PyUnit, XML, MS Visio, MS Project, JIRA, Apache, Git, UML, SQL, PL/SQL, Windows and Linux, AJAX, HTML5, CSS3, JavaScript, JQuery."}
{"text": ""}
{"text": "CMC Ltd, Hyderabad, India\t\t\t\t                                                           \t        Oct 2009 – Nov 2010"}
{"text": "Role: Python Developer"}
{"text": "CMC Limited is a leading system engineering and integration company in India, offering application design, development, testing services and asset-based solutions. The project was to upgrade web application for Healthcare automates and simplifies all the performance management processes, including competency assessments."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Participate in requirement gathering and analysis phase of the project. "}
{"text": "Implemented Business logic using Python."}
{"text": "Performed design, involved in code reviews and wrote unit tests in Python.  "}
{"text": "Wrote various MySQL database queries from Python using Python-MySQL connector."}
{"text": "Involved in development of Web Services for sending to getting data from the external interface in the XML format."}
{"text": "Worked on development of SQL and stored procedures on MySQL."}
{"text": "Used Python scripts to update content in the database and manipulate files."}
{"text": "Generated Python Django Forms to record data of online users. "}
{"text": "Used Git for version control. "}
{"text": "Used Pandas library for statistical Analysis. "}
{"text": "Used JIRA for tracking and Updating Project issue."}
{"text": "Performed troubleshooting, fixed and deployed many Python bug fixes of the two main applications that were a main source of data for both customers and internal customer service team."}
{"text": "Environment: Windows 7, Python, Python libraries, Django, JIRA, XML, JavaScript, JSON, MySQL."}
{"text": ""}
{"text": "Education"}
{"text": "Master of Technology, RGPV University, INDIA."}
{"text": ""}