{"text": "Name: margaret margaret"}
{"text": "E-Mail: margaret.margaret@gmail.com"}
{"text": "Address: Wuxi, China"}
{"text": "Github: https://github.com/margaret"}
{"text": "LinkedIn: https://linkedin.com/margaret"}
{"text": "Phone No. 835426774358"}
{"text": "SUMMARY"}
{"text": "Expertise in Project Planning, Project Design, creating functional specifications and data flow diagrams."}
{"text": "Expertise in translating user requirements into technical specifications and mapping the process design, work flows for SDLC with documenting and managing business requirements using waterfall and Agile methodology."}
{"text": "Rich experience in gathering (user) functional requirements using various requirements modeling and UML tools including Rational Rose, Rational clear case and MS Visio."}
{"text": "Possess excellent organizational, interpersonal, communication and documentation skills with good process management skills along with a remarkable ability to gather requirements to bring out quality product."}
{"text": "Strong financial product knowledge of Capital Markets, IPO, Fixed Income Securities, Fixed income derivatives such as swaps and Equity Markets."}
{"text": "Hands on experience in creating Test Plan and Test Cases using ALM based on the system/functional requirements"}
{"text": "Defining change control processes, risk management, Assets Management, wealth management, cash management processes."}
{"text": "Worked closely with Corporate Finance and Treasury to institute new wire transfer procedures and new expense and clearing accounts"}
{"text": "Possess strong analytical and problem solving skills with the ability to adapt to a new environment and meet stringent deadlines."}
{"text": "Experience in automation testing using industry standard testing tools HP ALM / Quality Center"}
{"text": "Ability to successfully manage multiple deadlines and multiple projects effectively through a combination of business and technical skills."}
{"text": "Facilitated JAD sessions with the management, vendors, users and other stakeholders for open and pending issues to develop specifications."}
{"text": "Professional expertise in MS Office, MS Access and MS Project."}
{"text": "Analyzed Enhancement requests and Modification requests."}
{"text": "Maintained the Requirements Traceability Matrix (RTM)."}
{"text": "Highly motivated worthy team player capable enough to work and lead within a team environment besides being capable to work independently."}
{"text": "Maintenance of Test Matrix and Traceability Matrix."}
{"text": "Analyzed Business requirement."}
{"text": "Experienced as a Business Analyst in a role of responsibility encompassing Requirement Gathering, Decomposition and Analysis besides Quality Assurance."}
{"text": "Ability to identify and document critical requirements through analysis."}
{"text": "Conducted User Acceptance Testing (UAT) after going through regression testing."}
{"text": "Strong business analysis skills and thorough understanding of software development life cycle."}
{"text": "Strong ability to understand and document critical data through effective data collection, data analysis and data."}
{"text": ""}
{"text": "TECHNICAL SKILLS"}
{"text": "Methodologies:\t\t\tScrum, Agile, Waterfall"}
{"text": "Testing tools: \t\t\t\tHP Quality Center, ALM"}
{"text": "Change Management Tools:\t\tRational Clear Quest"}
{"text": "Office Tools:  \t\t\t\tMS Project, MS Word, Excel, PowerPoint"}
{"text": "Operating Systems:\t\t\tUNIX, Windows 7/8/10"}
{"text": "Business Modeling Tools:\t\tMicrosoft Visio, PowerPoint"}
{"text": "Database:\t\t\t\tMS SQL Server, Oracle"}
{"text": "Business Modeling Tools:                 \tMicrosoft Visio, Rational Rose"}
{"text": ""}
{"text": "EXPERIENCE"}
{"text": "Motion Picture Industry Pension & Healthplans, Studio City, CA\t                                                    "}
{"text": "Sept 2015- Present"}
{"text": "Business Analyst"}
{"text": "MPI is in the process of currently upgrading QNXT 5.1 to 5.4 at the same time working on implementation of the CTP tool for this project in order to automate their claims and have the ability to generate reports within CTP to follow best practices and procedures to meet specific claims based on entered selection criteria on a much faster pace with large volume of claims as needed on demand. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Job operated within a very agile environment, employing 2-4 week sprints, and daily scrum meetings."}
{"text": "Created UAT test scenarios, cases and scripts and Verify readiness of UAT environments/necessary interfaces. "}
{"text": "Conducted JAD sessions to allow different stakeholders to communicate their perspectives with each other, resolve any issues and come to an agreement quickly."}
{"text": "Extensively used SQL to retrieve, and manipulate data in the database"}
{"text": "Use SQL to select the accounts with certain characteristics and to track the volumes with each processed file for a time period to create volume and functionality graphs."}
{"text": "Developed various specification documents like Use Case specification Document, by interviewing various users. "}
{"text": "Dealt with Claims Processing, Utilization Management and QNXT Workflow."}
{"text": "Used Rational Rose software to develop Use Case diagrams, Activity Diagrams and Sequence Diagrams. "}
{"text": "Drafted and analyzed various project artifacts and deliverables. Also created various checklists so as to keep checkpoints for the project. "}
{"text": "Documented the “AS-IS” Business Workflows adhering to UML standards and conducted JAD sessions to define requirements and finalize the Functional Requirement Document (FRD)."}
{"text": "Designed and developed Use Cases, Activity Diagrams, Sequence Diagrams, OOD (Object oriented Design) using UML and Visio."}
{"text": "Developed epics and drives the functional elaboration & decomposition into user-stories and tasks"}
{"text": "Supported the product owner and scrum master in mapping the dependency and sequencing of backlog grooming."}
{"text": "Built process maps, processes, data models, workflows, class diagrams, decision tools, state diagrams, entity-relationships, use-cases and other requirements/design aids for complex user-machine and machine-machine interactions."}
{"text": "Built wireframes, prototypes or actual product screens “live” during the requirements gathering workshops"}
{"text": "Interfaced with team leaders, identify and analyze the given information, procedures and decision flows, evaluated existing procedures, methods and technical documentation and communicated with executives, managers and other stakeholders regarding project scope."}
{"text": "Played a key role in the daily scrum call, representing business logic behind the technology conversion with added business functionalities."}
{"text": "Responsible for business process analysis that includes requirements facilitation, definition & analysis, alternatives, software selection, prototyping, business process design."}
{"text": "Created graphical representation of business process and data flow using MS Visio. "}
{"text": "Mapped high-level to-be designs using Business Process Modeling Notation (BPMN) on MS Visio. "}
{"text": "Used MS Word & MS Visio to document data flow of the AS IS process and TO BE process."}
{"text": "Environment: Agile( Scrum), QNXT, UML with Microsoft Outlook, Microsoft Office, Microsoft Visio, MS Project, MS Word, Excel and MS Visio."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Sure West Communications, Roseville, CA \t\t                                                                 "}
{"text": "Jan 2014- Aug 2015"}
{"text": "Business Analyst"}
{"text": "With over 90 years of quality service within the Northern California area, SureWest Communications and its family of companies have provided an integrated network of highly reliable advanced communications products and services such as Digital Cable TV, Fiber Optics, PCS wireless, DSL, High-speed Internet Access, Data transport, and Local and long distance Telephone service with the highest standards within the Northern California and surrounding districts. I was involved in the Exodys project that was initiated to upgrade and implement SureWest internal and external provisioning system architecture and applications aimed to deliver the best service possible to SureWest customers while increasing quality, production, revenues and maintainability."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Defined and documented the vision and scope of the project."}
{"text": "Elicit requirements using Interviewing skills by talking with individuals and groups about their needs and ask the right questions to surface and extract essential requirements."}
{"text": "Actively involved in validating the requirements and applying the agile framework throughout the SDLC"}
{"text": "Assembled business requirement documents (BRD) and the technical specifications as per user requirements."}
{"text": "Led in Joint Application Development (JAD) and Rapid Application Development (RAD) sessions for communicating and managing expectations."}
{"text": "Facilitated the Customer in defining the high-level Functional Requirements and needs."}
{"text": "Gathered the Requirements, developed Process Model and detailed Business Policies and modified the business requirement, system requirement and system design documents with narratives and flow charts."}
{"text": "Designed and analyzed provisioning system, process and product improvements and routing rules with different application. "}
{"text": "Created sequence diagrams and workflow process diagrams for the business, system and component provisioning architecture. "}
{"text": "Prepared, reviewed and validated Business Requirement Documents and the Technical Specifications. "}
{"text": "Worked on creating technical documents and led Power Point/Visio presentations for different internal and external applications within the provisioning architecture."}
{"text": "Interacting with other teams through walkthroughs, teleconferences, meetings, etc. to resolve various outstanding issues.   "}
{"text": "Participated in weekly meeting and discussed modification request with management team."}
{"text": "Functioned as the primary liaison between the business line, operations, and the technical areas throughout the main phases of the project cycle."}
{"text": "Followed the UML based methods by using Visio to create Use Cases, Activity Diagrams, Sequence Diagrams, and Collaboration Diagrams. "}
{"text": "Environment: Agile( Scrum), UML with Microsoft Outlook, Microsoft Office, Microsoft Visio, MS Project, MS Word, Excel and MS Visio."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "DirecTV, El Segundo, CA                                                                                          "}
{"text": "Feb 2012- Dec 2013"}
{"text": "Business Analyst"}
{"text": "DirecTV (trademarked as \"DIRECTV\") is a direct broadcast satellite (DBS) service based in El Segundo, California that was founded in 1990. It transmits digital satellite television and audio to households in the United States, the Caribbean and Latin America except for Mexico. DirecTV is owned by DirecTV Group, which is controlled by Liberty Media. DIRECTV was rolling out their legacy mainframe Comergent BAU system to a new Comergent Data Driven system. I was multitasking as a functional BA & enterprise BA working on different offers and functional changes at the same time. My major responsibility was to maintain and update the DWS (Dealers Website) so that the latest promotions and offers from DirecTV were shown on the DWS platform."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Organized JAD Sessions to resolve issues and conflicts, and to arrive at quick agreements regarding the system architecture design"}
{"text": "Involved in the review of requirements with functional manager and technical specialists of the application"}
{"text": "Designed and executed Test Plans and Test Cases and generated Test Scripts and Test scenarios."}
{"text": "Coordinated User Acceptance Testing with the UAT group to ensure the correct business logic."}
{"text": "Worked closely with end-users and developer to develop a detailed understanding of the opportunities for improvement, then gathered requirements and prepared a comprehensive set of documents to define the specifications and business value of the system"}
{"text": "Analyzed production issues and worked with the IT development team to determine root cause analysis, timeline of events and open HP Quality Central (HP ALM) tickets for releasing fixes in future maintenance releases."}
{"text": "Analyzed the Data flow and UML Diagrams."}
{"text": "Worked with Business Area Experts and Subject matter experts to understand the business requirements."}
{"text": "Monitored the Defect Tracking Process and generated customized graphs and reports for the client using ALM."}
{"text": "Analyzed operating procedures and policies on an ongoing basis and recommended and implemented improvement plans where appropriate."}
{"text": "Understood core processes of the departments to provide input on re-engineering or streamlining opportunities. "}
{"text": "Opened several high severity defects in HP QC to track and managed the defect lifecycle. "}
{"text": "Worked with the development team to resolve all the defects and updated the results of re-testing of defects in HP QC."}
{"text": "Met with client groups to determine user requirements and goals. "}
{"text": "Analyzed business requirements and segregated them into high level and low level Use Cases, activity diagrams / State Chart Diagrams and Robustness Diagram using MS Visio according to UML methodology, thus defining the Data Process Models."}
{"text": "Created different tables in MS Access for every module."}
{"text": "Prepared Test plans, Test Cases based on business requirements using Quality Center."}
{"text": "Environment: JAD, UML, Oracle/Unix, SQL Developer, ms Visio, SQL PLUS, HP Quality Center."}
{"text": ""}
{"text": ""}
{"text": "Citibank, New York, NY\t\t\t\t\t\t\t\t   "}
{"text": "Oct 2010 – Jan 2012"}
{"text": "Business Analyst"}
{"text": "I was Involved in business analysis of an online banking application that enables the bank’s customers to access their accounts through the Internet. Account holders enter their access ID and password to access their personal accounts, which includes checking, savings and money market account. The application provides the accounts lists, account summary, account transactions for various accounts and the ability to transfer funds between the various accounts using fund transfers."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "As a Business Analyst, prepared departmental reports, providing analytical framework related to the budget process"}
{"text": "Assisted with the gathering Business Requirements based on the user requirements and specifications."}
{"text": "Worked with the technical and business staff to produce Test Scripts, Configuration and Management Plan documents. "}
{"text": "Worked directly with developers, Project Managers and Business contacts to produce Test Scripts and Test Conditions."}
{"text": "Followed established formats and procedures, created new formats, as well as researched, created, edited technical and business data documents. "}
{"text": "Worked with the Senior Business Analyst to conduct (JAD) sessions with business and technical units."}
{"text": "Used UML diagrams to visually express the core functionality of the System Under Development (SUD). "}
{"text": "Exposed to Security Testing and Regression Testing using Win Runner."}
{"text": "Exposed Functionality Testing and GUI Testing using Win Runner"}
{"text": "Exposed Data Driven Testing to test the application with different sets of data from the test database. "}
{"text": "Raised defects and logged in the HP QC tool to manage the resolution of the defects."}
{"text": "Used Quality Center to run manual and automated tests, report execution results."}
{"text": "Interacted with the developers to report and track bugs using Quality Center."}
{"text": "Follow up with developers on defects status on a daily basis."}
{"text": "Worked with the BA / QA team to develop test plan and test cases for (UAT)."}
{"text": "Environment: Oracle, MS Windows, Visio, IIS Server, Quality Center, Test Cases, Test Plans."}
{"text": ""}
{"text": "EDUCATION"}
{"text": "Masters in Accounting"}