{"text": "Name: alice alice"}
{"text": "E-Mail: alice.alice@gmail.com"}
{"text": "Address: Nanchong, China"}
{"text": "Github: https://github.com/alice"}
{"text": "LinkedIn: https://linkedin.com/alice"}
{"text": "Phone No. 820417762861"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": ""}
{"text": "Over 7+ years of experience as a QA Test Engineer using Manual & Automation Testing. Worked in multiple domains like Finance, Health Care, Insurance and Telecom Domains."}
{"text": "Strong knowledge of Software Development Life Cycle (SDLC) as well as Software Testing Life Cycle (STLC) and the Role of QA in different testing methodologies like Agile, and Waterfall etc."}
{"text": "Widely followed AGILE methodology and scrum processes."}
{"text": "Excellent work experience in Smoke, Functional, Integration, GUI, Regression, System, Compatibility, Performance, Acceptance, Security, Stress, Black Box Testing etc."}
{"text": "Expertise in writing SQL Queries using Oracle, SQL Server and Teradata in validating data into Data Warehouse/ETL applications."}
{"text": "Experience in using the automated testing tools Win Runner (GUI Testing, TSL, Web Testing, and Context Sensitive & Analog Recording), Test Director, and VSTS (Visual Studio 2005 and Microsoft automation Framework using C#)."}
{"text": "Proficient in using test automation tools such as Selenium WebDriver/RC/IDE/Grid, QTP and QTP Appium to develop automation testing scripts for web, Mobile and client server applications. "}
{"text": "Experience in developing web-based applications using Python 2.7/2.6, Django 1.4/1.3, PHP, Flask, Webapp2, Angular.js, VB, C++, XML, CSS, HTML, DHTML, JavaScript and JQuery."}
{"text": "Experience in developing end to end automation using Selenium WebDriver/RC/IDE/Grid, Junit/TestNG, ANT, Maven, Jenkins, Cucumber, Web Services (REST, SOAP)."}
{"text": "Strong working experience in the Data Analysis, Data Verification and Validation of an ETL Applications using Backend/Database Testing."}
{"text": "Experience with Mobile Automation Tool Device Anywhere and Appium automation framework and knowledge of SeeTest, eggPlant."}
{"text": "Deep technical and functional knowledge of Microsoft Dynamics CRM Online and On-Premise (2011, 2013)"}
{"text": " Expertise in performing manual testing (emulators & IOS Simulators) & Mobile Application Testing using Appium. "}
{"text": "Automation experience using Selenium IDE/RC/ Web Driver and TestNG frameworks."}
{"text": "Open source testing frameworks, including JMeter, FIT, Selenium, QTP"}
{"text": "Experience in validating Regular and Ajax control using Selenium locators (Xpath, CSS, id and name)"}
{"text": "Experienced in reading the test data from XL spread sheets using JXL API and TEST NG Data provider"}
{"text": "Experience Tester in Agile Development Env. Using TDD and ATDD approach."}
{"text": "Hands On Experience on testing web services (SOAP, REST) using SOAP UI Tools"}
{"text": "Experience in working with Oracle, DB2, My SQL and MS-Access Databases."}
{"text": "Increased speed and memory efficiency by implementing code migration to convert python code to C/C++ using Python."}
{"text": "Quality Center, Service Manager, PPMC, GIT Stash, QTP, RTC (Rational Team Concert), ETL Informatica, CTM experience. "}
{"text": "Strong hands on experience working on Performance testing tools such as Load Runner and JMeter."}
{"text": "Strong Automation experience using QTP 8.2 and IBM Rational Functional Tester(RFT8.2)"}
{"text": "Comprehensive understanding of Curam Case Management functionality and business process"}
{"text": "Experienced in LAMP (Linux, Apache, MySQL, and Python) Architecture. "}
{"text": "Extensive work experience on JAVA, VB Scripts, Junit, DBUnit, Maven, ANT, Python, Hudson, and Jenkins."}
{"text": "Expertise in using Tools Mercury/HP Quality Center, Rational Clear Quest, BugZilla, Rally and JIRA."}
{"text": "Experience in Continuous integration tools like Maven, Jenkins and Rally Tools."}
{"text": "Working on tools and languages (HPQC, QTP, HP Load Gen, Ruby, Cucumber, SQL Developer, Parasoft, TOAD, Lettuce, Python, Curl, HP Service Test)"}
{"text": "Extensively used AOP and JMeter for performance enhancement."}
{"text": "Experience in validating mobile web and native apps on Android and iPhone devices"}
{"text": "Experience in writing ANT, Maven build scripts, providing logging facility using Log4j, Writing JUnit test cases and used Clear Quest, Jmeter for bug tracking."}
{"text": "Knowledge in testing IVR for navigation system application on iPhones and androids"}
{"text": "Experience with UAT testing along with data setup, Environment setup and coordination between users, Development, Business Analyst and Product Management teams."}
{"text": "Expert in preparing Traceability Matrix to map requirement coverage with test cases."}
{"text": "Responsible for ensuring the thorough testing of the product against business requirements, non-functional requirements ensuring the critical business goals and requirements are met"}
{"text": "Ability to take proactive initiatives related to application performance improvement using Automation and different frameworks. Also adept in exploring new business opportunities."}
{"text": "Good Communication, interpersonal, and Teamwork skills. "}
{"text": "Excellent Organization, Analytical and Problem Solving skills and ability to quickly learn new technologies."}
{"text": "Demonstrated initiative, innovation, flexibility, and ability to manage workload, achieving desired results with minimal supervision. "}
{"text": "Good Communication and Interpersonal skills. Technically sound, Result-Oriented with strong Problem solving skills. Innovative & efficient. Capable of working as a Team Member or Individually with minimum supervision."}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "\t\t\t"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": "Company: Radcom Technologies Inc, Dallas TX                                                                             Jan 15 - Present                                                                                                                               "}
{"text": "Description: Radcom Technologies, Inc., a telecommunications company specializing in identifying and solving "}
{"text": "business challenges with cost-effective solutions that increase both productivity and income. Radcom "}
{"text": "Technologies, Inc., design and support integrated voice and data systems for the new millennium. The "}
{"text": "project involved customization and testing of their operational system to perform manual and automation testing on different modules like Billing, OMS, CSM, and Price Plan."}
{"text": ""}
{"text": "Role: Sr. Automation Engineer.\t\t\t\t\t\t\t"}
{"text": "Responsibilities:"}
{"text": "Involved in analyzing Business Requirement Document and Technical Specification Document and developed test plan and test cases for testing the application."}
{"text": "Test automation for web application (SWAP module) using Cucumber."}
{"text": "Record and analyze defects and validated in IBM Rational Team Concert RTC ."}
{"text": "Test automation for web application (SWAP module) using Cucumber."}
{"text": "Performing Cross-platform, Functional, Regression testing, UI testing for mobile app using Appium test automation framework."}
{"text": "Performed browser compatibility and configuration testing on various operating systems such as Blackberry OS, Android OS, iOS etc."}
{"text": "Created automated scripts for CCT API WSDLs using VUgenerator in LoadRunner (webservices protocol) for regression scenarios."}
{"text": "Worked with three mobile application simultaneously: iOS (iPhone & iPad) and Android"}
{"text": "Requested different versions of iOS, Android and Blackberry mobile devices"}
{"text": "Used agile methodology to ensure the new features meet the customer requirements and acceptable quality assurance standards."}
{"text": "Requested different versions of iOS, Android and Blackberry mobile devices"}
{"text": " Developed automation script for Mobile Native applications (IOS, Android) using Appium, Java. "}
{"text": "Execute test cases in RQM and log defects with clear documentation on how to reproduce defects in RTC "}
{"text": "Developed BDD tests using Cucumber by writing behaviours and step definitions. Developed required Selenium support code in JAVA for Cucumber."}
{"text": "Ran the scripts for multiple users using controller in Laod runner for CCT GUI/API regression/Load testing."}
{"text": " Working on Appium POC for Mobile automation. "}
{"text": "Responsible for creating Functions, Test Data and Test Suite. "}
{"text": "Created reusable function library in QTP that can be used across various scripts for provisioning/Billing GUI and API/XMLs."}
{"text": "Responsible for implementing LoadRunner, Performance center, JMeter based infrastructure including: Architecting the load testing infrastructure, hardware & software integration with LoadRunner."}
{"text": "Involved in UNIX Shell Scripts, Python, and Perl scripts."}
{"text": "Used JIRA for managing testing process and bug reporting.   "}
{"text": "Used HP Quality Center (QC) and JIRA for reserving, executing test cases, defect tracking, and the complete test management."}
{"text": "Created test planning and participated in execution for API testing using Test harness tool."}
{"text": "Test case automation using Cucumber test automation tool and  Gherkin scripting language"}
{"text": "Implemented mobile test automation platform (Appium-Webdriver) "}
{"text": "Used IBM RQM (Rational Quality Manager) for test scripts and link the test cases to requirements."}
{"text": "Participated in walkthroughs of requirements, specifications, database designs, ETL code, and test strategies"}
{"text": "Integrated the test suites to Jenkins to execute them automatically after every successful deployment."}
{"text": "Lead sessions with the Curam technical staff to explain business requirements and Curam data model including the interpretation of entities and attributes in relation to the requirements"}
{"text": "Worked on parsing and retrieving JSON data using JQuery, Python."}
{"text": "Work closely with the State DHHS personnel in discovering, identifying and defining business requirements, perform gap analysis of the legacy to new solutions using IBM Curam Business Suite"}
{"text": "Creating automation for HTML5 games using Java/Selenium/Appium "}
{"text": "A key member introducing Agile/Scrum. The pilot project was so successful Agile/Scrum is now the standard method in development projects."}
{"text": "Developed Main view and Single view Dashboards as an extension of Dynamics CRM."}
{"text": "Responsible for Load Testing using Apache JMeter."}
{"text": "Responsible for architecting the testing Framework using Selenium and other different kind of API from scratch."}
{"text": "Responsible in executing Selenium test scripts on different browsers and checked for compatibility."}
{"text": "Responsible in writing Regression test cases and automated testing using Selenium WebDriver."}
{"text": "Identified the bottleneck by running the scenario under various numbers of users and reported the issues by using HP ALM."}
{"text": "Created, tracked and closed customer issues, and development bugs using Visual Studio 2010Performed the Back-End integration testing to ensure data consistency on front-end by writing and executing SQL statements."}
{"text": "Created unit and functional test cases through use of testing tools such as Python and Bash."}
{"text": "Responsible for performance testing using JMeter."}
{"text": "Used JOINS on the tables to retrieve information from different tables in database to check the database updates on a regular basis using SQL queries."}
{"text": "Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface. "}
{"text": "Responsible for Regression testing after bug fixes and verified those fixes."}
{"text": "Involved in monitoring, maintaining, stabilizing of automated jobs using Jenkins. "}
{"text": "Provided client support by analyzing day to day requirements and generating reports by executing queries based on the requirement."}
{"text": "Environment: Selenium WebDriver, IOS, Android, Black Berry, Appium,  API, RTC, Trading, TDD,  Visual Studio,  Zephyr , Jenkins, Jmeter, Agile, Eclipse, Cucumber Java, Jira,  IBM Curam ,RQM,  Python 2.7, TestNG, Maven, Oracle SQL Server, SOAP UI, JMeter, Jenkins, HTML, XML, Windows, Solaris, CVS."}
{"text": ""}
{"text": "Company: Charter Communication - St. Louis, MO                                                                                    Jul 13 - Dec 14                                                                                   "}
{"text": "Description: Worked as a Software Quality Analyst on E-commerce project at Charter Communications and also involved in their Mobile app testing. Testing the E-commerce site charter.com on different environments (Test, UAT, and PROD) and on Mobile devices and tablets for validation of offers."}
{"text": "Role: Automation Test Engineer\t\t\t\t\t\t\t\t\t                         Responsibilities:"}
{"text": "Analyzed business requirements and participated in design reviews. "}
{"text": "Actively participate weekly Curam Product Development meeting"}
{"text": "Assigned the tasks of assisting senior QA agile tester in developing test tools and test environment"}
{"text": "Responsible for Load Testing using Apache Jmeter"}
{"text": "Create and manage test cases in RTC. "}
{"text": "Performed browser compatibility and configuration testing on various operating systems such as Blackberry OS, Android OS, iOS etc."}
{"text": "BDD/Cucumber approach which allows non-programming QA engineers to write new automated tests"}
{"text": "Attending Sprint planning sessions, User story grooming sessions and Retrospective meetings in a rapid and affective Agile atmosphere."}
{"text": "Worked closely with team to create test scripts using IBM Rational Functional Tester, QTP and Rational Manual Tester."}
{"text": "Create web UI tests using cucumber, capybara, gherkin, Selenium WebDriver (tests written in ruby)"}
{"text": " Developed automation script for Mobile Native applications (IOS, Android) using Appium, Java. "}
{"text": "Worked with three mobile application simultaneously: iOS, Android and WP7"}
{"text": "Reviewed the project documents like Project Definition Document (PDD), Software Architecture Document (SAD), batch specification documents."}
{"text": "Extensively interacted with developers, business& management teams to understand the OPM project business requirements and ETL design document specifications."}
{"text": "Work in Agile, scrum, and sprint environment in order to change the requirements and features set."}
{"text": "Developed test cases to cover overall quality assurance testing. "}
{"text": "Building the MS Dynamics CRM forms, screens, and views, as well as workflows and reports around the customer needs for an interface."}
{"text": "Participated in defect tracking, PBL creation, raising impediments and management using RTC "}
{"text": "Tested a number of complex ETL mappings, mapplets and reusable transformations for daily data loads."}
{"text": "Creating test cases for ETL mappings and design documents for production support"}
{"text": "Participated in Agile software testing process with regular QA meetings to discuss testing issues. "}
{"text": "Used Appium for native, hybrid Mobile Application Testing for IOS and Android platforms. "}
{"text": "Involved in Mobile Computing testing with Windows OS, iPhone, iPad and Android Essentials including cross-browser testing."}
{"text": "Performed Mobile Testing in iOS devices and Android devices by using Appium. "}
{"text": "Used agile methodology to come up with test scenarios and test cases. "}
{"text": "Wrote a program to use REST API calls to interface with Veeam backup server, and parse output reports of an excel file in python to monitor customer backup usages."}
{"text": "Wrote multiple programs in Python to monitor virtual machine usage data using VMWare API calls."}
{"text": "Extensively used Selenium API and WebDriver to test the web applications."}
{"text": "Responsible for creating Functions, Test Data and Test Suite. "}
{"text": "Developed views and templates with Python and Django's view controller and templating language to create a user-friendly website interface"}
{"text": "Utilize PyUnit, the Python unit test framework, for all Python applications."}
{"text": "Created entire application using Python, Django, MySQL and Linux."}
{"text": "Automated database operations in Python; percona_clone.py is a new addition to mysql-cluster-tools"}
{"text": "Responsible for creation and execution of Selenium test scripts on different browsers."}
{"text": "Experienced in functional testing using Selenium IDE and WebDriver using JUnit testing framework."}
{"text": "Performed manual testing of each build and then regression testing on each builds using WebDriver. "}
{"text": "Developed data driven test scripts to check the same functionality with multiple sets of data."}
{"text": "Used Quality center to log, track and close defects as and when developers provided fix."}
{"text": "Performed database verifications using SQL queries to validate test data."}
{"text": "Performed Smoke testing, Functional testing, GUI testing, Database Testing, Data Driven and UAT."}
{"text": ""}
{"text": "Environment: Selenium-RC, WebDriver, Eclipse, Trading, Appium, IOS, Android, Black Berry, RTC,  Visual Studio, IBM Rational Functional Tester, Zephyr,  Jenkins, Jmeter, Agile, RQM, Cucumber, Python, Jira, IBM Curam, JUnit, MS SQL Server, TDD,  SOAPUI, Java, XML, Quality Center, Windows, Solaris, SVN."}
{"text": ""}
{"text": "Company: Progressive Insurance, Santa Clara, CA                                                                                      Aug 12 - Jul 13"}
{"text": "Description: Progressive Insurance is one of the leading insurance companies in United States. The automated service system has enabled policy holders to obtain billing information and electronic payment of bills."}
{"text": "Role: QA Engineer\t\t                            "}
{"text": "Responsibilities:"}
{"text": "Reviewed Business Requirement Documents and Technical Specifications."}
{"text": "Prepared Test Data based on requirement document of the application."}
{"text": "Involved in preparing detailed Test Plans and executed the Test Cases."}
{"text": "Prepared Requirements Traceability Matrix to ensure the progress on a regular basis."}
{"text": "Worked with the test executive team, the project management deliverables for the test component of the project activity."}
{"text": "Worked with ETL groups and Acquisition team and business analyst for understating mappings for dimensions and facts"}
{"text": "Followed “Agile” software development model with one week sprint."}
{"text": "Tested a number of complex ETL mappings, mapplets and reusable transformations for daily data loads"}
{"text": "Creating test cases for ETL mappings and design documents for production support"}
{"text": "Worked with developers to fix bugs that occur on the Sequoia staging environment through the use of Jira."}
{"text": "Developed entire frontend and backend modules using Python on Django Web Framework. "}
{"text": "Performed manual testing on different modules of the application by entering positive and negative values to the application and updated test case document with results. "}
{"text": "Involved in Sanity Testing, GUI Testing, Functional Testing, Regression Testing and Database Testing."}
{"text": "Created SQL queries to verify the data from database."}
{"text": "Developed SQL Queries/Scripts and similar Artifacts to validate the Completeness, Integrity and Accuracy of Data within an ETL process testing cycle."}
{"text": "Performed Data Analysis and developed Data Mapping documents for ETL (SSIS) projects."}
{"text": "Coordinated with the user to execute User Acceptance Testing."}
{"text": "Defects were tracked and prioritized using Quality Center and analyzed the variation between expected and actual results."}
{"text": "Strongly followed Agile methodology with three weeks sprint and executed various modules"}
{"text": "Analyzed test results, identified issues and reported it to the developers and project manager through Jira."}
{"text": "Rewrite existing Python/Django modules to deliver certain format of data. "}
{"text": "Worked with ETL group for understating mappings for dimensions and facts"}
{"text": "Worked with Agile team to ensure the integrity of quality processes and practices"}
{"text": "Developed entire frontend and backend modules using Python on Django Web Framework."}
{"text": "Involved in business meetings with developers and other testers."}
{"text": "Wrote python scripts to parse XML documents and load the data in database. "}
{"text": "Performed analysis on existing code base to validate against business requirements, coding guidelines."}
{"text": "Responsible for performing static and dynamic analysis of the software module."}
{"text": "Responsible for generating test reports, defect tracking."}
{"text": "Utilized Jira as defect tracking tool on the project."}
{"text": "Used Python and Django to interface with the jQuery UI and manage the storage and deletion of content. "}
{"text": "Responsible for recommending necessary changes and modifications to program developers."}
{"text": "Implemented procedures to improve productivity and quality."}
{"text": "Conducted training programs and mentored team members for an observed increase in performance"}
{"text": "Performed Test Case reviews and monitored Test Execution."}
{"text": "Participated in regular QA Team meetings and discussions."}
{"text": "Generated Bug reports and participated in Defects Meeting."}
{"text": ""}
{"text": "Environment: Java, Oracle, HP Quality Center, SQL, Windows, MS Office."}
{"text": ""}
{"text": "Company: HEB, San Antonio, TX.                                                                                                                 Oct 11 - Aug 12"}
{"text": "Description: HEB Grocery Company, LP (stylized as H-E-B), also known as H-E-B Grocery Stores, is an American privately held supermarket chain. The company also operates Central Market, an upscale organic and fine foods retailer. The company operates several manufacturing facilities in Texas, including one of the largest milk and bread processing plants in the Southwest. H-E-B produces many of their own-brand products, including milk, ice cream, bread, snacks, and ready-cooked meats and meals."}
{"text": "Role: UI Developer "}
{"text": "Responsibilities: "}
{"text": "Requirements gathering and analyzing them, checking the dependencies and design the project."}
{"text": "Involved in development, design and implementation front end part of the widget based application using HTML, CSS, JQuery and JavaScript."}
{"text": "Utilized JavaScript and JQuery to improve overall design and UI of campaign websites."}
{"text": "Designed and developed Use-Case Diagrams using UML to decide upon the modules.  "}
{"text": "Developed ER diagrams for database design."}
{"text": "Created UI mockups/prototypes for client approval."}
{"text": "Used AJAX and Java Script for front end validation. "}
{"text": "Developed XML parsing classes to parse the records."}
{"text": "Developed DAOs (Data Access Objects) and SQL queries to support system functionality."}
{"text": "Involved in database Design Creation of Stored procedures to access using the Callable Statement, JDBC Connection Pooling for achieving back-end connection."}
{"text": "Wrote SQL Stored procedures, triggers, views."}
{"text": "Involved in the performance testing and performance enhancement activities."}
{"text": "Performed QA activities, Created test data, test cases and tested the application."}
{"text": ""}
{"text": "Environment: HTML, CSS, JQuery, AJAX, DHTML, JavaScript, Eclipse, Dreamweaver, Tomcat, SQL, Oracle and Windows."}
{"text": ""}
{"text": "Company: St. Luke’s Medical Center, Houston, TX\t                                                                 Jan 10 - Sep 11"}
{"text": "Role: Automation Tester\t\t\t"}
{"text": "Description: Customized application software developed for a hospital/medical facility which consists of doctors, drug store information and other staff members. It consists of six modules, which are In-patient maintenance, outpatient maintenance, personal financial management accounting, drugs maintenance, inventory control and reports."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Analyzed business requirements, participated in technical design, development and testing of various modules assigned."}
{"text": "Involved in developing the UI pages using HTML, DHTML, CSS, JavaScript, JSON, JQuery and Ajax."}
{"text": "Implemented the web-based application using struts Framework."}
{"text": "Used JavaScript for adding little functionality to the existing application (calendar, tooltips, hiding elements, etc.)."}
{"text": "Developed JSP for the multiple views in the presentation layer and Java Beans for model layer."}
{"text": "Worked one-on-one with client to develop layout, color scheme for his website and implemented it into a final interface design with the HTML/CSS &JavaScript using Dreamweaver CS3. "}
{"text": "Used JSTL and wrote custom JSP tag libraries and implemented role based handling in JSP pages."}
{"text": "Used JQuery core library functions for the logical implementation part at client side for all the application."}
{"text": "Used Ajax for populating the list/drop down box with data."}
{"text": "Wrote Hibernate configuration file, Hibernate mapping files and defined persistence classes.  "}
{"text": "Worked on SRS and process flow documents."}
{"text": "Interacted with the Graphics design team in the use of Photoshop CS3, MS Visio, PowerPoint, Dreamweaver and Flash."}
{"text": "Updated defects in Quality center and fixing the defects assigned."}
{"text": "Involved in Developed test cases/scenarios, manual testing of the application."}
{"text": ""}
{"text": "Environment: HTML, DOM, DHTML, XHTML, CSS, JavaScript, C#, API, JQuery, Adobe Dreamweaver CS3 and Web Services."}
{"text": "\t   "}
{"text": "Company: AT&T, Richardson, TX \t\t\t\t\t\t                    Aug 08 - Dec 09"}
{"text": "Role : Automation Tester"}
{"text": "Project GFP-FRED/DRO is used in both anticipation of a disaster and when disaster strikes. A customer will contract with AT&T to have disaster recovery capabilities ready in case of disaster. An alternate site and port is designated beforehand as the backup facility for a targeted PVC and site. FRED representatives are contacted by the customer and told to activate the necessary scenario containing the affected PVCs (Customer Care, Billing support, Billing activation, Billing account setup, Billing account customization and risk support)"}
{"text": "Responsibilities"}
{"text": "Created detailed test cases by understanding the business logic and user requirements for manual testing using Quality Center."}
{"text": " Performed End to End Testing (E2E) on AngularJS Framework using Protractor. "}
{"text": "Mobile Testing with Appium, Protractor, Espresso, Xcode and Robotium. \n Created and executed the test cases for iPhone, iPad, Android Devices."}
{"text": "Performed Functional testing, Regression testing, UI testing, and Integration testing of the application."}
{"text": "Developed automation test suites and test cases using Selenium Web Driver, TestNG and Maven."}
{"text": "Extensively used Selenium (Xpath, ID and CSS locators) to test the web application."}
{"text": "Contributed in developing Automation Framework that uses Selenium Web Driver and TestNG. Framework implements using Data Driven, Page Object Model."}
{"text": "Involved in Mobile Computing testing with Windows OS, iPhone, iPad and Android Essentials including cross-browser testing."}
{"text": "Requested different versions of iOS, Android and Blackberry mobile devices"}
{"text": " Have experience in test automation by using open source tools such as Selenium, Junit, JMeter, Appium, Android Driver and languages Python."}
{"text": "Worked on distributed test automation execution on different environment as part of Continuous Integration Process using Selenium WebDriver and Jenkins."}
{"text": "Tested request and response XML's based web services interfaces using SoapUI."}
{"text": "Experience with Assertions like Xpath and SOAP responses."}
{"text": "Created and executed the test cases for iPhone, iPad, Android Devices."}
{"text": "Performed Functional and Cross Browser Testing."}
{"text": "Developed new Test Cases for every sprint and working with developers to automate their feature."}
{"text": "Developed PL/ SQL queries to query database to test backend process of application during End-to-End testing."}
{"text": "Created Traceability Matrices, Test and Bug Reports and other Test related documents."}
{"text": "Implemented Regression and Smoke tests execution as separate step of deployment process."}
{"text": "Provided weekly status report to project manager and team lead, worked closely with Business and Development teams."}
{"text": ""}
{"text": "Environment: Selenium Web Driver2, Eclipse, JIRA, JAVA, IOS, Android, Black Berry TestNG, API,  SOAP UI,  SOAP,  SVN, Jenkins, Xpath, CSS, Selenium IDE, C#,  HTML, XML, UNIX, JavaScript, Web Services, Mobile Testing, PL/SQL, MS Excel and Windows, Oracle, TOAD."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}