{"text": "Name: ruth ruth"}
{"text": "E-Mail: ruth.ruth@gmail.com"}
{"text": "Address: Qujing, China"}
{"text": "Github: https://github.com/ruth"}
{"text": "LinkedIn: https://linkedin.com/ruth"}
{"text": "Phone No. 694146535153"}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "Professional experience of around 6+  plus years as Business Analyst / EDI Analyst in Healthcare domain in a modeling using UML, System Development Methodologies, Business Process Modeling and experience in HIPAA 4010 and 5010 EDI healthcare transactions like 837, 835, 834, 270,820 and 271"}
{"text": "Proficient in closely working with Project Stakeholders, SMEs and Technical team in preparing Business Requirement Document (BRD), Functional Requirement Document (FRD), Requirement Traceability Matrix (RTM), Project Scope Document, Use Cases, and User Manuals"}
{"text": "Good understanding of Software Development Life Cycle (SDLC) following Waterfall, Agile-Scrum, RUP (Rational Unified Process) and RAD methodologies"}
{"text": "Well versed with ICD-9, ICD-10, HIPAA, EDI (Electronic data interchange) Transaction, Medicare & Medicaid, claim processing from point of entry to finalizing, claim review, identifying claims processing problems, their source and providing alternative solutions"}
{"text": "Good knowledge of Claims processing, HIPAA Regulations and 270, 837P, 837I, 837D EDI Transactions for health care industries."}
{"text": "Experience in facilitating Joint Application Development (JAD) sessions between end-users, SMEs and technical team. Also conducting project meetings, walkthroughs, workshops and customer interviews on regular basis"}
{"text": "Sound Knowledge of Unified Modeling Language (UML)"}
{"text": "Knowledge of IBM Rational Software integrated tools like Requisite Pro, Rational Rose for managing requirements and analyzing Use Case development"}
{"text": "Sound proficiency in analyzing and creating, Use Cases diagrams, Sequence diagrams, Activity diagram, Swim Lane Diagrams, Data flow diagrams, Business flow diagram using MS Visio"}
{"text": "Knowledge of 837, 835, 277, 270, 271, NCPDP, 5010 and ICD-10."}
{"text": "Knowledge of HIPAA 4010, 5010, ICD 9,ICD 10 and EDI transactions 270, 271,820, 834, 835, 837,820,871,"}
{"text": "Knowledge of Facets, Medicaid & Medicare claims and enrollment and Claims Processing/Claims Validation"}
{"text": "Adept in conducting User Acceptance Testing and verifying performance, reliability and fault tolerance issues. "}
{"text": "Skill Set:"}
{"text": ""}
{"text": "PROFESSIONALEXPERIENCE\n\nMolina Healthcare, Boise ID           BA/ EDI Analyst May- 2013 to Jan-2015\n\nIdaho Base MMIS project is to provide the Base component of the MMIS, which receives and processes prior authorizations, referrals, claims, and remittance advices for medical and dental services. The project also manages provider enrollment for all Idaho Medicaid providers along with Idaho Medicaid Member. The objective of the project was to upgrade the current system from HIPAA 4010 to HIPAA 5010. Responsible for performing GAP analysis for EDI 834/837/270/271 transactions from HIPAA 4010 to 5010 \nResponsibilities:"}
{"text": "Worked with a cross functional and diverse team of business users and developers to enable accurate communication of requirements and ensure a consensus."}
{"text": "Performed Gap Analysis to identify AS-IS processes of claims transactions of 4010/4010A standard and TO-BE processes of 5010 standard."}
{"text": "Participated in review and analysis of business requirements, adding additional cases as needed, insuring they are complete and testable."}
{"text": "While working on requirements of the 835 HIPAA project, jumped half way in the 820 report project, continued working on 835, 276 / 277 and HIPAA EDI Transactions across enterprise, meanwhile new project initiation of 4010 to 5010 migration began."}
{"text": "Initiated with a comparison report of migration of 4010 to 5010. 270 Eligibility, Coverage or Benefit Inquiry Eligibility, "}
{"text": "Tested the ANSI X12 Version 4010 / EDI transactions (HIPAA) like 270, 271, 276, 277, 837P, 837I, 837D, 835.820,"}
{"text": "Wrote Test scenarios and test cases for testing the migration of EDI 4010 to 5010 and the processing of member enrollment and benefits, batch jobs corresponding to the claims (837) and real time transactions like 270/271/276/277."}
{"text": "Worked with HIPAA Team for RIMS Companion Guide of X12 ANSI 270/271 and 276/277 Companion guides for Professional and Dental claims. Cross-functional team member in the implementation of the ANSI X12 involving 837HIPAA compliance and 835 Remittance Advice."}
{"text": "Did gap analysis for HIPAA 4010 837P and 835 transactions and HIPAA 5010 837P and 835.820,"}
{"text": "Involved in impact analysis of HIPAA 5010 835 and 837P transaction sets on different systems."}
{"text": "Performed GUI testing, Integration is testing, Regression testing, Ad-hoc testing, Negative testing, End to End testing, Smoke testing Load testing, User Acceptance testing and Pilot testing."}
{"text": "Extensive experience and knowledge of NCPDP, 837, 835, 277, 270, 271,820 , 5010 "}
{"text": "Wrote Test Scenarios, Test cases in excel sheet and imported them to Rational Manual Tester/Test Manager."}
{"text": "Logged defects in Rational Clear Quest, re-tested defects, analyzed defect with Users and Developers."}
{"text": "Environment: ANSI X12 , HIPAA 4010 ,5010,MS SQl Server Rational  Reqpro, Rational Clear quest, Rational Manual Tester, Rational Test Manager, MS SQL Server Reporting Service(SSRS), "}
{"text": ""}
{"text": "Coventry Health Care, Minneapolis MN        BA/ EDI Analyst                           Oct--2011- May-2013   \n                                 "}
{"text": "Conversion of ICD 9 to ICD 10 complaint with HIPAA 5010. HIPAA requires that all health insurance payers."}
{"text": "The extended version of the ANSI ASC X12 837/835 transaction set was selected as the HIPAA- mandated format for electronic enrollment and disenrollment in a Health Plan."}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Worked on EDI transactions: 270, 271, 834, 835, and 837, 820,(P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrollment hence analyzing and documenting related business processes."}
{"text": "Assisted in identifying project scope, to confirm to the regulatory compliance related to X12 837 (I/P) and 835."}
{"text": "Responsible for soliciting and eliciting requirements for 4010-5010 conversions. "}
{"text": "Worked using Agile methodology that was set up for the project"}
{"text": "Carried out Risk Assessment, GAP analysis and Impact analysis for the 4010-5010-conversion project. "}
{"text": "Involved in one-to-one interview sessions and JAD sessions with stakeholders, SME’s and business owners to discuss the scope of the conversion. "}
{"text": "Produced, for transaction sets 835 and 837 (I/P), a full gap analysis 4010 vs. 5010 against the document application 5010 enhancements ensuring the upgraded application included the required changes and additions for 5010 compliancy "}
{"text": "Involved in up-gradation of 4010 transaction to 5010 by conducting Impact Analysis and Risk Assessment and worked on the mitigation plan to avoid the risks. "}
{"text": "Responsible for the development and implementation of HIPAA EDI Map sets 270, 271, 276, 277, 820, 834, 835, 837 and 5010."}
{"text": "Involved in creating sample mappings for the conversion of EDI X12 transactions code sets version 4010 to 5010 and translation of ICD 9 codes into ICD 10 codes"}
{"text": "Involved with reviewing defects reported from UAT efforts and analyzed for root cause and took actions based on the findings. "}
{"text": "Analyzed CMS comparison documentation highlighting changes of 4010 format and ICD 10 diagnosis and procedure codes."}
{"text": "Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 Transaction, Code set and Identifier aspects of HIPAA."}
{"text": "Identified the master file changes and builds needed to enable the 5010 format to be utilized. "}
{"text": "Gathered requirements for impacted system and business areas for ICD-10 and their needs to embrace the changes"}
{"text": ""}
{"text": "Environment: MS Project, MS Office, Rational Team Test Suite, Windows NT, Java,  Java Script, HTML, MS Visio, UML."}
{"text": "Presbyterian Health Care System, Washington DC       BA/ EDI Analyst Apr-2010-Sep-2011"}
{"text": ""}
{"text": "I was involved in the BA/ EDI Analyst of EDI X12, transactions including 837P, 837I and 835,820, based on HIPAA 4010 and mapping them in order to comply with HIPAA 5010 standards. The new application also allows the agents to track and manage the status of a health benefit claims. The team is also actively involved to verify the data while it is converting from web portal to mainframe layout as well as in returning from mainframe to web portal.  "}
{"text": "       Responsibilities: "}
{"text": "Examined the HIPAA 4010 and 5010 standards for 837P, 837I, and 835 transactions and also prepared Gap Analysis document for every transaction"}
{"text": "Gathered and documented business requirements for existing and future business systems."}
{"text": "Involved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims. Worked on EDI transactions 270, 271, 834, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrollment hence analyzing and documenting related business processes."}
{"text": "Extensive experience and knowledge of NCPDP, 837, 835, 277,820, 270, 271, 5010 and ICD-10."}
{"text": "Gained a clear understanding of the claims adjudication and reimbursement systems based on HIPAA X12 5010 standards"}
{"text": "Interacted with the Subject Matter Experts (SMEs) and stakeholders, gathering business requirements to get a better understanding of client’s business processes."}
{"text": "Vigorously worked on Data Analysis and Report Analysis with respect to ICD 10 impact"}
{"text": "Identified risks, problems, requirements and concerns of the Hospital in order to comply with ICD 10 change"}
{"text": "Responsible for the development and implementation of HIPAA EDI Map sets 270,820, 271, 276, 277, 820, 834, 835, 837 and 5010."}
{"text": "Highly involved in giving education about ICD 10 codes and 5010 standards.  Also performed impact analysis for deadliness of ICD 10 conversions"}
{"text": "Actively involved in developing, executing and managing User Acceptance Testing (UAT)."}
{"text": "Managed Scope and change throughout the SDLC process of the product."}
{"text": "Performed extensive data modelling to differentiate between the OLTP and Data Warehouse data models."}
{"text": "Analyzed CMS comparison documentation highlighting changes of 5010 format and ICD10 diagnosis and procedure codes. "}
{"text": "Analyzed trading partner specifications and created EDI mapping guidelines."}
{"text": "Tested ANSI X12 / EDI 4010 transactions for (270, 271, 820,276, 277, 278, 834, 837P, 837I, and 837D)"}
{"text": "Healthcare system implementation including enterprise Electronic Medical Records (EMR) software."}
{"text": "Designed and developed use cases, activity diagrams, and sequence diagrams using UML."}
{"text": "Troubleshooted file transmission problems and assisted customers in a call center environment with EDI and Medicaid Insurance claim related inquiries explained and enforced guidelines in the X12 Implementation guides (837P, 837I, 837D, 270/271)."}
{"text": "Analyzed trading partner specifications and created EDI mapping guidelines."}
{"text": "The tests also included GUI testing Testing for validation and display of screens"}
{"text": "Environment: HIPAA,EDI,X12,SDLC,AGILE, ICD9,ICD 10,Microsoft Office Professional (Outlook, Word, Excel, Visio, Access, etc.), Microsoft Share Point ,UML, RUP, UAT, db2, Mercury Test Director, SQL, Clear Case."}
{"text": "Progressive Insurance, Iselin, NJ \tBusiness Analyst                              Aug-2008-Mar-2010\t\t\t\t\t\t\nProject Description: The project involved streamlining Progressive’s Insurance claims-processing system, providing an all-digital workflow and the ability to track performance. The automated web-based system allowed users to remotely monitor repair shop performance, make better use of claims staff and quickly add new functionalities to key systems.\nResponsibilities"}
{"text": "Led user interviews, and JAD sessions with end users, stakeholders, and developers to collect the functional and non-functional requirements of the system"}
{"text": "Involved in developing the business model for expediting the claim settlement process"}
{"text": "Performed document analysis involving creation of Use Cases and Use Case narrations using Microsoft Visio, in order to present the efficiency of the gathered requirements"}
{"text": "Involved in the analysis of the functional, technical specifications, data mapping document and conceptual diagrams"}
{"text": "Highly interacted with the development team and claim settlement experts making sure that the development of the project is meeting the business requirements."}
{"text": "Identified critical areas of business risk and modified the business process to reduce the same"}
{"text": "Wrote Business Requirements Specification(BRS) and Functional Requirements Specification(FRS) documents as per the business requirements and process flow"}
{"text": "Documented user stories and modeled use case diagrams by utilizing MS Visio"}
{"text": "Prepared Test Data for the Functional Test Cases"}
{"text": "Experience with PegaRules Process Commander in the implementation of the system to streamline various operations like credit cards and accounting management"}
{"text": "Evaluated test results and prepared test summary report"}
{"text": "Interacted with developers & various members of my team to discuss and resolve defects and their priorities"}
{"text": "Environment: SCRUM, Windows Oracle, Java, HTML, MS Office, MS Visio, MS Project, Mercury Suite of Testing Tool, MS Excel"}
{"text": ""}
{"text": ""}
{"text": ""}