{"text": "Name: clara clara"}
{"text": "E-Mail: clara.clara@gmail.com"}
{"text": "Address: Baghdad, Iraq"}
{"text": "Github: https://github.com/clara"}
{"text": "LinkedIn: https://linkedin.com/clara"}
{"text": "Phone No. 727870707314"}
{"text": ""}
{"text": ""}
{"text": "Highly motivated and result oriented with over 6years of industry experience as Business System Analyst/ Facets Analyst in Healthcare Industry."}
{"text": "Excellent in Developing and evaluating business process Models."}
{"text": "Proven success as a business system analyst through the years, providing a well-balanced understanding of business relationships, business requirements, functional requirements and technical solutions."}
{"text": "Strong understanding of project life cycle and SDLC methodologies including RUP, RAD, Waterfall and Agile."}
{"text": "Extensively involved in Facets billing module both in Back – End and Front – End data system for different Billing process documents which fulfilled the current business needs."}
{"text": "Expertise in EDI and HIPAA Testing Privacy with multiple transactions exposure such as 837 for submitting claims, 835 for payments, 834 for benefit enrolment, and 820 for premium payments to insurance products, 270, 271 for healthcare benefits and eligibility, 276, 277 for claims status and 278 for transmitting health care service information."}
{"text": "Experience in working with QA team to develop the Test plans, Test scenarios, Test procedures, and Test cases to ensure adequate testing of software both before and after completion"}
{"text": "Worked on various EDI X12 transaction sets 837 I/P, 275/276, 270/271, 834 etc "}
{"text": "Proficient in Requirement Analysis – conducting Stakeholder interviews & JAD sessions, understanding Business Process(As is and to be) & Business Rules, creating Flow charts, Data Flow diagrams, Use Case diagrams, ERD, State transition diagrams."}
{"text": "Extensive experience in Analysis, Implementation of Healthcare Application using Facets."}
{"text": "Extensive knowledge of Facets Billing, Enrolment and Claims processing."}
{"text": "Proficient skill in risk analysis, quality assurance plans, requirements documents, hardware/software specifications, Design Qualification (DQ), installation qualification (IQ), operational qualification (OQ), Process Qualification (PQ) and final report writing."}
{"text": "Expertise in GUI testing, functional testing, performance testing, UAT, unit testing, integration testing with the extensive knowledge of smoke testing, volume testing and stress/ load testing."}
{"text": "Solid understanding of Business Process definition, Risk Analysis and SDLC methodologies."}
{"text": "Experience with healthcare system, Medicaid and with prime focus on claims adjudication, provider, eligibility and prior authorization."}
{"text": "Proficient in the implementation of production change management techniques and service delivery disciplines"}
{"text": "Extensive experience in translating business requirements and user expectations into detailed specifications by using various Text formats & Unified Modeling Language (UML)."}
{"text": "Proven success as a business analyst through the years, providing a well-balanced understanding of business relationships, business requirements, and technical solutions."}
{"text": "Experienced with Data warehousing for Data Profiling to examine the data available in an existing database."}
{"text": "Professional experience in business analysis, operations management and development, design, documentation and testing."}
{"text": "Extensive experience in reviewing and understanding of Business & Testing requirements and writing detailed Test Plans, Test Cases, and Test Scripts."}
{"text": "Experience in implementing Microsoft Office SharePoint 2007 and 2010."}
{"text": "Advised management on improvement strategies, Competitive & Profitability Analysis."}
{"text": "Excellent in Business proposal Risk Assessment. Highly effective management and organizational skills with ability to prioritize."}
{"text": "Exposure to Client/Server, Web Application developmental tools and Software development and design.  "}
{"text": ""}
{"text": "Software/Hardware:"}
{"text": "C,C++,SQL, QTP, MS Windows NT 4.0/2000, Windows 95/98, Windows XP, MS Visual Studio, Power Builder 5, 6.5, 7, Rational Rose, UML 2.0 , RUP, NASCO, MS Visio , Crystal Reports, Oracle 6 / 7.x / 8i / 9i, Oracle – TOAD, Informatica, SharePoint, Business Object, ETL, PERL, MS Project, MS-Office, Caliber, HP Quality Center"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "Client: Emblem Health, New York, NY\t\t\t\t\t     May 14 - Present"}
{"text": ""}
{"text": "Role:  FacetsSystems Analyst"}
{"text": "Emblem Health uses FACETS, a fully integrated, intelligent data processing and management information system for managed healthcare. I am working under the project for provider and Member related changes in HIX (Health Information Exchange) and also worked on other Member related projects like HOMELESS INDICATOR, Demographic changes etc.We created functional requirements document for the project. Once FRD was created then did analysis on Functional Requirements and create as well as update the existing STTM document. Once the coding is done after that we create a testing scenarios and writing queries for testing specific fields in the oracle database."}
{"text": "Responsibilities:"}
{"text": "Conducted weekly meetings for deciding the Policies and Procedures to be followed while gathering Functional Requirements."}
{"text": "Extracted the Functional Requirements from the end users keeping in mind their need for the application and prepared Functional Requirement Documents (FRD)."}
{"text": "Performed the requirement analysis, impact analysis and documented the Analysis Result into mapping document."}
{"text": "Used Facets Analytics for fast and easy retrieval, display and grouping of information for performing queries and generating reports. "}
{"text": "Served as a liaison between the internal and external business community (Claims, Billing, Membership, Capitation, Customer service, membership management, provider management, advanced Healthcare management, provider agreement management) and the project team."}
{"text": "Assisted JAD sessions to identify the business flows and determine whether any current or proposed systems are impacted by the EDI X12 Transaction, Code set and Identifier aspects of HIPAA. "}
{"text": "Involved in the full HIPAA compliance lifecycle from GAP analysis, mapping, implementation, and testing for processing of Medicaid Claims. Worked on EDI transactions: 270, 271, 834, 835, and 837 (P.I.D) to identify key data set elements for designated record set. Interacted with Claims, Payments and Enrolment hence analysing and documenting related business processes."}
{"text": "Work closely with Business Owners and Subject matter expert to outline Functional Requirements and Requirement Analysis. "}
{"text": "Facets Product Configuration of new products and components including research, testing and trouble shooting in FACETS."}
{"text": "Reviewed and analyzed data from various internal sources and Created STTM document."}
{"text": "Identified gaps and performed gap analysis. "}
{"text": "Understand the flow of data, Reviewed and analyzed data from various sources."}
{"text": "Conducting session with developing teams for the coding of functional requirement for projects."}
{"text": "Identified/documented data sources and transformation rules required to populate and maintain data warehouse content. "}
{"text": "Studied previously created mapping document and updating them according to the new requirement."}
{"text": "Creating the testing scenarios, Queries, and test the different individual field. Related with the OBAMACARE health plan."}
{"text": "Work with developing team to solve the defects generated by the Testing team."}
{"text": "Uploading and Modifying document on SharePoint Site."}
{"text": "Environment: Windows Vista, Toad-11,Toad-Data Modeler, HP Quality Center, MS Excel, MS Word, Visio, MS Power Point, SQL, SharePoint 2010, Data stage 8.1, Ms Visual Studio ."}
{"text": ""}
{"text": "Client: CIGNA Healthcare, Greenwood Village, CO\t\t\tJan13- May 14"}
{"text": ""}
{"text": "Role:    Sr. Business System Analyst"}
{"text": "I worked under the project CAQH (Proclaim, CDB, EPRO, Facets) and also working on couple of more facets related projects like CDHP etc..We created functional requirements document for CAQH project. Once FRD was created then did analysis on Functional Requirements and create as well as update the mapping document. Currently the project is in testing phase and I am helping the Testing team for testing scenarios and writing queries for testing specific fields in the oracle database."}
{"text": "Responsibilities:"}
{"text": ""}
{"text": "Conducted weekly meetings for deciding the Policies and Procedures to be followed while gathering Functional Requirements."}
{"text": "Extracted the Functional Requirements from the end users keeping in mind their need for the application and prepared Functional Requirement Documents (FRD) includes information of Functional Specification Document (FSD)."}
{"text": "Performed the requirement analysis, impact analysis and documented the Analysis Result into mapping document."}
{"text": "Involved in requirement gathering and testing of consumer web portal for the enrollment of Medicare members. "}
{"text": "Worked on billing system a cash management module and enhanced the encrypting standards that are required for the application."}
{"text": "Work closely with Business Owners and Subject matter expert to outline Functional Requirements and Requirement Analysis. "}
{"text": "Reviewed and analyzed data from various internal sources."}
{"text": "Ability to analyse data and Business Process Flow across multiple platforms like Oracle Database and Mainframe."}
{"text": "Defined Functional Test Cases, documented, Executed test script in Facets system."}
{"text": "Identified the impacts the HIPPA 5010 & ICD 10 project had on enrolment Claims, FEP (Medicare and Medicaid program)"}
{"text": "Identified gaps and performed gap analysis."}
{"text": "Created Mapping Documents, Report Mock-ups and modified existing report mock-ups and finalized for development."}
{"text": "Discuss with Business Team and Update the BRD to expand the functionality for the Claim Processing."}
{"text": "Gather the requirements for 270/271 (Generate the 271 response as per Clients Requests on 270)"}
{"text": "Designed and development of test cases based on functional requirements for Institutional and Professional claims for EDI (Electronic data interchange) and HIPAA Transactions 837/835, 834, 270/271 testing."}
{"text": "Responsible for integrating with Facets .Designing test scripts for testing of Claims in Development, Integration and production environment.Thoroughly analyzed impacts to the system components (DB2 tables, copybook, and the data warehouse) in order to support the current functions, as well as prepare for updated or changed functions identified in the Business Rules Comparison. "}
{"text": "Created a fast track mapping document for the defects filed which help the developing team to fix those defects."}
{"text": "Created Functional Requirements for the 834 enrolment files with their changed benefits in the Medicare program."}
{"text": "Understand the flow of data, Reviewed and analyzed data from various sources."}
{"text": "Conducting session with developing teams for the coding of functional requirement for projects."}
{"text": "Studied previously created mapping document and updating them according to the new requirement."}
{"text": "Work with testing team to create the testing scenarios, Queries, helping them to understand the logic."}
{"text": "Work with developing team to solve the defects generated by the Testing team."}
{"text": "Conducted UAT to confirm that all derivative products can be successfully processed through stages of the trade life cycle."}
{"text": "Worked with Testing Team to solve the defects identifying during the regression testing, System testing and UAT testing."}
{"text": "Uploading and Modifying document on SharePoint Site."}
{"text": "Environment:Windows XP (SP-3), Caliber, Toad-11,Toad-Data Modeler, HP Quality Center, MS Excel, MS Word, Visio, MS Power Point, SQL, DB2, SharePoint 2010."}
{"text": ""}
{"text": "Client: Genworth Financial, Richmond, VA\t\t\t\tApr 10- Dec 12"}
{"text": "Role:    BusinessAnalyst"}
{"text": "Genworth Financial provides products that include fixed and variable annuities, life insurance, long-term care insurance, and a linked-benefits product that combines long-term care insurance with universal life insurance. ANB 3.0 was undertaken to improve the new business experience for the financial advisor, reduce annuities processing cost per application and deliver a processing solution that offers new business leadership flexible scalability options. The project involved delivering a new workflow and a processing system to increase the market share in the annuities space, thereby increasing overall scalability."}
{"text": "Responsibilities:"}
{"text": "Interacting with the stakeholders to get a better understanding of client business processes and gather business requirements."}
{"text": "Identified Use cases from the requirements and wrote Use Case Specifications"}
{"text": "Created business process workflow diagrams (Activity diagrams) in Rational Rose"}
{"text": "Link business processes to organizational objectives, perform critical path analysis, and identify opportunities for business process improvement"}
{"text": "Created Use-Cases and Business Use-Case Model after accessing the status and scope of the project and understanding the business processes "}
{"text": "Integrated Requisite Pro with Clear Quest and Rose to provide all teams visibility and maintain tractability among requirements, use cases and change requests"}
{"text": "Managed all the requirements in Requisite Pro, making requirements available to all team members."}
{"text": "Performed Data mapping, logical data modelling, created class diagrams and ER diagrams and used SQL queries to filter data "}
{"text": "Designed Data Flow Diagrams (DFD’s), Entity Relationship Diagrams (ERD’s), and web page mock ups using modelling tools."}
{"text": "Performed Data Analysis of existing data through SQL."}
{"text": "Created test plan and test cases for user acceptance testing. Used Rational testing tools.  "}
{"text": "Conducted informal Sessions to develop an architectural solution that the application meets the business requirements, resolve open issues, and change requests "}
{"text": "Used the Unified Change Management from Rational to track changes to multiple artifacts by versioning artifacts, associating requirements to specific change request/defects to streamline the defect/change tracking process."}
{"text": "Performed Feasibility Analysis and Risk Analysis on vendor/third party tools."}
{"text": "Assured that all artifacts are in compliance with corporate SDLC Policies and guidelines. "}
{"text": "Coordinated and prioritized outstanding defects and enhancement/system requests based on business requirements, allowing sufficient time frame to ensure accuracy and consider deadlines."}
{"text": "Monitored client expectations and conducted user interviews"}
{"text": "Environment: Rational Rose, Rational Requisite Pro, DB2,  Rational Clear Quest, Rational manager, Rational Administrator, SQA Basic, DOORS, SQL, VB.Net, Oracle, IBM Business Modeler, UML."}
{"text": ""}
{"text": ""}
{"text": "Client :\tAffinity Health Plan, NYC, NY \t\t\t\t Jul09– Mar 10"}
{"text": ""}
{"text": "Role: \tBusiness Analyst"}
{"text": "Affinity Health Plan is an independent, non-profit managed care plan that serves the needs of over 210,000 underserved residents of the New York Metropolitan Area (New York City, Long Island, Westchester, Rockland and Orange Counties.) Affinity provides healthcare coverage through its Child Health Plus, Family Health Plus and Medicaid programs. Affinity Health Plan implemented Facets Extended Enterprise(TM) administrative system, a new core system, with updated technology to allow for more efficient claims processing, membership enrolment and provider data maintenance. Facets was highly efficient, automated, customizable, and flexible, to help affinity tackle new business opportunities and compete successfully in a dynamic healthcare industry. Moreover, TriZetto provided ongoing support and training."}
{"text": "Responsibilities:"}
{"text": "Used Requisite Pro for the Requirement Documents Preparation and Prepared Business Process Models that includes modelling of all the activities of the business from the conceptual to procedural level. Followed top down, leveled technique for building Business Process Models. "}
{"text": "Played a key role in the planning, user acceptance testing (UAT), and implementation of system developments and enhancements."}
{"text": "Modelled the As-Is system and performed a complete Gap Analysis to identify to-be state "}
{"text": "Defined Functional Test Cases, documented , Executed test script in Facets system"}
{"text": "Worked with the full SDLC, elicit, analyse and define requirements. "}
{"text": "Responsible for architecting integrated, Medicare solutions, Facets."}
{"text": "Created Use Cases / Activity Diagrams / State Chart Diagrams, Sequence Diagrams, and Collaboration "}
{"text": "Designed High level design, for new process, integrating with legacy and Facets."}
{"text": "Diagrams thus defining the Data Process Model and Business Process Model. "}
{"text": "Assisted in on-going process improvement efforts to ensure Test Planning, Execution, and Reporting is effective, efficient, standardized, coordinated, and integrated. "}
{"text": "Developed business process models in RUP to document existing and future business processes."}
{"text": "Worked on data modelling and produced data mapping and data definition documentation"}
{"text": "Worked in mainframe environment and used SQL to query various reporting databases."}
{"text": "Evaluated the Rational comprehensive approach to software development, featuring seamless integration between tools, services and best practices, enables the organization to successfully deliver high quality software while deriving impressive business benefits for their customers. "}
{"text": "Involved in generation and execution of SQL queries. "}
{"text": "Environment: Microsoft Office Suite, MS Visio, Java, C, Windows NT, SharePoint, Crystal Reports, JavaScript, UNIX, HTML, Oracle, SQL, Mercury TestDirector, Mainframe, Mercury LoadRunner"}
{"text": ""}
{"text": "Client:\tBarclays Capital, NY            \t\t\t\t\t\tSep 08 – Jun 09"}
{"text": ""}
{"text": "Role:\tBusiness/Systems Analyst\t\t\t"}
{"text": "Barclays Capital Financial services provider engaged in retail and commercial banking, credit cards, investment banking, Mergers & Acquisitions, wealth management and investment management services. The objective was to assist Managers in carrying out various kinds of Mergers & Acquisition analysis and also worked as a credit analyst for a brief period of time also developeddata conversionstrategy for data migration fromlegacysystems to Technology product modules.For the functionality of the client, customer and sales divisions used Loan Origination Systems (LOS) LPS Empower. Interfaces to other products and legacy systems including Lending exchange with ability to electronically order/track document services such as appraisal, credit reports, etc."}
{"text": "Responsibilities:"}
{"text": "Created detailed Use Case documents, Business Requirement Document, Functional Requirement Documents (FRD) and other business documents necessary for the development team and their better understanding of project milestones."}
{"text": "Facilitated and managed meeting sessions with committee of SMEs from various business areas of Mortgage."}
{"text": "Conducted JAD sessions with stakeholders, management and LPS technical team to determine the scope, processes and requirements of the project"}
{"text": "Primary duties included analyzing existing Client Server Empower platform and work towards making it better and robust."}
{"text": "Assisted Project manager in establishing project methodology, estimating resource needs, handling conflicts with finances and deadlines and presenting propositions to project sponsors."}
{"text": "Involved in Client and user group interaction, Design and Specification development based on discussions with various users from different departments and studying the existing system."}
{"text": "Developed script to perform Data validation on Account level by using Teradata SQL Assistant, SQL scripts."}
{"text": "Exposed to and worked with Subject Matter Experts in Fixed Income Annuities, Equities, Swaps, Finance, Trading Cycle, Portfolio Analysis & Management, Asset Management, Bonds and Bond Trading Cycle, Pricing, Derivatives. "}
{"text": "Worked on compliance related regulatory issues."}
{"text": "Performed Data mapping, logical data modeling, created class diagrams and ER diagrams and used SQL queries to filter data."}
{"text": "Modifying existing reporting procedures to eliminate dependence on current Client Server Empower systems thus making reporting error free and accurate. It involved migrating existing processes from Client Server Empower systems to Empower.net systems."}
{"text": "Obtained Data requirements, identified data sources, determined the content of data fields and created Data Mapping Documents and performed Data Extraction and Data Compilation using SQL queries."}
{"text": "Preparing for conducted User Acceptance Testing (UAT) before Empower.net can be released."}
{"text": "Designed, developed, and maintained various Business unit reports by using Teradata, SQL, and Ms Excel."}
{"text": "Extract data from Teradata, Excel and flat files into SAS Datasets."}
{"text": "Worked closely with the technical and QA teams during all phases of the project starting from inception to transition."}
{"text": "Environment: Microsoft Office Suite, Casewise modeler, Borland Caliber RM, Unix, Documentum, Windows NT/XP, Oracle, SQL, SQL Server, Sybase, VBScript, C#. DOORS, C++, NET, ASP.NET, Business Objects, Test Director, Load Runner"}
{"text": ""}